frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
/* Based on CPU DB MC9S12XEQ512_144, version 3.00.034 (RegistersPrg V2.32) */
/*
** ###################################################################
**     Filename  : mc9s12xeq512.h
**     Processor : MC9S12XEQ512CAG
**     FileFormat: V2.32
**     DataSheet : MC9S12XEP100 Rev. 1.19 12/2008
**     Compiler  : CodeWarrior compiler
**     Date/Time : 7.6.2010, 15:30
**     Abstract  :
**         This header implements the mapping of I/O devices.
**
**     Copyright : 1997 - 2010 Freescale Semiconductor, Inc. All Rights Reserved.
**     
**     http      : www.freescale.com
**     mail      : support@freescale.com
**
**     CPU Registers Revisions:
**      - 02.05.2006, VV2.87.007:
**              - Corrected registers addresses:
**              - MPUSEL 118 => 119
**              - MPUDESC0 119 => 11A
**              - MPUDESC1 11A => 11B
**              - MPUDESC2 11B => 11C
**              - MPUDESC3 11C => 11D
**              - MPUDESC4 11D => 11E
**              - MPUDESC5 11E => 11F
**              -   REASON: Bug-fix (#3266 in Issue Manager)
**      - 15.08.2006, VV2.87.056:
**              - Added register POSTDIV.
**              -   REASON: Bug-fix (#3605 in Issue Manager)
**      - 17.04.2007, VV2.87.066:
**              - Renamed bits DBGXDH_BIT0..7 ==> DBGXDH_BIT8..15, SYNR_SYNx ==> SYNR_SYNDIVx,
**              - REFDV_REFDVx ==> REFDV_REFDIVx,ECT_PAyH_BITx ==> ECT_PAyH_PAyHx, ECT_TCyH_BITx ==> ECT_TCyH_TCx, ATD1CTL2_ASCIF ==>  ATD1CTL2_ACMPIE,
**              - FCLKDIV_PRDIV8 ==> FCLKDIV_FDIV6, TIM_TCNTH/L_BITx ==> TIM_TCNTH/L_TCNTx, TIM_PACNT_BITx ==> TIM_PACNT_PACNTx,
**              - NVFPROT_NV6 ==>  NVFPROT_RNV6, NVFSEC_NVx ==>  NVFSEC_RNVx.
**              - Renamed registers XGIF0 ==> XGIF_7F_70 ... XGIF7 ==> XGIF_0F_00.
**              - Renamed CAN buffers *RX/TX* ==> *R/T*(for example CAN1TXIDR1 ==> CAN1TIDR1).
**              - Redefined PT/DDR/RDR/PERxAD0/1 registers.
**              -   REASON: Bug-fix (#4548 in Issue Manager).
**      - 04.10.2007, V3.00.0:
**              - Renamed bits IICx_IBAD[ADx] ==> IICx_IBAD[ADRx](EQ512 only), IICx_IBCR2[ADx] ==> IICx_IBCR2[ADRx].
**              -   REASON: Bug-fix (#5072 in Issue Manager).
**              - Removed bits PAxH_BIT0..BIT7/15, TCxH..BIT0..BIT7/15.
**              -   REASON: Access to the individual bits is not necessary (issue #5192 in Issue Manager).
**              - Removed interrupt vectors for TIM module(No. 85-95).
**              - Renamed interrupt vectors VReserved65 ==> Vhti, Vflashfault ==> Vflashfd.
**              - Added interrupt vectors Viic1, Vsci5, Vsci3(EQ384 only).
**              - Renamed bits ATDxCTL2_AWAI ==> ATDxCTL2_ICLKSTP, XGMCTL_XGSWEIFM ==> XGMCTL_XGSWEFM, NVFSEC_RNV6 ==> NVFSEC_KEYEN0.
**              - Renamed CAN Buffers: *R/T* ==> *RX/TX* (for example CAN1TIDR1 ==> CAN1TXIDR1).
**              - Removed bits FERCNFG_EACCEIE, ECT_TCNT[TCNTx](EQ384 only).
**              - Added register VREGHTTR, added bits VREGHTCL[HTIF, HTIE, HTDS, HTEN].
**              - Added registers for IIC1, SCI3, SCI5 modules(EQ384 only).
**              - Corrected registers addresses: NVEPROT 0xFF0C => 0xFF0D, NVFPROT 0xFF0D => 0xFF0C.
**              -   REASON: Bug-fix (#5330 in Issue Manager).
**      - 11.01.2008, V3.00.1:
**              - Renamed interrupt vectors Vtimmdcu ==> Vectmdcu, Vtimpabovf ==> Vectpabovf.
**              -   REASON: Bug-fix (#5415 in Issue Manager).
**      - 14.11.2008, V3.00.2:
**              - Corrected definition of depreciated symbols.
**              -   REASON: Bug-fix(#6592 in Issue Manager).
**      - 14.11.2008, V3.00.3:
**              - Renamed bits IBCR2[ADR2:0] -> IBCR2[ADR10:8].
**              -   REASON: Bug-fix(#6799 in Issue Manager).
**
**     File-Format-Revisions:
**      - 27.10.2006, V2.10 :
**               - __RESET_WATCHDOG improved formating and re-definition
**      - 23.11.2006, V2.11 :
**               - Changes have not affected this file (because they are related to another family)
**      - 22.01.2007, V2.12 :
**               - Fixed declaration of non volatile registers. Now it does not require (but allows) their initialization, see issue #4086.
**      - 01.03.2007, V2.13 :
**               - Flash commands constants values converted to HEX format
**      - 02.03.2007, V2.14 :
**               - Interrupt vector numbers added into .H, see VectorNumber_*
**      - 26.03.2007, V2.15 :
**               - Changes have not affected this file (because they are related to another family)
**      - 10.05.2007, V2.16 :
**               - Changes have not affected this file (because they are related to another family)
**      - 05.06.2007, V2.17 :
**               - Changes have not affected this file (because they are related to another family)
**      - 19.07.2007, V2.18 :
**               - Improved number of blanked lines inside register structures
**      - 06.08.2007, V2.19 :
**               - CPUDB revisions generated ahead of the file-format revisions.
**      - 11.09.2007, V2.20 :
**               - Added comment about initialization of unbonded pins.
**      - 02.01.2008, V2.21 :
**               - Changes have not affected this file (because they are related to another family)
**      - 13.02.2008, V2.22 :
**               - Changes have not affected this file (because they are related to another family)
**      - 20.02.2008, V2.23 :
**               - Termination of pragma V30toV31Compatible added, #5708
**      - 03.07.2008, V2.24 :
**               - Added support for bits with name starting with number (like "1HZ")
**      - 28.11.2008, V2.25 :
**               - StandBy RAM array declaration for ANSI-C added
**      - 1.12.2008, V2.26 :
**               - Duplication of bit (or bit-group) name with register name is not marked as a problem, is register is internal only and it is not displayed in I/O map.
**      - 17.3.2009, V2.27 :
**               - Merged bit-group is not generated, if the name matches with another bit name in the register
**      - 6.4.2009, V2.28 :
**               - Fixed generation of merged bits for bit-groups with a digit at the end, if group-name is defined in CPUDB
**      - 3.8.2009, V2.29 :
**               - If there is just one bits group matching register name, single bits are not generated
**      - 10.9.2009, V2.30 :
**               - Fixed generation of registers arrays.
**      - 15.10.2009, V2.31 :
**               - Changes have not affected this file (because they are related to another family)
**      - 18.05.2010, V2.32 :
**               - MISRA compliance: U/UL suffixes added to all numbers (_MASK,_BITNUM and addresses)
**
**     Not all general-purpose I/O pins are available on all packages or on all mask sets of a specific
**     derivative device. To avoid extra current drain from floating input pins, the user’s reset
**     initialization routine in the application program must either enable on-chip pull-up devices
**     or change the direction of unconnected pins to outputs so the pins do not float.
** ###################################################################
*/

#ifndef _MC9S12XEQ512_H
#define _MC9S12XEQ512_H

/*lint -save  -e950 -esym(960,18.4) -e46 -esym(961,19.7) Disable MISRA rule (1.1,18.4,6.4,19.7) checking. */
/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

#define REG_BASE 0x0000                /* Base address for the I/O register block */


#pragma MESSAGE DISABLE C1106 /* WARNING C1106: Non-standard bitfield type */
#pragma OPTION ADD V30toV31Compatible "-BfaGapLimitBits4294967295" /*this guarantee correct bitfield positions*/

