frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
  struct {
    word CCF0        :1;                                       /* Conversion Complete Flag 0 */
    word CCF1        :1;                                       /* Conversion Complete Flag 1 */
    word CCF2        :1;                                       /* Conversion Complete Flag 2 */
    word CCF3        :1;                                       /* Conversion Complete Flag 3 */
    word CCF4        :1;                                       /* Conversion Complete Flag 4 */
    word CCF5        :1;                                       /* Conversion Complete Flag 5 */
    word CCF6        :1;                                       /* Conversion Complete Flag 6 */
    word CCF7        :1;                                       /* Conversion Complete Flag 7 */
    word CCF8        :1;                                       /* Conversion Complete Flag 8 */
    word CCF9        :1;                                       /* Conversion Complete Flag 9 */
    word CCF10       :1;                                       /* Conversion Complete Flag 10 */
    word CCF11       :1;                                       /* Conversion Complete Flag 11 */
    word CCF12       :1;                                       /* Conversion Complete Flag 12 */
    word CCF13       :1;                                       /* Conversion Complete Flag 13 */
    word CCF14       :1;                                       /* Conversion Complete Flag 14 */
    word CCF15       :1;                                       /* Conversion Complete Flag 15 */
  } Bits;
} ATD1STAT2STR;
extern volatile ATD1STAT2STR _ATD1STAT2 @(REG_BASE + 0x0000008AUL);
#define ATD1STAT2                       _ATD1STAT2.Word
#define ATD1STAT2_CCF0                  _ATD1STAT2.Bits.CCF0
#define ATD1STAT2_CCF1                  _ATD1STAT2.Bits.CCF1
#define ATD1STAT2_CCF2                  _ATD1STAT2.Bits.CCF2
#define ATD1STAT2_CCF3                  _ATD1STAT2.Bits.CCF3
#define ATD1STAT2_CCF4                  _ATD1STAT2.Bits.CCF4
#define ATD1STAT2_CCF5                  _ATD1STAT2.Bits.CCF5
#define ATD1STAT2_CCF6                  _ATD1STAT2.Bits.CCF6
#define ATD1STAT2_CCF7                  _ATD1STAT2.Bits.CCF7
#define ATD1STAT2_CCF8                  _ATD1STAT2.Bits.CCF8
#define ATD1STAT2_CCF9                  _ATD1STAT2.Bits.CCF9
#define ATD1STAT2_CCF10                 _ATD1STAT2.Bits.CCF10
#define ATD1STAT2_CCF11                 _ATD1STAT2.Bits.CCF11
#define ATD1STAT2_CCF12                 _ATD1STAT2.Bits.CCF12
#define ATD1STAT2_CCF13                 _ATD1STAT2.Bits.CCF13
#define ATD1STAT2_CCF14                 _ATD1STAT2.Bits.CCF14
#define ATD1STAT2_CCF15                 _ATD1STAT2.Bits.CCF15

#define ATD1STAT2_CCF0_MASK             1U
#define ATD1STAT2_CCF1_MASK             2U
#define ATD1STAT2_CCF2_MASK             4U
#define ATD1STAT2_CCF3_MASK             8U
#define ATD1STAT2_CCF4_MASK             16U
#define ATD1STAT2_CCF5_MASK             32U
#define ATD1STAT2_CCF6_MASK             64U
#define ATD1STAT2_CCF7_MASK             128U
#define ATD1STAT2_CCF8_MASK             256U
#define ATD1STAT2_CCF9_MASK             512U
#define ATD1STAT2_CCF10_MASK            1024U
#define ATD1STAT2_CCF11_MASK            2048U
#define ATD1STAT2_CCF12_MASK            4096U
#define ATD1STAT2_CCF13_MASK            8192U
#define ATD1STAT2_CCF14_MASK            16384U
#define ATD1STAT2_CCF15_MASK            32768U


/*** ATD1DIEN - ATD 1 Input Enable Register; 0x0000008C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1DIENH - ATD 1 Input Enable Register High; 0x0000008C ***/
    union {
      byte Byte;
      struct {
        byte IEN8        :1;                                       /* ATD Digital Input Enable on channel 8 */
        byte IEN9        :1;                                       /* ATD Digital Input Enable on channel 9 */
        byte IEN10       :1;                                       /* ATD Digital Input Enable on channel 10 */
        byte IEN11       :1;                                       /* ATD Digital Input Enable on channel 11 */
        byte IEN12       :1;                                       /* ATD Digital Input Enable on channel 12 */
        byte IEN13       :1;                                       /* ATD Digital Input Enable on channel 13 */
        byte IEN14       :1;                                       /* ATD Digital Input Enable on channel 14 */
        byte IEN15       :1;                                       /* ATD Digital Input Enable on channel 15 */
      } Bits;
    } ATD1DIENHSTR;
    #define ATD1DIENH                   _ATD1DIEN.Overlap_STR.ATD1DIENHSTR.Byte
    #define ATD1DIENH_IEN8              _ATD1DIEN.Overlap_STR.ATD1DIENHSTR.Bits.IEN8
    #define ATD1DIENH_IEN9              _ATD1DIEN.Overlap_STR.ATD1DIENHSTR.Bits.IEN9
    #define ATD1DIENH_IEN10             _ATD1DIEN.Overlap_STR.ATD1DIENHSTR.Bits.IEN10
    #define ATD1DIENH_IEN11             _ATD1DIEN.Overlap_STR.ATD1DIENHSTR.Bits.IEN11
    #define ATD1DIENH_IEN12             _ATD1DIEN.Overlap_STR.ATD1DIENHSTR.Bits.IEN12
    #define ATD1DIENH_IEN13             _ATD1DIEN.Overlap_STR.ATD1DIENHSTR.Bits.IEN13
    #define ATD1DIENH_IEN14             _ATD1DIEN.Overlap_STR.ATD1DIENHSTR.Bits.IEN14
    #define ATD1DIENH_IEN15             _ATD1DIEN.Overlap_STR.ATD1DIENHSTR.Bits.IEN15
    
    #define ATD1DIENH_IEN8_MASK         1U
    #define ATD1DIENH_IEN9_MASK         2U
    #define ATD1DIENH_IEN10_MASK        4U
    #define ATD1DIENH_IEN11_MASK        8U
    #define ATD1DIENH_IEN12_MASK        16U
    #define ATD1DIENH_IEN13_MASK        32U
    #define ATD1DIENH_IEN14_MASK        64U
    #define ATD1DIENH_IEN15_MASK        128U
    

    /*** ATD1DIENL - ATD 1 Input Enable Register Low; 0x0000008D ***/
    union {
      byte Byte;
      struct {
        byte IEN0        :1;                                       /* ATD Digital Input Enable on channel 0 */
        byte IEN1        :1;                                       /* ATD Digital Input Enable on channel 1 */
        byte IEN2        :1;                                       /* ATD Digital Input Enable on channel 2 */
        byte IEN3        :1;                                       /* ATD Digital Input Enable on channel 3 */
        byte IEN4        :1;                                       /* ATD Digital Input Enable on channel 4 */
        byte IEN5        :1;                                       /* ATD Digital Input Enable on channel 5 */
        byte IEN6        :1;                                       /* ATD Digital Input Enable on channel 6 */
        byte IEN7        :1;                                       /* ATD Digital Input Enable on channel 7 */
      } Bits;
    } ATD1DIENLSTR;
    #define ATD1DIENL                   _ATD1DIEN.Overlap_STR.ATD1DIENLSTR.Byte
    #define ATD1DIENL_IEN0              _ATD1DIEN.Overlap_STR.ATD1DIENLSTR.Bits.IEN0
    #define ATD1DIENL_IEN1              _ATD1DIEN.Overlap_STR.ATD1DIENLSTR.Bits.IEN1
    #define ATD1DIENL_IEN2              _ATD1DIEN.Overlap_STR.ATD1DIENLSTR.Bits.IEN2
    #define ATD1DIENL_IEN3              _ATD1DIEN.Overlap_STR.ATD1DIENLSTR.Bits.IEN3
    #define ATD1DIENL_IEN4              _ATD1DIEN.Overlap_STR.ATD1DIENLSTR.Bits.IEN4
    #define ATD1DIENL_IEN5              _ATD1DIEN.Overlap_STR.ATD1DIENLSTR.Bits.IEN5
    #define ATD1DIENL_IEN6              _ATD1DIEN.Overlap_STR.ATD1DIENLSTR.Bits.IEN6
    #define ATD1DIENL_IEN7              _ATD1DIEN.Overlap_STR.ATD1DIENLSTR.Bits.IEN7
    
