frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
  struct {
    word BIT0        :1;                                       /* Bit 0 */
    word BIT1        :1;                                       /* Bit 1 */
    word BIT2        :1;                                       /* Bit 2 */
    word BIT3        :1;                                       /* Bit 3 */
    word BIT4        :1;                                       /* Bit 4 */
    word BIT5        :1;                                       /* Bit 5 */
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
} ATD1DR9STR;
extern volatile ATD1DR9STR _ATD1DR9 @(REG_BASE + 0x000000A2UL);
#define ATD1DR9                         _ATD1DR9.Word
#define ATD1DR9_BIT0                    _ATD1DR9.Bits.BIT0
#define ATD1DR9_BIT1                    _ATD1DR9.Bits.BIT1
#define ATD1DR9_BIT2                    _ATD1DR9.Bits.BIT2
#define ATD1DR9_BIT3                    _ATD1DR9.Bits.BIT3
#define ATD1DR9_BIT4                    _ATD1DR9.Bits.BIT4
#define ATD1DR9_BIT5                    _ATD1DR9.Bits.BIT5
#define ATD1DR9_BIT6                    _ATD1DR9.Bits.BIT6
#define ATD1DR9_BIT7                    _ATD1DR9.Bits.BIT7
#define ATD1DR9_BIT8                    _ATD1DR9.Bits.BIT8
#define ATD1DR9_BIT9                    _ATD1DR9.Bits.BIT9
#define ATD1DR9_BIT10                   _ATD1DR9.Bits.BIT10
#define ATD1DR9_BIT11                   _ATD1DR9.Bits.BIT11
#define ATD1DR9_BIT12                   _ATD1DR9.Bits.BIT12
#define ATD1DR9_BIT13                   _ATD1DR9.Bits.BIT13
#define ATD1DR9_BIT14                   _ATD1DR9.Bits.BIT14
#define ATD1DR9_BIT15                   _ATD1DR9.Bits.BIT15

#define ATD1DR9_BIT0_MASK               1U
#define ATD1DR9_BIT1_MASK               2U
#define ATD1DR9_BIT2_MASK               4U
#define ATD1DR9_BIT3_MASK               8U
#define ATD1DR9_BIT4_MASK               16U
#define ATD1DR9_BIT5_MASK               32U
#define ATD1DR9_BIT6_MASK               64U
#define ATD1DR9_BIT7_MASK               128U
#define ATD1DR9_BIT8_MASK               256U
#define ATD1DR9_BIT9_MASK               512U
#define ATD1DR9_BIT10_MASK              1024U
#define ATD1DR9_BIT11_MASK              2048U
#define ATD1DR9_BIT12_MASK              4096U
#define ATD1DR9_BIT13_MASK              8192U
#define ATD1DR9_BIT14_MASK              16384U
#define ATD1DR9_BIT15_MASK              32768U


/*** ATD1DR10 - ATD 1 Conversion Result Register 10; 0x000000A4 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1DR10H - ATD 1 Conversion Result Register 10 High; 0x000000A4 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
    } ATD1DR10HSTR;
    #define ATD1DR10H                   _ATD1DR10.Overlap_STR.ATD1DR10HSTR.Byte
    #define ATD1DR10H_BIT8              _ATD1DR10.Overlap_STR.ATD1DR10HSTR.Bits.BIT8
    #define ATD1DR10H_BIT9              _ATD1DR10.Overlap_STR.ATD1DR10HSTR.Bits.BIT9
    #define ATD1DR10H_BIT10             _ATD1DR10.Overlap_STR.ATD1DR10HSTR.Bits.BIT10
    #define ATD1DR10H_BIT11             _ATD1DR10.Overlap_STR.ATD1DR10HSTR.Bits.BIT11
    #define ATD1DR10H_BIT12             _ATD1DR10.Overlap_STR.ATD1DR10HSTR.Bits.BIT12
    #define ATD1DR10H_BIT13             _ATD1DR10.Overlap_STR.ATD1DR10HSTR.Bits.BIT13
    #define ATD1DR10H_BIT14             _ATD1DR10.Overlap_STR.ATD1DR10HSTR.Bits.BIT14
    #define ATD1DR10H_BIT15             _ATD1DR10.Overlap_STR.ATD1DR10HSTR.Bits.BIT15
    
    #define ATD1DR10H_BIT8_MASK         1U
    #define ATD1DR10H_BIT9_MASK         2U
    #define ATD1DR10H_BIT10_MASK        4U
    #define ATD1DR10H_BIT11_MASK        8U
    #define ATD1DR10H_BIT12_MASK        16U
    #define ATD1DR10H_BIT13_MASK        32U
    #define ATD1DR10H_BIT14_MASK        64U
    #define ATD1DR10H_BIT15_MASK        128U
    

    /*** ATD1DR10L - ATD 1 Conversion Result Register 10 Low; 0x000000A5 ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Bit 0 */
        byte BIT1        :1;                                       /* Bit 1 */
        byte BIT2        :1;                                       /* Bit 2 */
        byte BIT3        :1;                                       /* Bit 3 */
        byte BIT4        :1;                                       /* Bit 4 */
        byte BIT5        :1;                                       /* Bit 5 */
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
    } ATD1DR10LSTR;
    #define ATD1DR10L                   _ATD1DR10.Overlap_STR.ATD1DR10LSTR.Byte
    #define ATD1DR10L_BIT0              _ATD1DR10.Overlap_STR.ATD1DR10LSTR.Bits.BIT0
    #define ATD1DR10L_BIT1              _ATD1DR10.Overlap_STR.ATD1DR10LSTR.Bits.BIT1
    #define ATD1DR10L_BIT2              _ATD1DR10.Overlap_STR.ATD1DR10LSTR.Bits.BIT2
    #define ATD1DR10L_BIT3              _ATD1DR10.Overlap_STR.ATD1DR10LSTR.Bits.BIT3
    #define ATD1DR10L_BIT4              _ATD1DR10.Overlap_STR.ATD1DR10LSTR.Bits.BIT4
    #define ATD1DR10L_BIT5              _ATD1DR10.Overlap_STR.ATD1DR10LSTR.Bits.BIT5
    #define ATD1DR10L_BIT6              _ATD1DR10.Overlap_STR.ATD1DR10LSTR.Bits.BIT6
    #define ATD1DR10L_BIT7              _ATD1DR10.Overlap_STR.ATD1DR10LSTR.Bits.BIT7
    
    #define ATD1DR10L_BIT0_MASK         1U
    #define ATD1DR10L_BIT1_MASK         2U
    #define ATD1DR10L_BIT2_MASK         4U
    #define ATD1DR10L_BIT3_MASK         8U
    #define ATD1DR10L_BIT4_MASK         16U
    #define ATD1DR10L_BIT5_MASK         32U
    #define ATD1DR10L_BIT6_MASK         64U
    #define ATD1DR10L_BIT7_MASK         128U
    
  } Overlap_STR;

