frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
        #define SCI3BDH_SBR8_MASK       1U
        #define SCI3BDH_SBR9_MASK       2U
        #define SCI3BDH_SBR10_MASK      4U
        #define SCI3BDH_SBR11_MASK      8U
        #define SCI3BDH_SBR12_MASK      16U
        #define SCI3BDH_TNP0_MASK       32U
        #define SCI3BDH_TNP1_MASK       64U
        #define SCI3BDH_IREN_MASK       128U
        #define SCI3BDH_SBR_8_MASK      31U
        #define SCI3BDH_SBR_8_BITNUM    0U
        #define SCI3BDH_TNP_MASK        96U
        #define SCI3BDH_TNP_BITNUM      5U
        
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCI3ASR1STR;
    

    /*** SCI3ACR1 - SCI 3 Alternative Control Register 1; 0x000000C1 ***/
    union {
      byte Byte;
      union { /* Several registers at the same address */
        /*** SCI3ACR1 - SCI 3 Alternative Control Register 1; Several registers at the same address ***/
        union {
          struct {
            byte BKDIE       :1;                                       /* Break Detect Interrupt Enable */
            byte BERRIE      :1;                                       /* Bit Error Interrupt Enable */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte RXEDGIE     :1;                                       /* Receive Input Active Edge Interrupt Enable */
          } Bits;
        } SCI3ACR1STR;
        #define SCI3ACR1                _SCI3BD.Overlap_STR.SCI3ACR1STR.Byte
        #define SCI3ACR1_BKDIE          _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3ACR1STR.Bits.BKDIE
        #define SCI3ACR1_BERRIE         _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3ACR1STR.Bits.BERRIE
        #define SCI3ACR1_RXEDGIE        _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3ACR1STR.Bits.RXEDGIE
        
        #define SCI3ACR1_BKDIE_MASK     1U
        #define SCI3ACR1_BERRIE_MASK    2U
        #define SCI3ACR1_RXEDGIE_MASK   128U
        
        /*** SCI3BDL - SCI 3 Baud Rate Register Low; Several registers at the same address ***/
        union {
          struct {
            byte SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
            byte SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
            byte SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
            byte SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
            byte SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
            byte SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
            byte SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
            byte SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
          } Bits;
        } SCI3BDLSTR;
        #define SCI3BDL                 _SCI3BD.Overlap_STR.SCI3ACR1STR.Byte
        #define SCI3BDL_SBR0            _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR0
        #define SCI3BDL_SBR1            _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR1
        #define SCI3BDL_SBR2            _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR2
        #define SCI3BDL_SBR3            _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR3
        #define SCI3BDL_SBR4            _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR4
        #define SCI3BDL_SBR5            _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR5
        #define SCI3BDL_SBR6            _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR6
        #define SCI3BDL_SBR7            _SCI3BD.Overlap_STR.SCI3ACR1STR.SameAddr_STR.SCI3BDLSTR.Bits.SBR7
        
        #define SCI3BDL_SBR0_MASK       1U
        #define SCI3BDL_SBR1_MASK       2U
        #define SCI3BDL_SBR2_MASK       4U
        #define SCI3BDL_SBR3_MASK       8U
        #define SCI3BDL_SBR4_MASK       16U
        #define SCI3BDL_SBR5_MASK       32U
        #define SCI3BDL_SBR6_MASK       64U
        #define SCI3BDL_SBR7_MASK       128U
        
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCI3ACR1STR;
    
  } Overlap_STR;

  struct {
    word SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
    word SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
    word SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
    word SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
    word SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
    word SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
    word SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
    word SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
    word SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
    word SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
    word SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
    word SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
    word SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
    word TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
    word TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
    word IREN        :1;                                       /* Infrared Enable Bit */
  } Bits;
  struct {
    word grpSBR  :13;
    word grpTNP  :2;
    word         :1;
  } MergedBits;
} SCI3BDSTR;
extern volatile SCI3BDSTR _SCI3BD @(REG_BASE + 0x000000C0UL);
#define SCI3BD                          _SCI3BD.Word
#define SCI3BD_SBR0                     _SCI3BD.Bits.SBR0
#define SCI3BD_SBR1                     _SCI3BD.Bits.SBR1
#define SCI3BD_SBR2                     _SCI3BD.Bits.SBR2
#define SCI3BD_SBR3                     _SCI3BD.Bits.SBR3
#define SCI3BD_SBR4                     _SCI3BD.Bits.SBR4
#define SCI3BD_SBR5                     _SCI3BD.Bits.SBR5
#define SCI3BD_SBR6                     _SCI3BD.Bits.SBR6
#define SCI3BD_SBR7                     _SCI3BD.Bits.SBR7
#define SCI3BD_SBR8                     _SCI3BD.Bits.SBR8
#define SCI3BD_SBR9                     _SCI3BD.Bits.SBR9
#define SCI3BD_SBR10                    _SCI3BD.Bits.SBR10
#define SCI3BD_SBR11                    _SCI3BD.Bits.SBR11
#define SCI3BD_SBR12                    _SCI3BD.Bits.SBR12
#define SCI3BD_TNP0                     _SCI3BD.Bits.TNP0
#define SCI3BD_TNP1                     _SCI3BD.Bits.TNP1
#define SCI3BD_IREN                     _SCI3BD.Bits.IREN
#define SCI3BD_SBR                      _SCI3BD.MergedBits.grpSBR
#define SCI3BD_TNP                      _SCI3BD.MergedBits.grpTNP

#define SCI3BD_SBR0_MASK                1U
#define SCI3BD_SBR1_MASK                2U
#define SCI3BD_SBR2_MASK                4U
#define SCI3BD_SBR3_MASK                8U
#define SCI3BD_SBR4_MASK                16U
#define SCI3BD_SBR5_MASK                32U
#define SCI3BD_SBR6_MASK                64U
#define SCI3BD_SBR7_MASK                128U
#define SCI3BD_SBR8_MASK                256U
#define SCI3BD_SBR9_MASK                512U
#define SCI3BD_SBR10_MASK               1024U
#define SCI3BD_SBR11_MASK               2048U
#define SCI3BD_SBR12_MASK               4096U
#define SCI3BD_TNP0_MASK                8192U
#define SCI3BD_TNP1_MASK                16384U
#define SCI3BD_IREN_MASK                32768U
#define SCI3BD_SBR_MASK                 8191U
#define SCI3BD_SBR_BITNUM               0U
#define SCI3BD_TNP_MASK                 24576U
#define SCI3BD_TNP_BITNUM               13U


/*** SCI3ACR2 - SCI 3 Alternative Control Register 2; 0x000000C2 ***/
typedef union {
  byte Byte;
  union { /* Several registers at the same address */
    /*** SCI3ACR2 - SCI 3 Alternative Control Register 2; Several registers at the same address ***/
    union {
      struct {
        byte BKDFE       :1;                                       /* Break Detect Feature Enable */
        byte BERRM0      :1;                                       /* Bit Error Mode 0 */
        byte BERRM1      :1;                                       /* Bit Error Mode 1 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte     :1;
        byte grpBERRM :2;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } SCI3ACR2STR;
    #define SCI3ACR2                    _SCI3ACR2.Byte
    #define SCI3ACR2_BKDFE              _SCI3ACR2.SameAddr_STR.SCI3ACR2STR.Bits.BKDFE
    #define SCI3ACR2_BERRM0             _SCI3ACR2.SameAddr_STR.SCI3ACR2STR.Bits.BERRM0
    #define SCI3ACR2_BERRM1             _SCI3ACR2.SameAddr_STR.SCI3ACR2STR.Bits.BERRM1
    #define SCI3ACR2_BERRM              _SCI3ACR2.SameAddr_STR.SCI3ACR2STR.MergedBits.grpBERRM
    
