frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCI5ASR1STR;
    

    /*** SCI5ACR1 - SCI 5 Alternative Control Register 1; 0x00000139 ***/
    union {
      byte Byte;
      union { /* Several registers at the same address */
        /*** SCI5ACR1 - SCI 5 Alternative Control Register 1; Several registers at the same address ***/
        union {
          struct {
            byte BKDIE       :1;                                       /* Break Detect Interrupt Enable */
            byte BERRIE      :1;                                       /* Bit Error Interrupt Enable */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte RXEDGIE     :1;                                       /* Receive Input Active Edge Interrupt Enable */
          } Bits;
        } SCI5ACR1STR;
        #define SCI5ACR1                _SCI5BD.Overlap_STR.SCI5ACR1STR.Byte
        #define SCI5ACR1_BKDIE          _SCI5BD.Overlap_STR.SCI5ACR1STR.SameAddr_STR.SCI5ACR1STR.Bits.BKDIE
        #define SCI5ACR1_BERRIE         _SCI5BD.Overlap_STR.SCI5ACR1STR.SameAddr_STR.SCI5ACR1STR.Bits.BERRIE
        #define SCI5ACR1_RXEDGIE        _SCI5BD.Overlap_STR.SCI5ACR1STR.SameAddr_STR.SCI5ACR1STR.Bits.RXEDGIE
        
        #define SCI5ACR1_BKDIE_MASK     1U
        #define SCI5ACR1_BERRIE_MASK    2U
        #define SCI5ACR1_RXEDGIE_MASK   128U
        
        /*** SCI5BDL - SCI 5 Baud Rate Register Low; Several registers at the same address ***/
        union {
          struct {
            byte SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
            byte SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
            byte SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
            byte SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
            byte SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
            byte SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
            byte SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
            byte SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
          } Bits;
        } SCI5BDLSTR;
        #define SCI5BDL                 _SCI5BD.Overlap_STR.SCI5ACR1STR.Byte
        #define SCI5BDL_SBR0            _SCI5BD.Overlap_STR.SCI5ACR1STR.SameAddr_STR.SCI5BDLSTR.Bits.SBR0
        #define SCI5BDL_SBR1            _SCI5BD.Overlap_STR.SCI5ACR1STR.SameAddr_STR.SCI5BDLSTR.Bits.SBR1
        #define SCI5BDL_SBR2            _SCI5BD.Overlap_STR.SCI5ACR1STR.SameAddr_STR.SCI5BDLSTR.Bits.SBR2
        #define SCI5BDL_SBR3            _SCI5BD.Overlap_STR.SCI5ACR1STR.SameAddr_STR.SCI5BDLSTR.Bits.SBR3
        #define SCI5BDL_SBR4            _SCI5BD.Overlap_STR.SCI5ACR1STR.SameAddr_STR.SCI5BDLSTR.Bits.SBR4
        #define SCI5BDL_SBR5            _SCI5BD.Overlap_STR.SCI5ACR1STR.SameAddr_STR.SCI5BDLSTR.Bits.SBR5
        #define SCI5BDL_SBR6            _SCI5BD.Overlap_STR.SCI5ACR1STR.SameAddr_STR.SCI5BDLSTR.Bits.SBR6
        #define SCI5BDL_SBR7            _SCI5BD.Overlap_STR.SCI5ACR1STR.SameAddr_STR.SCI5BDLSTR.Bits.SBR7
        
        #define SCI5BDL_SBR0_MASK       1U
        #define SCI5BDL_SBR1_MASK       2U
        #define SCI5BDL_SBR2_MASK       4U
        #define SCI5BDL_SBR3_MASK       8U
        #define SCI5BDL_SBR4_MASK       16U
        #define SCI5BDL_SBR5_MASK       32U
        #define SCI5BDL_SBR6_MASK       64U
        #define SCI5BDL_SBR7_MASK       128U
        
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCI5ACR1STR;
    
  } Overlap_STR;

  struct {
    word SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
    word SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
    word SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
    word SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
    word SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
    word SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
    word SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
    word SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
    word SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
    word SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
    word SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
    word SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
    word SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
    word TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
    word TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
    word IREN        :1;                                       /* Infrared Enable Bit */
  } Bits;
  struct {
    word grpSBR  :13;
    word grpTNP  :2;
    word         :1;
  } MergedBits;
} SCI5BDSTR;
extern volatile SCI5BDSTR _SCI5BD @(REG_BASE + 0x00000138UL);
#define SCI5BD                          _SCI5BD.Word
#define SCI5BD_SBR0                     _SCI5BD.Bits.SBR0
#define SCI5BD_SBR1                     _SCI5BD.Bits.SBR1
#define SCI5BD_SBR2                     _SCI5BD.Bits.SBR2
#define SCI5BD_SBR3                     _SCI5BD.Bits.SBR3
#define SCI5BD_SBR4                     _SCI5BD.Bits.SBR4
#define SCI5BD_SBR5                     _SCI5BD.Bits.SBR5
#define SCI5BD_SBR6                     _SCI5BD.Bits.SBR6
#define SCI5BD_SBR7                     _SCI5BD.Bits.SBR7
#define SCI5BD_SBR8                     _SCI5BD.Bits.SBR8
#define SCI5BD_SBR9                     _SCI5BD.Bits.SBR9
#define SCI5BD_SBR10                    _SCI5BD.Bits.SBR10
#define SCI5BD_SBR11                    _SCI5BD.Bits.SBR11
#define SCI5BD_SBR12                    _SCI5BD.Bits.SBR12
#define SCI5BD_TNP0                     _SCI5BD.Bits.TNP0
#define SCI5BD_TNP1                     _SCI5BD.Bits.TNP1
#define SCI5BD_IREN                     _SCI5BD.Bits.IREN
#define SCI5BD_SBR                      _SCI5BD.MergedBits.grpSBR
#define SCI5BD_TNP                      _SCI5BD.MergedBits.grpTNP

#define SCI5BD_SBR0_MASK                1U
#define SCI5BD_SBR1_MASK                2U
#define SCI5BD_SBR2_MASK                4U
#define SCI5BD_SBR3_MASK                8U
#define SCI5BD_SBR4_MASK                16U
#define SCI5BD_SBR5_MASK                32U
#define SCI5BD_SBR6_MASK                64U
#define SCI5BD_SBR7_MASK                128U
#define SCI5BD_SBR8_MASK                256U
#define SCI5BD_SBR9_MASK                512U
#define SCI5BD_SBR10_MASK               1024U
#define SCI5BD_SBR11_MASK               2048U
#define SCI5BD_SBR12_MASK               4096U
#define SCI5BD_TNP0_MASK                8192U
#define SCI5BD_TNP1_MASK                16384U
#define SCI5BD_IREN_MASK                32768U
#define SCI5BD_SBR_MASK                 8191U
#define SCI5BD_SBR_BITNUM               0U
#define SCI5BD_TNP_MASK                 24576U
#define SCI5BD_TNP_BITNUM               13U


/*** SCI5ACR2 - SCI 5 Alternative Control Register 2; 0x0000013A ***/
typedef union {
  byte Byte;
  union { /* Several registers at the same address */
    /*** SCI5ACR2 - SCI 5 Alternative Control Register 2; Several registers at the same address ***/
    union {
      struct {
        byte BKDFE       :1;                                       /* Break Detect Feature Enable */
        byte BERRM0      :1;                                       /* Bit Error Mode 0 */
        byte BERRM1      :1;                                       /* Bit Error Mode 1 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte     :1;
        byte grpBERRM :2;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } SCI5ACR2STR;
    #define SCI5ACR2                    _SCI5ACR2.Byte
    #define SCI5ACR2_BKDFE              _SCI5ACR2.SameAddr_STR.SCI5ACR2STR.Bits.BKDFE
    #define SCI5ACR2_BERRM0             _SCI5ACR2.SameAddr_STR.SCI5ACR2STR.Bits.BERRM0
    #define SCI5ACR2_BERRM1             _SCI5ACR2.SameAddr_STR.SCI5ACR2STR.Bits.BERRM1
    #define SCI5ACR2_BERRM              _SCI5ACR2.SameAddr_STR.SCI5ACR2STR.MergedBits.grpBERRM
    
    #define SCI5ACR2_BKDFE_MASK         1U
    #define SCI5ACR2_BERRM0_MASK        2U
    #define SCI5ACR2_BERRM1_MASK        4U
    #define SCI5ACR2_BERRM_MASK         6U
    #define SCI5ACR2_BERRM_BITNUM       1U
    
    /*** SCI5CR1 - SCI 5 Control Register 1; Several registers at the same address ***/
    union {
      struct {
        byte PT          :1;                                       /* Parity Type Bit */
        byte PE          :1;                                       /* Parity Enable Bit */
        byte ILT         :1;                                       /* Idle Line Type Bit */
        byte WAKE        :1;                                       /* Wakeup Condition Bit */
        byte M           :1;                                       /* Data Format Mode Bit */
        byte RSRC        :1;                                       /* Receiver Source Bit */
        byte SCISWAI     :1;                                       /* SCI Stop in Wait Mode Bit */
        byte LOOPS       :1;                                       /* Loop Select Bit */
      } Bits;
    } SCI5CR1STR;
    #define SCI5CR1                     _SCI5ACR2.Byte
    #define SCI5CR1_PT                  _SCI5ACR2.SameAddr_STR.SCI5CR1STR.Bits.PT
    #define SCI5CR1_PE                  _SCI5ACR2.SameAddr_STR.SCI5CR1STR.Bits.PE
    #define SCI5CR1_ILT                 _SCI5ACR2.SameAddr_STR.SCI5CR1STR.Bits.ILT
    #define SCI5CR1_WAKE                _SCI5ACR2.SameAddr_STR.SCI5CR1STR.Bits.WAKE
    #define SCI5CR1_M                   _SCI5ACR2.SameAddr_STR.SCI5CR1STR.Bits.M
    #define SCI5CR1_RSRC                _SCI5ACR2.SameAddr_STR.SCI5CR1STR.Bits.RSRC
    #define SCI5CR1_SCISWAI             _SCI5ACR2.SameAddr_STR.SCI5CR1STR.Bits.SCISWAI
    #define SCI5CR1_LOOPS               _SCI5ACR2.SameAddr_STR.SCI5CR1STR.Bits.LOOPS
    
    #define SCI5CR1_PT_MASK             1U
    #define SCI5CR1_PE_MASK             2U
    #define SCI5CR1_ILT_MASK            4U
    #define SCI5CR1_WAKE_MASK           8U
    #define SCI5CR1_M_MASK              16U
    #define SCI5CR1_RSRC_MASK           32U
    #define SCI5CR1_SCISWAI_MASK        64U
    #define SCI5CR1_LOOPS_MASK          128U
    
