frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
  } SameAddr_STR; /*Several registers at the same address */

} SCI5ACR2STR;
extern volatile SCI5ACR2STR _SCI5ACR2 @(REG_BASE + 0x0000013AUL);


/*** SCI5CR2 - SCI 5 Control Register 2; 0x0000013B ***/
typedef union {
  byte Byte;
  struct {
    byte SBK         :1;                                       /* Send Break Bit */
    byte RWU         :1;                                       /* Receiver Wakeup Bit */
    byte RE          :1;                                       /* Receiver Enable Bit */
    byte TE          :1;                                       /* Transmitter Enable Bit */
    byte ILIE        :1;                                       /* Idle Line Interrupt Enable Bit */
    byte RIE         :1;                                       /* Receiver Full Interrupt Enable Bit */
    byte TCIE        :1;                                       /* Transmission Complete Interrupt Enable Bit */
    byte TIE         :1;                                       /* Transmitter Interrupt Enable Bit */
  } Bits;
} SCI5CR2STR;
extern volatile SCI5CR2STR _SCI5CR2 @(REG_BASE + 0x0000013BUL);
#define SCI5CR2                         _SCI5CR2.Byte
#define SCI5CR2_SBK                     _SCI5CR2.Bits.SBK
#define SCI5CR2_RWU                     _SCI5CR2.Bits.RWU
#define SCI5CR2_RE                      _SCI5CR2.Bits.RE
#define SCI5CR2_TE                      _SCI5CR2.Bits.TE
#define SCI5CR2_ILIE                    _SCI5CR2.Bits.ILIE
#define SCI5CR2_RIE                     _SCI5CR2.Bits.RIE
#define SCI5CR2_TCIE                    _SCI5CR2.Bits.TCIE
#define SCI5CR2_TIE                     _SCI5CR2.Bits.TIE

#define SCI5CR2_SBK_MASK                1U
#define SCI5CR2_RWU_MASK                2U
#define SCI5CR2_RE_MASK                 4U
#define SCI5CR2_TE_MASK                 8U
#define SCI5CR2_ILIE_MASK               16U
#define SCI5CR2_RIE_MASK                32U
#define SCI5CR2_TCIE_MASK               64U
#define SCI5CR2_TIE_MASK                128U


/*** SCI5SR1 - SCI 5 Status Register 1; 0x0000013C ***/
typedef union {
  byte Byte;
  struct {
    byte PF          :1;                                       /* Parity Error Flag */
    byte FE          :1;                                       /* Framing Error Flag */
    byte NF          :1;                                       /* Noise Flag */
    byte OR          :1;                                       /* Overrun Flag */
    byte IDLE        :1;                                       /* Idle Line Flag */
    byte RDRF_bit    :1;                                       /* Receive Data Register Full Flag */ /*Warning: bit name is duplicated with register name*/
    byte TC          :1;                                       /* Transmit Complete Flag */
    byte TDRE        :1;                                       /* Transmit Data Register Empty Flag */
  } Bits;
} SCI5SR1STR;
extern volatile SCI5SR1STR _SCI5SR1 @(REG_BASE + 0x0000013CUL);
#define SCI5SR1                         _SCI5SR1.Byte
#define SCI5SR1_PF                      _SCI5SR1.Bits.PF
#define SCI5SR1_FE                      _SCI5SR1.Bits.FE
#define SCI5SR1_NF                      _SCI5SR1.Bits.NF
#define SCI5SR1_OR                      _SCI5SR1.Bits.OR
#define SCI5SR1_IDLE                    _SCI5SR1.Bits.IDLE
#define SCI5SR1_RDRF                    _SCI5SR1.Bits.RDRF_bit
#define SCI5SR1_TC                      _SCI5SR1.Bits.TC
#define SCI5SR1_TDRE                    _SCI5SR1.Bits.TDRE

#define SCI5SR1_PF_MASK                 1U
#define SCI5SR1_FE_MASK                 2U
#define SCI5SR1_NF_MASK                 4U
#define SCI5SR1_OR_MASK                 8U
#define SCI5SR1_IDLE_MASK               16U
#define SCI5SR1_RDRF_MASK               32U
#define SCI5SR1_TC_MASK                 64U
#define SCI5SR1_TDRE_MASK               128U


/*** SCI5SR2 - SCI 5 Status Register 2; 0x0000013D ***/
typedef union {
  byte Byte;
  struct {
    byte RAF         :1;                                       /* Receiver Active Flag */
    byte TXDIR       :1;                                       /* Transmitter pin data direction in Single-Wire mode */
    byte BRK13       :1;                                       /* Break Transmit character length */
    byte RXPOL       :1;                                       /* Receive Polarity */
    byte TXPOL       :1;                                       /* Transmit Polarity */
    byte             :1; 
    byte             :1; 
    byte AMAP        :1;                                       /* Alternative Map */
  } Bits;
} SCI5SR2STR;
extern volatile SCI5SR2STR _SCI5SR2 @(REG_BASE + 0x0000013DUL);
#define SCI5SR2                         _SCI5SR2.Byte
#define SCI5SR2_RAF                     _SCI5SR2.Bits.RAF
#define SCI5SR2_TXDIR                   _SCI5SR2.Bits.TXDIR
#define SCI5SR2_BRK13                   _SCI5SR2.Bits.BRK13
#define SCI5SR2_RXPOL                   _SCI5SR2.Bits.RXPOL
#define SCI5SR2_TXPOL                   _SCI5SR2.Bits.TXPOL
#define SCI5SR2_AMAP                    _SCI5SR2.Bits.AMAP

#define SCI5SR2_RAF_MASK                1U
#define SCI5SR2_TXDIR_MASK              2U
#define SCI5SR2_BRK13_MASK              4U
#define SCI5SR2_RXPOL_MASK              8U
#define SCI5SR2_TXPOL_MASK              16U
#define SCI5SR2_AMAP_MASK               128U


/*** SCI5DRH - SCI 5 Data Register High; 0x0000013E ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte T8          :1;                                       /* Transmit Bit 8 */
    byte R8          :1;                                       /* Received Bit 8 */
  } Bits;
} SCI5DRHSTR;
extern volatile SCI5DRHSTR _SCI5DRH @(REG_BASE + 0x0000013EUL);
#define SCI5DRH                         _SCI5DRH.Byte
#define SCI5DRH_T8                      _SCI5DRH.Bits.T8
#define SCI5DRH_R8                      _SCI5DRH.Bits.R8

#define SCI5DRH_T8_MASK                 64U
#define SCI5DRH_R8_MASK                 128U


/*** SCI5DRL - SCI 5 Data Register Low; 0x0000013F ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Received bit 0 or Transmit bit 0 */
    byte R1_T1       :1;                                       /* Received bit 1 or Transmit bit 1 */
    byte R2_T2       :1;                                       /* Received bit 2 or Transmit bit 2 */
    byte R3_T3       :1;                                       /* Received bit 3 or Transmit bit 3 */
    byte R4_T4       :1;                                       /* Received bit 4 or Transmit bit 4 */
    byte R5_T5       :1;                                       /* Received bit 5 or Transmit bit 5 */
    byte R6_T6       :1;                                       /* Received bit 6 or Transmit bit 6 */
    byte R7_T7       :1;                                       /* Received bit 7 or Transmit bit 7 */
  } Bits;
} SCI5DRLSTR;
extern volatile SCI5DRLSTR _SCI5DRL @(REG_BASE + 0x0000013FUL);
#define SCI5DRL                         _SCI5DRL.Byte
#define SCI5DRL_R0_T0                   _SCI5DRL.Bits.R0_T0
#define SCI5DRL_R1_T1                   _SCI5DRL.Bits.R1_T1
#define SCI5DRL_R2_T2                   _SCI5DRL.Bits.R2_T2
#define SCI5DRL_R3_T3                   _SCI5DRL.Bits.R3_T3
#define SCI5DRL_R4_T4                   _SCI5DRL.Bits.R4_T4
#define SCI5DRL_R5_T5                   _SCI5DRL.Bits.R5_T5
#define SCI5DRL_R6_T6                   _SCI5DRL.Bits.R6_T6
#define SCI5DRL_R7_T7                   _SCI5DRL.Bits.R7_T7

#define SCI5DRL_R0_T0_MASK              1U
#define SCI5DRL_R1_T1_MASK              2U
#define SCI5DRL_R2_T2_MASK              4U
#define SCI5DRL_R3_T3_MASK              8U
#define SCI5DRL_R4_T4_MASK              16U
#define SCI5DRL_R5_T5_MASK              32U
#define SCI5DRL_R6_T6_MASK              64U
#define SCI5DRL_R7_T7_MASK              128U


