frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
#define CAN2BTR0_BRP0_MASK              1U
#define CAN2BTR0_BRP1_MASK              2U
#define CAN2BTR0_BRP2_MASK              4U
#define CAN2BTR0_BRP3_MASK              8U
#define CAN2BTR0_BRP4_MASK              16U
#define CAN2BTR0_BRP5_MASK              32U
#define CAN2BTR0_SJW0_MASK              64U
#define CAN2BTR0_SJW1_MASK              128U
#define CAN2BTR0_BRP_MASK               63U
#define CAN2BTR0_BRP_BITNUM             0U
#define CAN2BTR0_SJW_MASK               192U
#define CAN2BTR0_SJW_BITNUM             6U


/*** CAN2BTR1 - MSCAN2 Bus Timing Register 1; 0x000001C3 ***/
typedef union {
  byte Byte;
  struct {
    byte TSEG10      :1;                                       /* Time Segment 10 */
    byte TSEG11      :1;                                       /* Time Segment 11 */
    byte TSEG12      :1;                                       /* Time Segment 12 */
    byte TSEG13      :1;                                       /* Time Segment 13 */
    byte TSEG20      :1;                                       /* Time Segment 20 */
    byte TSEG21      :1;                                       /* Time Segment 21 */
    byte TSEG22      :1;                                       /* Time Segment 22 */
    byte SAMP        :1;                                       /* Sampling */
  } Bits;
  struct {
    byte grpTSEG_10 :4;
    byte grpTSEG_20 :3;
    byte         :1;
  } MergedBits;
} CAN2BTR1STR;
extern volatile CAN2BTR1STR _CAN2BTR1 @(REG_BASE + 0x000001C3UL);
#define CAN2BTR1                        _CAN2BTR1.Byte
#define CAN2BTR1_TSEG10                 _CAN2BTR1.Bits.TSEG10
#define CAN2BTR1_TSEG11                 _CAN2BTR1.Bits.TSEG11
#define CAN2BTR1_TSEG12                 _CAN2BTR1.Bits.TSEG12
#define CAN2BTR1_TSEG13                 _CAN2BTR1.Bits.TSEG13
#define CAN2BTR1_TSEG20                 _CAN2BTR1.Bits.TSEG20
#define CAN2BTR1_TSEG21                 _CAN2BTR1.Bits.TSEG21
#define CAN2BTR1_TSEG22                 _CAN2BTR1.Bits.TSEG22
#define CAN2BTR1_SAMP                   _CAN2BTR1.Bits.SAMP
#define CAN2BTR1_TSEG_10                _CAN2BTR1.MergedBits.grpTSEG_10
#define CAN2BTR1_TSEG_20                _CAN2BTR1.MergedBits.grpTSEG_20
#define CAN2BTR1_TSEG                   CAN2BTR1_TSEG_10

#define CAN2BTR1_TSEG10_MASK            1U
#define CAN2BTR1_TSEG11_MASK            2U
#define CAN2BTR1_TSEG12_MASK            4U
#define CAN2BTR1_TSEG13_MASK            8U
#define CAN2BTR1_TSEG20_MASK            16U
#define CAN2BTR1_TSEG21_MASK            32U
#define CAN2BTR1_TSEG22_MASK            64U
#define CAN2BTR1_SAMP_MASK              128U
#define CAN2BTR1_TSEG_10_MASK           15U
#define CAN2BTR1_TSEG_10_BITNUM         0U
#define CAN2BTR1_TSEG_20_MASK           112U
#define CAN2BTR1_TSEG_20_BITNUM         4U


/*** CAN2RFLG - MSCAN2 Receiver Flag Register; 0x000001C4 ***/
typedef union {
  byte Byte;
  struct {
    byte RXF         :1;                                       /* Receive Buffer Full */
    byte OVRIF       :1;                                       /* Overrun Interrupt Flag */
    byte TSTAT0      :1;                                       /* Transmitter Status Bit 0 */
    byte TSTAT1      :1;                                       /* Transmitter Status Bit 1 */
    byte RSTAT0      :1;                                       /* Receiver Status Bit 0 */
    byte RSTAT1      :1;                                       /* Receiver Status Bit 1 */
    byte CSCIF       :1;                                       /* CAN Status Change Interrupt Flag */
    byte WUPIF       :1;                                       /* Wake-up Interrupt Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTAT :2;
    byte grpRSTAT :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2RFLGSTR;
extern volatile CAN2RFLGSTR _CAN2RFLG @(REG_BASE + 0x000001C4UL);
#define CAN2RFLG                        _CAN2RFLG.Byte
#define CAN2RFLG_RXF                    _CAN2RFLG.Bits.RXF
#define CAN2RFLG_OVRIF                  _CAN2RFLG.Bits.OVRIF
#define CAN2RFLG_TSTAT0                 _CAN2RFLG.Bits.TSTAT0
#define CAN2RFLG_TSTAT1                 _CAN2RFLG.Bits.TSTAT1
#define CAN2RFLG_RSTAT0                 _CAN2RFLG.Bits.RSTAT0
#define CAN2RFLG_RSTAT1                 _CAN2RFLG.Bits.RSTAT1
#define CAN2RFLG_CSCIF                  _CAN2RFLG.Bits.CSCIF
#define CAN2RFLG_WUPIF                  _CAN2RFLG.Bits.WUPIF
#define CAN2RFLG_TSTAT                  _CAN2RFLG.MergedBits.grpTSTAT
#define CAN2RFLG_RSTAT                  _CAN2RFLG.MergedBits.grpRSTAT

#define CAN2RFLG_RXF_MASK               1U
#define CAN2RFLG_OVRIF_MASK             2U
#define CAN2RFLG_TSTAT0_MASK            4U
#define CAN2RFLG_TSTAT1_MASK            8U
#define CAN2RFLG_RSTAT0_MASK            16U
#define CAN2RFLG_RSTAT1_MASK            32U
#define CAN2RFLG_CSCIF_MASK             64U
#define CAN2RFLG_WUPIF_MASK             128U
#define CAN2RFLG_TSTAT_MASK             12U
#define CAN2RFLG_TSTAT_BITNUM           2U
#define CAN2RFLG_RSTAT_MASK             48U
#define CAN2RFLG_RSTAT_BITNUM           4U


/*** CAN2RIER - MSCAN2 Receiver Interrupt Enable Register; 0x000001C5 ***/
typedef union {
  byte Byte;
  struct {
    byte RXFIE       :1;                                       /* Receiver Full Interrupt Enable */
    byte OVRIE       :1;                                       /* Overrun Interrupt Enable */
    byte TSTATE0     :1;                                       /* Transmitter Status Change Enable 0 */
    byte TSTATE1     :1;                                       /* Transmitter Status Change Enable 1 */
    byte RSTATE0     :1;                                       /* Receiver Status Change Enable 0 */
    byte RSTATE1     :1;                                       /* Receiver Status Change Enable 1 */
    byte CSCIE       :1;                                       /* CAN Status Change Interrupt Enable */
    byte WUPIE       :1;                                       /* Wake-up Interrupt Enable */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTATE :2;
    byte grpRSTATE :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2RIERSTR;
extern volatile CAN2RIERSTR _CAN2RIER @(REG_BASE + 0x000001C5UL);
#define CAN2RIER                        _CAN2RIER.Byte
#define CAN2RIER_RXFIE                  _CAN2RIER.Bits.RXFIE
#define CAN2RIER_OVRIE                  _CAN2RIER.Bits.OVRIE
#define CAN2RIER_TSTATE0                _CAN2RIER.Bits.TSTATE0
#define CAN2RIER_TSTATE1                _CAN2RIER.Bits.TSTATE1
#define CAN2RIER_RSTATE0                _CAN2RIER.Bits.RSTATE0
#define CAN2RIER_RSTATE1                _CAN2RIER.Bits.RSTATE1
#define CAN2RIER_CSCIE                  _CAN2RIER.Bits.CSCIE
#define CAN2RIER_WUPIE                  _CAN2RIER.Bits.WUPIE
#define CAN2RIER_TSTATE                 _CAN2RIER.MergedBits.grpTSTATE
#define CAN2RIER_RSTATE                 _CAN2RIER.MergedBits.grpRSTATE

#define CAN2RIER_RXFIE_MASK             1U
#define CAN2RIER_OVRIE_MASK             2U
#define CAN2RIER_TSTATE0_MASK           4U
#define CAN2RIER_TSTATE1_MASK           8U
#define CAN2RIER_RSTATE0_MASK           16U
#define CAN2RIER_RSTATE1_MASK           32U
#define CAN2RIER_CSCIE_MASK             64U
#define CAN2RIER_WUPIE_MASK             128U
#define CAN2RIER_TSTATE_MASK            12U
#define CAN2RIER_TSTATE_BITNUM          2U
#define CAN2RIER_RSTATE_MASK            48U
#define CAN2RIER_RSTATE_BITNUM          4U


/*** CAN2TFLG - MSCAN2 Transmitter Flag Register; 0x000001C6 ***/
typedef union {
  byte Byte;
  struct {
    byte TXE0        :1;                                       /* Transmitter Buffer Empty 0 */
    byte TXE1        :1;                                       /* Transmitter Buffer Empty 1 */
    byte TXE2        :1;                                       /* Transmitter Buffer Empty 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXE  :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TFLGSTR;
extern volatile CAN2TFLGSTR _CAN2TFLG @(REG_BASE + 0x000001C6UL);
#define CAN2TFLG                        _CAN2TFLG.Byte
#define CAN2TFLG_TXE0                   _CAN2TFLG.Bits.TXE0
#define CAN2TFLG_TXE1                   _CAN2TFLG.Bits.TXE1
#define CAN2TFLG_TXE2                   _CAN2TFLG.Bits.TXE2
#define CAN2TFLG_TXE                    _CAN2TFLG.MergedBits.grpTXE

#define CAN2TFLG_TXE0_MASK              1U
#define CAN2TFLG_TXE1_MASK              2U
#define CAN2TFLG_TXE2_MASK              4U
#define CAN2TFLG_TXE_MASK               7U
#define CAN2TFLG_TXE_BITNUM             0U


/*** CAN2TIER - MSCAN2 Transmitter Interrupt Enable Register; 0x000001C7 ***/
typedef union {
  byte Byte;
  struct {
    byte TXEIE0      :1;                                       /* Transmitter Empty Interrupt Enable 0 */
    byte TXEIE1      :1;                                       /* Transmitter Empty Interrupt Enable 1 */
    byte TXEIE2      :1;                                       /* Transmitter Empty Interrupt Enable 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXEIE :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TIERSTR;
