frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
extern volatile CAN2RXERRSTR _CAN2RXERR @(REG_BASE + 0x000001CEUL);
#define CAN2RXERR                       _CAN2RXERR.Byte
#define CAN2RXERR_RXERR0                _CAN2RXERR.Bits.RXERR0
#define CAN2RXERR_RXERR1                _CAN2RXERR.Bits.RXERR1
#define CAN2RXERR_RXERR2                _CAN2RXERR.Bits.RXERR2
#define CAN2RXERR_RXERR3                _CAN2RXERR.Bits.RXERR3
#define CAN2RXERR_RXERR4                _CAN2RXERR.Bits.RXERR4
#define CAN2RXERR_RXERR5                _CAN2RXERR.Bits.RXERR5
#define CAN2RXERR_RXERR6                _CAN2RXERR.Bits.RXERR6
#define CAN2RXERR_RXERR7                _CAN2RXERR.Bits.RXERR7

#define CAN2RXERR_RXERR0_MASK           1U
#define CAN2RXERR_RXERR1_MASK           2U
#define CAN2RXERR_RXERR2_MASK           4U
#define CAN2RXERR_RXERR3_MASK           8U
#define CAN2RXERR_RXERR4_MASK           16U
#define CAN2RXERR_RXERR5_MASK           32U
#define CAN2RXERR_RXERR6_MASK           64U
#define CAN2RXERR_RXERR7_MASK           128U


/*** CAN2TXERR - MSCAN2 Transmit Error Counter Register; 0x000001CF ***/
typedef union {
  byte Byte;
  struct {
    byte TXERR0      :1;                                       /* Bit 0 */
    byte TXERR1      :1;                                       /* Bit 1 */
    byte TXERR2      :1;                                       /* Bit 2 */
    byte TXERR3      :1;                                       /* Bit 3 */
    byte TXERR4      :1;                                       /* Bit 4 */
    byte TXERR5      :1;                                       /* Bit 5 */
    byte TXERR6      :1;                                       /* Bit 6 */
    byte TXERR7      :1;                                       /* Bit 7 */
  } Bits;
} CAN2TXERRSTR;
extern volatile CAN2TXERRSTR _CAN2TXERR @(REG_BASE + 0x000001CFUL);
#define CAN2TXERR                       _CAN2TXERR.Byte
#define CAN2TXERR_TXERR0                _CAN2TXERR.Bits.TXERR0
#define CAN2TXERR_TXERR1                _CAN2TXERR.Bits.TXERR1
#define CAN2TXERR_TXERR2                _CAN2TXERR.Bits.TXERR2
#define CAN2TXERR_TXERR3                _CAN2TXERR.Bits.TXERR3
#define CAN2TXERR_TXERR4                _CAN2TXERR.Bits.TXERR4
#define CAN2TXERR_TXERR5                _CAN2TXERR.Bits.TXERR5
#define CAN2TXERR_TXERR6                _CAN2TXERR.Bits.TXERR6
#define CAN2TXERR_TXERR7                _CAN2TXERR.Bits.TXERR7

#define CAN2TXERR_TXERR0_MASK           1U
#define CAN2TXERR_TXERR1_MASK           2U
#define CAN2TXERR_TXERR2_MASK           4U
#define CAN2TXERR_TXERR3_MASK           8U
#define CAN2TXERR_TXERR4_MASK           16U
#define CAN2TXERR_TXERR5_MASK           32U
#define CAN2TXERR_TXERR6_MASK           64U
#define CAN2TXERR_TXERR7_MASK           128U


/*** CAN2IDAR0 - MSCAN2 Identifier Acceptance Register 0; 0x000001D0 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN2IDAR0STR;
extern volatile CAN2IDAR0STR _CAN2IDAR0 @(REG_BASE + 0x000001D0UL);
#define CAN2IDAR0                       _CAN2IDAR0.Byte
#define CAN2IDAR0_AC0                   _CAN2IDAR0.Bits.AC0
#define CAN2IDAR0_AC1                   _CAN2IDAR0.Bits.AC1
#define CAN2IDAR0_AC2                   _CAN2IDAR0.Bits.AC2
#define CAN2IDAR0_AC3                   _CAN2IDAR0.Bits.AC3
#define CAN2IDAR0_AC4                   _CAN2IDAR0.Bits.AC4
#define CAN2IDAR0_AC5                   _CAN2IDAR0.Bits.AC5
#define CAN2IDAR0_AC6                   _CAN2IDAR0.Bits.AC6
#define CAN2IDAR0_AC7                   _CAN2IDAR0.Bits.AC7
/* CAN2IDAR_ARR: Access 4 CAN2IDARx registers in an array */
#define CAN2IDAR_ARR                    ((volatile byte *) &CAN2IDAR0)

#define CAN2IDAR0_AC0_MASK              1U
#define CAN2IDAR0_AC1_MASK              2U
#define CAN2IDAR0_AC2_MASK              4U
#define CAN2IDAR0_AC3_MASK              8U
#define CAN2IDAR0_AC4_MASK              16U
#define CAN2IDAR0_AC5_MASK              32U
#define CAN2IDAR0_AC6_MASK              64U
#define CAN2IDAR0_AC7_MASK              128U


/*** CAN2IDAR1 - MSCAN2 Identifier Acceptance Register 1; 0x000001D1 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN2IDAR1STR;
extern volatile CAN2IDAR1STR _CAN2IDAR1 @(REG_BASE + 0x000001D1UL);
#define CAN2IDAR1                       _CAN2IDAR1.Byte
#define CAN2IDAR1_AC0                   _CAN2IDAR1.Bits.AC0
#define CAN2IDAR1_AC1                   _CAN2IDAR1.Bits.AC1
#define CAN2IDAR1_AC2                   _CAN2IDAR1.Bits.AC2
#define CAN2IDAR1_AC3                   _CAN2IDAR1.Bits.AC3
#define CAN2IDAR1_AC4                   _CAN2IDAR1.Bits.AC4
#define CAN2IDAR1_AC5                   _CAN2IDAR1.Bits.AC5
#define CAN2IDAR1_AC6                   _CAN2IDAR1.Bits.AC6
#define CAN2IDAR1_AC7                   _CAN2IDAR1.Bits.AC7

#define CAN2IDAR1_AC0_MASK              1U
#define CAN2IDAR1_AC1_MASK              2U
#define CAN2IDAR1_AC2_MASK              4U
#define CAN2IDAR1_AC3_MASK              8U
#define CAN2IDAR1_AC4_MASK              16U
#define CAN2IDAR1_AC5_MASK              32U
#define CAN2IDAR1_AC6_MASK              64U
#define CAN2IDAR1_AC7_MASK              128U


/*** CAN2IDAR2 - MSCAN2 Identifier Acceptance Register 2; 0x000001D2 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN2IDAR2STR;
