frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
#define CAN2RXDSR3_DB0_MASK             1U
#define CAN2RXDSR3_DB1_MASK             2U
#define CAN2RXDSR3_DB2_MASK             4U
#define CAN2RXDSR3_DB3_MASK             8U
#define CAN2RXDSR3_DB4_MASK             16U
#define CAN2RXDSR3_DB5_MASK             32U
#define CAN2RXDSR3_DB6_MASK             64U
#define CAN2RXDSR3_DB7_MASK             128U


/*** CAN2RXDSR4 - MSCAN2 Receive Data Segment Register 4; 0x000001E8 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR4STR;
extern volatile CAN2RXDSR4STR _CAN2RXDSR4 @(REG_BASE + 0x000001E8UL);
#define CAN2RXDSR4                      _CAN2RXDSR4.Byte
#define CAN2RXDSR4_DB0                  _CAN2RXDSR4.Bits.DB0
#define CAN2RXDSR4_DB1                  _CAN2RXDSR4.Bits.DB1
#define CAN2RXDSR4_DB2                  _CAN2RXDSR4.Bits.DB2
#define CAN2RXDSR4_DB3                  _CAN2RXDSR4.Bits.DB3
#define CAN2RXDSR4_DB4                  _CAN2RXDSR4.Bits.DB4
#define CAN2RXDSR4_DB5                  _CAN2RXDSR4.Bits.DB5
#define CAN2RXDSR4_DB6                  _CAN2RXDSR4.Bits.DB6
#define CAN2RXDSR4_DB7                  _CAN2RXDSR4.Bits.DB7

#define CAN2RXDSR4_DB0_MASK             1U
#define CAN2RXDSR4_DB1_MASK             2U
#define CAN2RXDSR4_DB2_MASK             4U
#define CAN2RXDSR4_DB3_MASK             8U
#define CAN2RXDSR4_DB4_MASK             16U
#define CAN2RXDSR4_DB5_MASK             32U
#define CAN2RXDSR4_DB6_MASK             64U
#define CAN2RXDSR4_DB7_MASK             128U


/*** CAN2RXDSR5 - MSCAN2 Receive Data Segment Register 5; 0x000001E9 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR5STR;
extern volatile CAN2RXDSR5STR _CAN2RXDSR5 @(REG_BASE + 0x000001E9UL);
#define CAN2RXDSR5                      _CAN2RXDSR5.Byte
#define CAN2RXDSR5_DB0                  _CAN2RXDSR5.Bits.DB0
#define CAN2RXDSR5_DB1                  _CAN2RXDSR5.Bits.DB1
#define CAN2RXDSR5_DB2                  _CAN2RXDSR5.Bits.DB2
#define CAN2RXDSR5_DB3                  _CAN2RXDSR5.Bits.DB3
#define CAN2RXDSR5_DB4                  _CAN2RXDSR5.Bits.DB4
#define CAN2RXDSR5_DB5                  _CAN2RXDSR5.Bits.DB5
#define CAN2RXDSR5_DB6                  _CAN2RXDSR5.Bits.DB6
#define CAN2RXDSR5_DB7                  _CAN2RXDSR5.Bits.DB7

#define CAN2RXDSR5_DB0_MASK             1U
#define CAN2RXDSR5_DB1_MASK             2U
#define CAN2RXDSR5_DB2_MASK             4U
#define CAN2RXDSR5_DB3_MASK             8U
#define CAN2RXDSR5_DB4_MASK             16U
#define CAN2RXDSR5_DB5_MASK             32U
#define CAN2RXDSR5_DB6_MASK             64U
#define CAN2RXDSR5_DB7_MASK             128U


/*** CAN2RXDSR6 - MSCAN2 Receive Data Segment Register 6; 0x000001EA ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR6STR;
extern volatile CAN2RXDSR6STR _CAN2RXDSR6 @(REG_BASE + 0x000001EAUL);
#define CAN2RXDSR6                      _CAN2RXDSR6.Byte
#define CAN2RXDSR6_DB0                  _CAN2RXDSR6.Bits.DB0
#define CAN2RXDSR6_DB1                  _CAN2RXDSR6.Bits.DB1
#define CAN2RXDSR6_DB2                  _CAN2RXDSR6.Bits.DB2
#define CAN2RXDSR6_DB3                  _CAN2RXDSR6.Bits.DB3
#define CAN2RXDSR6_DB4                  _CAN2RXDSR6.Bits.DB4
#define CAN2RXDSR6_DB5                  _CAN2RXDSR6.Bits.DB5
#define CAN2RXDSR6_DB6                  _CAN2RXDSR6.Bits.DB6
#define CAN2RXDSR6_DB7                  _CAN2RXDSR6.Bits.DB7

#define CAN2RXDSR6_DB0_MASK             1U
#define CAN2RXDSR6_DB1_MASK             2U
#define CAN2RXDSR6_DB2_MASK             4U
#define CAN2RXDSR6_DB3_MASK             8U
#define CAN2RXDSR6_DB4_MASK             16U
#define CAN2RXDSR6_DB5_MASK             32U
#define CAN2RXDSR6_DB6_MASK             64U
#define CAN2RXDSR6_DB7_MASK             128U


/*** CAN2RXDSR7 - MSCAN2 Receive Data Segment Register 7; 0x000001EB ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR7STR;
extern volatile CAN2RXDSR7STR _CAN2RXDSR7 @(REG_BASE + 0x000001EBUL);
#define CAN2RXDSR7                      _CAN2RXDSR7.Byte
#define CAN2RXDSR7_DB0                  _CAN2RXDSR7.Bits.DB0
#define CAN2RXDSR7_DB1                  _CAN2RXDSR7.Bits.DB1
#define CAN2RXDSR7_DB2                  _CAN2RXDSR7.Bits.DB2
#define CAN2RXDSR7_DB3                  _CAN2RXDSR7.Bits.DB3
#define CAN2RXDSR7_DB4                  _CAN2RXDSR7.Bits.DB4
#define CAN2RXDSR7_DB5                  _CAN2RXDSR7.Bits.DB5
#define CAN2RXDSR7_DB6                  _CAN2RXDSR7.Bits.DB6
#define CAN2RXDSR7_DB7                  _CAN2RXDSR7.Bits.DB7

#define CAN2RXDSR7_DB0_MASK             1U
#define CAN2RXDSR7_DB1_MASK             2U
#define CAN2RXDSR7_DB2_MASK             4U
#define CAN2RXDSR7_DB3_MASK             8U
#define CAN2RXDSR7_DB4_MASK             16U
#define CAN2RXDSR7_DB5_MASK             32U
#define CAN2RXDSR7_DB6_MASK             64U
#define CAN2RXDSR7_DB7_MASK             128U


/*** CAN2RXDLR - MSCAN2 Receive Data Length Register; 0x000001EC ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2RXDLRSTR;
extern volatile CAN2RXDLRSTR _CAN2RXDLR @(REG_BASE + 0x000001ECUL);
#define CAN2RXDLR                       _CAN2RXDLR.Byte
#define CAN2RXDLR_DLC0                  _CAN2RXDLR.Bits.DLC0
#define CAN2RXDLR_DLC1                  _CAN2RXDLR.Bits.DLC1
#define CAN2RXDLR_DLC2                  _CAN2RXDLR.Bits.DLC2
#define CAN2RXDLR_DLC3                  _CAN2RXDLR.Bits.DLC3
#define CAN2RXDLR_DLC                   _CAN2RXDLR.MergedBits.grpDLC

#define CAN2RXDLR_DLC0_MASK             1U
#define CAN2RXDLR_DLC1_MASK             2U
#define CAN2RXDLR_DLC2_MASK             4U
#define CAN2RXDLR_DLC3_MASK             8U
#define CAN2RXDLR_DLC_MASK              15U
#define CAN2RXDLR_DLC_BITNUM            0U


