frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
/*** CAN2RXTSR - MSCAN2 Receive Time Stamp Register; 0x000001EE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN2RXTSRH - MSCAN2 Receive Time Stamp Register High; 0x000001EE ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
    } CAN2RXTSRHSTR;
    #define CAN2RXTSRH                  _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Byte
    #define CAN2RXTSRH_TSR8             _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR8
    #define CAN2RXTSRH_TSR9             _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR9
    #define CAN2RXTSRH_TSR10            _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR10
    #define CAN2RXTSRH_TSR11            _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR11
    #define CAN2RXTSRH_TSR12            _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR12
    #define CAN2RXTSRH_TSR13            _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR13
    #define CAN2RXTSRH_TSR14            _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR14
    #define CAN2RXTSRH_TSR15            _CAN2RXTSR.Overlap_STR.CAN2RXTSRHSTR.Bits.TSR15
    
    #define CAN2RXTSRH_TSR8_MASK        1U
    #define CAN2RXTSRH_TSR9_MASK        2U
    #define CAN2RXTSRH_TSR10_MASK       4U
    #define CAN2RXTSRH_TSR11_MASK       8U
    #define CAN2RXTSRH_TSR12_MASK       16U
    #define CAN2RXTSRH_TSR13_MASK       32U
    #define CAN2RXTSRH_TSR14_MASK       64U
    #define CAN2RXTSRH_TSR15_MASK       128U
    

    /*** CAN2RXTSRL - MSCAN2 Receive Time Stamp Register Low; 0x000001EF ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
    } CAN2RXTSRLSTR;
    #define CAN2RXTSRL                  _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Byte
    #define CAN2RXTSRL_TSR0             _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR0
    #define CAN2RXTSRL_TSR1             _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR1
    #define CAN2RXTSRL_TSR2             _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR2
    #define CAN2RXTSRL_TSR3             _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR3
    #define CAN2RXTSRL_TSR4             _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR4
    #define CAN2RXTSRL_TSR5             _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR5
    #define CAN2RXTSRL_TSR6             _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR6
    #define CAN2RXTSRL_TSR7             _CAN2RXTSR.Overlap_STR.CAN2RXTSRLSTR.Bits.TSR7
    
    #define CAN2RXTSRL_TSR0_MASK        1U
    #define CAN2RXTSRL_TSR1_MASK        2U
    #define CAN2RXTSRL_TSR2_MASK        4U
    #define CAN2RXTSRL_TSR3_MASK        8U
    #define CAN2RXTSRL_TSR4_MASK        16U
    #define CAN2RXTSRL_TSR5_MASK        32U
    #define CAN2RXTSRL_TSR6_MASK        64U
    #define CAN2RXTSRL_TSR7_MASK        128U
    
  } Overlap_STR;

  struct {
    word TSR0        :1;                                       /* Time Stamp Bit 0 */
    word TSR1        :1;                                       /* Time Stamp Bit 1 */
    word TSR2        :1;                                       /* Time Stamp Bit 2 */
    word TSR3        :1;                                       /* Time Stamp Bit 3 */
    word TSR4        :1;                                       /* Time Stamp Bit 4 */
    word TSR5        :1;                                       /* Time Stamp Bit 5 */
    word TSR6        :1;                                       /* Time Stamp Bit 6 */
    word TSR7        :1;                                       /* Time Stamp Bit 7 */
    word TSR8        :1;                                       /* Time Stamp Bit 8 */
    word TSR9        :1;                                       /* Time Stamp Bit 9 */
    word TSR10       :1;                                       /* Time Stamp Bit 10 */
    word TSR11       :1;                                       /* Time Stamp Bit 11 */
    word TSR12       :1;                                       /* Time Stamp Bit 12 */
    word TSR13       :1;                                       /* Time Stamp Bit 13 */
    word TSR14       :1;                                       /* Time Stamp Bit 14 */
    word TSR15       :1;                                       /* Time Stamp Bit 15 */
  } Bits;
} CAN2RXTSRSTR;
extern volatile CAN2RXTSRSTR _CAN2RXTSR @(REG_BASE + 0x000001EEUL);
#define CAN2RXTSR                       _CAN2RXTSR.Word
#define CAN2RXTSR_TSR0                  _CAN2RXTSR.Bits.TSR0
#define CAN2RXTSR_TSR1                  _CAN2RXTSR.Bits.TSR1
#define CAN2RXTSR_TSR2                  _CAN2RXTSR.Bits.TSR2
#define CAN2RXTSR_TSR3                  _CAN2RXTSR.Bits.TSR3
#define CAN2RXTSR_TSR4                  _CAN2RXTSR.Bits.TSR4
#define CAN2RXTSR_TSR5                  _CAN2RXTSR.Bits.TSR5
#define CAN2RXTSR_TSR6                  _CAN2RXTSR.Bits.TSR6
#define CAN2RXTSR_TSR7                  _CAN2RXTSR.Bits.TSR7
#define CAN2RXTSR_TSR8                  _CAN2RXTSR.Bits.TSR8
#define CAN2RXTSR_TSR9                  _CAN2RXTSR.Bits.TSR9
#define CAN2RXTSR_TSR10                 _CAN2RXTSR.Bits.TSR10
#define CAN2RXTSR_TSR11                 _CAN2RXTSR.Bits.TSR11
#define CAN2RXTSR_TSR12                 _CAN2RXTSR.Bits.TSR12
#define CAN2RXTSR_TSR13                 _CAN2RXTSR.Bits.TSR13
#define CAN2RXTSR_TSR14                 _CAN2RXTSR.Bits.TSR14
#define CAN2RXTSR_TSR15                 _CAN2RXTSR.Bits.TSR15

