frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
#define CAN2RXTSR_TSR0_MASK             1U
#define CAN2RXTSR_TSR1_MASK             2U
#define CAN2RXTSR_TSR2_MASK             4U
#define CAN2RXTSR_TSR3_MASK             8U
#define CAN2RXTSR_TSR4_MASK             16U
#define CAN2RXTSR_TSR5_MASK             32U
#define CAN2RXTSR_TSR6_MASK             64U
#define CAN2RXTSR_TSR7_MASK             128U
#define CAN2RXTSR_TSR8_MASK             256U
#define CAN2RXTSR_TSR9_MASK             512U
#define CAN2RXTSR_TSR10_MASK            1024U
#define CAN2RXTSR_TSR11_MASK            2048U
#define CAN2RXTSR_TSR12_MASK            4096U
#define CAN2RXTSR_TSR13_MASK            8192U
#define CAN2RXTSR_TSR14_MASK            16384U
#define CAN2RXTSR_TSR15_MASK            32768U


/*** CAN2TXIDR0 - MSCAN2 Transmit Identifier Register 0; 0x000001F0 ***/
typedef union {
  byte Byte;
  struct {
    byte ID21        :1;                                       /* Extended format identifier Bit 21 */
    byte ID22        :1;                                       /* Extended format identifier Bit 22 */
    byte ID23        :1;                                       /* Extended format identifier Bit 23 */
    byte ID24        :1;                                       /* Extended format identifier Bit 24 */
    byte ID25        :1;                                       /* Extended format identifier Bit 25 */
    byte ID26        :1;                                       /* Extended format identifier Bit 26 */
    byte ID27        :1;                                       /* Extended format identifier Bit 27 */
    byte ID28        :1;                                       /* Extended format identifier Bit 28 */
  } Bits;
} CAN2TXIDR0STR;
extern volatile CAN2TXIDR0STR _CAN2TXIDR0 @(REG_BASE + 0x000001F0UL);
#define CAN2TXIDR0                      _CAN2TXIDR0.Byte
#define CAN2TXIDR0_ID21                 _CAN2TXIDR0.Bits.ID21
#define CAN2TXIDR0_ID22                 _CAN2TXIDR0.Bits.ID22
#define CAN2TXIDR0_ID23                 _CAN2TXIDR0.Bits.ID23
#define CAN2TXIDR0_ID24                 _CAN2TXIDR0.Bits.ID24
#define CAN2TXIDR0_ID25                 _CAN2TXIDR0.Bits.ID25
#define CAN2TXIDR0_ID26                 _CAN2TXIDR0.Bits.ID26
#define CAN2TXIDR0_ID27                 _CAN2TXIDR0.Bits.ID27
#define CAN2TXIDR0_ID28                 _CAN2TXIDR0.Bits.ID28
/* CAN2TXIDR_ARR: Access 4 CAN2TXIDRx registers in an array */
#define CAN2TXIDR_ARR                   ((volatile byte *) &CAN2TXIDR0)

#define CAN2TXIDR0_ID21_MASK            1U
#define CAN2TXIDR0_ID22_MASK            2U
#define CAN2TXIDR0_ID23_MASK            4U
#define CAN2TXIDR0_ID24_MASK            8U
#define CAN2TXIDR0_ID25_MASK            16U
#define CAN2TXIDR0_ID26_MASK            32U
#define CAN2TXIDR0_ID27_MASK            64U
#define CAN2TXIDR0_ID28_MASK            128U


/*** CAN2TXIDR1 - MSCAN2 Transmit Identifier Register 1; 0x000001F1 ***/
typedef union {
  byte Byte;
  struct {
    byte ID15        :1;                                       /* Extended format identifier Bit 15 */
    byte ID16        :1;                                       /* Extended format identifier Bit 16 */
    byte ID17        :1;                                       /* Extended format identifier Bit 17 */
    byte IDE         :1;                                       /* ID Extended */
    byte SRR         :1;                                       /* Substitute Remote Request */
    byte ID18        :1;                                       /* Extended format identifier Bit 18 */
    byte ID19        :1;                                       /* Extended format identifier Bit 19 */
    byte ID20        :1;                                       /* Extended format identifier Bit 20 */
  } Bits;
  struct {
    byte grpID_15 :3;
    byte         :1;
    byte         :1;
    byte grpID_18 :3;
  } MergedBits;
} CAN2TXIDR1STR;
extern volatile CAN2TXIDR1STR _CAN2TXIDR1 @(REG_BASE + 0x000001F1UL);
#define CAN2TXIDR1                      _CAN2TXIDR1.Byte
#define CAN2TXIDR1_ID15                 _CAN2TXIDR1.Bits.ID15
#define CAN2TXIDR1_ID16                 _CAN2TXIDR1.Bits.ID16
#define CAN2TXIDR1_ID17                 _CAN2TXIDR1.Bits.ID17
#define CAN2TXIDR1_IDE                  _CAN2TXIDR1.Bits.IDE
#define CAN2TXIDR1_SRR                  _CAN2TXIDR1.Bits.SRR
#define CAN2TXIDR1_ID18                 _CAN2TXIDR1.Bits.ID18
#define CAN2TXIDR1_ID19                 _CAN2TXIDR1.Bits.ID19
#define CAN2TXIDR1_ID20                 _CAN2TXIDR1.Bits.ID20
#define CAN2TXIDR1_ID_15                _CAN2TXIDR1.MergedBits.grpID_15
#define CAN2TXIDR1_ID_18                _CAN2TXIDR1.MergedBits.grpID_18
#define CAN2TXIDR1_ID                   CAN2TXIDR1_ID_15

#define CAN2TXIDR1_ID15_MASK            1U
#define CAN2TXIDR1_ID16_MASK            2U
#define CAN2TXIDR1_ID17_MASK            4U
#define CAN2TXIDR1_IDE_MASK             8U
#define CAN2TXIDR1_SRR_MASK             16U
#define CAN2TXIDR1_ID18_MASK            32U
#define CAN2TXIDR1_ID19_MASK            64U
#define CAN2TXIDR1_ID20_MASK            128U
#define CAN2TXIDR1_ID_15_MASK           7U
#define CAN2TXIDR1_ID_15_BITNUM         0U
#define CAN2TXIDR1_ID_18_MASK           224U
#define CAN2TXIDR1_ID_18_BITNUM         5U


/*** CAN2TXIDR2 - MSCAN2 Transmit Identifier Register 2; 0x000001F2 ***/
typedef union {
  byte Byte;
  struct {
    byte ID7         :1;                                       /* Extended format identifier Bit 7 */
    byte ID8         :1;                                       /* Extended format identifier Bit 8 */
    byte ID9         :1;                                       /* Extended format identifier Bit 9 */
    byte ID10        :1;                                       /* Extended format identifier Bit 10 */
    byte ID11        :1;                                       /* Extended format identifier Bit 11 */
    byte ID12        :1;                                       /* Extended format identifier Bit 12 */
    byte ID13        :1;                                       /* Extended format identifier Bit 13 */
    byte ID14        :1;                                       /* Extended format identifier Bit 14 */
  } Bits;
} CAN2TXIDR2STR;
