frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
/*** CAN2TXDSR2 - MSCAN2 Transmit Data Segment Register 2; 0x000001F6 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2TXDSR2STR;
extern volatile CAN2TXDSR2STR _CAN2TXDSR2 @(REG_BASE + 0x000001F6UL);
#define CAN2TXDSR2                      _CAN2TXDSR2.Byte
#define CAN2TXDSR2_DB0                  _CAN2TXDSR2.Bits.DB0
#define CAN2TXDSR2_DB1                  _CAN2TXDSR2.Bits.DB1
#define CAN2TXDSR2_DB2                  _CAN2TXDSR2.Bits.DB2
#define CAN2TXDSR2_DB3                  _CAN2TXDSR2.Bits.DB3
#define CAN2TXDSR2_DB4                  _CAN2TXDSR2.Bits.DB4
#define CAN2TXDSR2_DB5                  _CAN2TXDSR2.Bits.DB5
#define CAN2TXDSR2_DB6                  _CAN2TXDSR2.Bits.DB6
#define CAN2TXDSR2_DB7                  _CAN2TXDSR2.Bits.DB7

#define CAN2TXDSR2_DB0_MASK             1U
#define CAN2TXDSR2_DB1_MASK             2U
#define CAN2TXDSR2_DB2_MASK             4U
#define CAN2TXDSR2_DB3_MASK             8U
#define CAN2TXDSR2_DB4_MASK             16U
#define CAN2TXDSR2_DB5_MASK             32U
#define CAN2TXDSR2_DB6_MASK             64U
#define CAN2TXDSR2_DB7_MASK             128U


/*** CAN2TXDSR3 - MSCAN2 Transmit Data Segment Register 3; 0x000001F7 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2TXDSR3STR;
extern volatile CAN2TXDSR3STR _CAN2TXDSR3 @(REG_BASE + 0x000001F7UL);
#define CAN2TXDSR3                      _CAN2TXDSR3.Byte
#define CAN2TXDSR3_DB0                  _CAN2TXDSR3.Bits.DB0
#define CAN2TXDSR3_DB1                  _CAN2TXDSR3.Bits.DB1
#define CAN2TXDSR3_DB2                  _CAN2TXDSR3.Bits.DB2
#define CAN2TXDSR3_DB3                  _CAN2TXDSR3.Bits.DB3
#define CAN2TXDSR3_DB4                  _CAN2TXDSR3.Bits.DB4
#define CAN2TXDSR3_DB5                  _CAN2TXDSR3.Bits.DB5
#define CAN2TXDSR3_DB6                  _CAN2TXDSR3.Bits.DB6
#define CAN2TXDSR3_DB7                  _CAN2TXDSR3.Bits.DB7

#define CAN2TXDSR3_DB0_MASK             1U
#define CAN2TXDSR3_DB1_MASK             2U
#define CAN2TXDSR3_DB2_MASK             4U
#define CAN2TXDSR3_DB3_MASK             8U
#define CAN2TXDSR3_DB4_MASK             16U
#define CAN2TXDSR3_DB5_MASK             32U
#define CAN2TXDSR3_DB6_MASK             64U
#define CAN2TXDSR3_DB7_MASK             128U


/*** CAN2TXDSR4 - MSCAN2 Transmit Data Segment Register 4; 0x000001F8 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2TXDSR4STR;
extern volatile CAN2TXDSR4STR _CAN2TXDSR4 @(REG_BASE + 0x000001F8UL);
#define CAN2TXDSR4                      _CAN2TXDSR4.Byte
#define CAN2TXDSR4_DB0                  _CAN2TXDSR4.Bits.DB0
#define CAN2TXDSR4_DB1                  _CAN2TXDSR4.Bits.DB1
#define CAN2TXDSR4_DB2                  _CAN2TXDSR4.Bits.DB2
#define CAN2TXDSR4_DB3                  _CAN2TXDSR4.Bits.DB3
#define CAN2TXDSR4_DB4                  _CAN2TXDSR4.Bits.DB4
#define CAN2TXDSR4_DB5                  _CAN2TXDSR4.Bits.DB5
#define CAN2TXDSR4_DB6                  _CAN2TXDSR4.Bits.DB6
#define CAN2TXDSR4_DB7                  _CAN2TXDSR4.Bits.DB7

#define CAN2TXDSR4_DB0_MASK             1U
#define CAN2TXDSR4_DB1_MASK             2U
#define CAN2TXDSR4_DB2_MASK             4U
#define CAN2TXDSR4_DB3_MASK             8U
#define CAN2TXDSR4_DB4_MASK             16U
#define CAN2TXDSR4_DB5_MASK             32U
#define CAN2TXDSR4_DB6_MASK             64U
#define CAN2TXDSR4_DB7_MASK             128U


/*** CAN2TXDSR5 - MSCAN2 Transmit Data Segment Register 5; 0x000001F9 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2TXDSR5STR;
extern volatile CAN2TXDSR5STR _CAN2TXDSR5 @(REG_BASE + 0x000001F9UL);
#define CAN2TXDSR5                      _CAN2TXDSR5.Byte
#define CAN2TXDSR5_DB0                  _CAN2TXDSR5.Bits.DB0
#define CAN2TXDSR5_DB1                  _CAN2TXDSR5.Bits.DB1
#define CAN2TXDSR5_DB2                  _CAN2TXDSR5.Bits.DB2
#define CAN2TXDSR5_DB3                  _CAN2TXDSR5.Bits.DB3
#define CAN2TXDSR5_DB4                  _CAN2TXDSR5.Bits.DB4
#define CAN2TXDSR5_DB5                  _CAN2TXDSR5.Bits.DB5
#define CAN2TXDSR5_DB6                  _CAN2TXDSR5.Bits.DB6
#define CAN2TXDSR5_DB7                  _CAN2TXDSR5.Bits.DB7

#define CAN2TXDSR5_DB0_MASK             1U
#define CAN2TXDSR5_DB1_MASK             2U
#define CAN2TXDSR5_DB2_MASK             4U
#define CAN2TXDSR5_DB3_MASK             8U
#define CAN2TXDSR5_DB4_MASK             16U
#define CAN2TXDSR5_DB5_MASK             32U
#define CAN2TXDSR5_DB6_MASK             64U
#define CAN2TXDSR5_DB7_MASK             128U


/*** CAN2TXDSR6 - MSCAN2 Transmit Data Segment Register 6; 0x000001FA ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2TXDSR6STR;
extern volatile CAN2TXDSR6STR _CAN2TXDSR6 @(REG_BASE + 0x000001FAUL);
#define CAN2TXDSR6                      _CAN2TXDSR6.Byte
#define CAN2TXDSR6_DB0                  _CAN2TXDSR6.Bits.DB0
#define CAN2TXDSR6_DB1                  _CAN2TXDSR6.Bits.DB1
#define CAN2TXDSR6_DB2                  _CAN2TXDSR6.Bits.DB2
#define CAN2TXDSR6_DB3                  _CAN2TXDSR6.Bits.DB3
#define CAN2TXDSR6_DB4                  _CAN2TXDSR6.Bits.DB4
#define CAN2TXDSR6_DB5                  _CAN2TXDSR6.Bits.DB5
#define CAN2TXDSR6_DB6                  _CAN2TXDSR6.Bits.DB6
#define CAN2TXDSR6_DB7                  _CAN2TXDSR6.Bits.DB7

#define CAN2TXDSR6_DB0_MASK             1U
#define CAN2TXDSR6_DB1_MASK             2U
#define CAN2TXDSR6_DB2_MASK             4U
#define CAN2TXDSR6_DB3_MASK             8U
#define CAN2TXDSR6_DB4_MASK             16U
#define CAN2TXDSR6_DB5_MASK             32U
#define CAN2TXDSR6_DB6_MASK             64U
#define CAN2TXDSR6_DB7_MASK             128U


/*** CAN2TXDSR7 - MSCAN2 Transmit Data Segment Register 7; 0x000001FB ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2TXDSR7STR;
extern volatile CAN2TXDSR7STR _CAN2TXDSR7 @(REG_BASE + 0x000001FBUL);
#define CAN2TXDSR7                      _CAN2TXDSR7.Byte
#define CAN2TXDSR7_DB0                  _CAN2TXDSR7.Bits.DB0
#define CAN2TXDSR7_DB1                  _CAN2TXDSR7.Bits.DB1
#define CAN2TXDSR7_DB2                  _CAN2TXDSR7.Bits.DB2
#define CAN2TXDSR7_DB3                  _CAN2TXDSR7.Bits.DB3
#define CAN2TXDSR7_DB4                  _CAN2TXDSR7.Bits.DB4
#define CAN2TXDSR7_DB5                  _CAN2TXDSR7.Bits.DB5
#define CAN2TXDSR7_DB6                  _CAN2TXDSR7.Bits.DB6
#define CAN2TXDSR7_DB7                  _CAN2TXDSR7.Bits.DB7

#define CAN2TXDSR7_DB0_MASK             1U
#define CAN2TXDSR7_DB1_MASK             2U
#define CAN2TXDSR7_DB2_MASK             4U
#define CAN2TXDSR7_DB3_MASK             8U
#define CAN2TXDSR7_DB4_MASK             16U
#define CAN2TXDSR7_DB5_MASK             32U
#define CAN2TXDSR7_DB6_MASK             64U
#define CAN2TXDSR7_DB7_MASK             128U


/*** CAN2TXDLR - MSCAN2 Transmit Data Length Register; 0x000001FC ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TXDLRSTR;
extern volatile CAN2TXDLRSTR _CAN2TXDLR @(REG_BASE + 0x000001FCUL);
#define CAN2TXDLR                       _CAN2TXDLR.Byte
#define CAN2TXDLR_DLC0                  _CAN2TXDLR.Bits.DLC0
#define CAN2TXDLR_DLC1                  _CAN2TXDLR.Bits.DLC1
#define CAN2TXDLR_DLC2                  _CAN2TXDLR.Bits.DLC2
#define CAN2TXDLR_DLC3                  _CAN2TXDLR.Bits.DLC3
#define CAN2TXDLR_DLC                   _CAN2TXDLR.MergedBits.grpDLC

#define CAN2TXDLR_DLC0_MASK             1U
#define CAN2TXDLR_DLC1_MASK             2U
#define CAN2TXDLR_DLC2_MASK             4U
#define CAN2TXDLR_DLC3_MASK             8U
#define CAN2TXDLR_DLC_MASK              15U
#define CAN2TXDLR_DLC_BITNUM            0U


/*** CAN2TXTBPR - MSCAN2 Transmit Buffer Priority; 0x000001FD ***/
typedef union {
  byte Byte;
  struct {
    byte PRIO0       :1;                                       /* Transmit Buffer Priority Bit 0 */
    byte PRIO1       :1;                                       /* Transmit Buffer Priority Bit 1 */
    byte PRIO2       :1;                                       /* Transmit Buffer Priority Bit 2 */
    byte PRIO3       :1;                                       /* Transmit Buffer Priority Bit 3 */
    byte PRIO4       :1;                                       /* Transmit Buffer Priority Bit 4 */
    byte PRIO5       :1;                                       /* Transmit Buffer Priority Bit 5 */
    byte PRIO6       :1;                                       /* Transmit Buffer Priority Bit 6 */
    byte PRIO7       :1;                                       /* Transmit Buffer Priority Bit 7 */
  } Bits;
} CAN2TXTBPRSTR;
