frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
#define PIEJ_PIEJ0_MASK                 1U
#define PIEJ_PIEJ1_MASK                 2U
#define PIEJ_PIEJ2_MASK                 4U
#define PIEJ_PIEJ3_MASK                 8U
#define PIEJ_PIEJ4_MASK                 16U
#define PIEJ_PIEJ5_MASK                 32U
#define PIEJ_PIEJ6_MASK                 64U
#define PIEJ_PIEJ7_MASK                 128U


/*** PIFJ - Port J Interrupt Flag Register; 0x0000026F ***/
typedef union {
  byte Byte;
  struct {
    byte PIFJ0       :1;                                       /* Port J interrupt flag bit 0 */
    byte PIFJ1       :1;                                       /* Port J interrupt flag bit 1 */
    byte PIFJ2       :1;                                       /* Port J interrupt flag bit 2 */
    byte PIFJ3       :1;                                       /* Port J interrupt flag bit 3 */
    byte PIFJ4       :1;                                       /* Port J interrupt flag bit 4 */
    byte PIFJ5       :1;                                       /* Port J interrupt flag bit 5 */
    byte PIFJ6       :1;                                       /* Port J interrupt flag bit 6 */
    byte PIFJ7       :1;                                       /* Port J interrupt flag bit 7 */
  } Bits;
} PIFJSTR;
extern volatile PIFJSTR _PIFJ @(REG_BASE + 0x0000026FUL);
#define PIFJ                            _PIFJ.Byte
#define PIFJ_PIFJ0                      _PIFJ.Bits.PIFJ0
#define PIFJ_PIFJ1                      _PIFJ.Bits.PIFJ1
#define PIFJ_PIFJ2                      _PIFJ.Bits.PIFJ2
#define PIFJ_PIFJ3                      _PIFJ.Bits.PIFJ3
#define PIFJ_PIFJ4                      _PIFJ.Bits.PIFJ4
#define PIFJ_PIFJ5                      _PIFJ.Bits.PIFJ5
#define PIFJ_PIFJ6                      _PIFJ.Bits.PIFJ6
#define PIFJ_PIFJ7                      _PIFJ.Bits.PIFJ7

#define PIFJ_PIFJ0_MASK                 1U
#define PIFJ_PIFJ1_MASK                 2U
#define PIFJ_PIFJ2_MASK                 4U
#define PIFJ_PIFJ3_MASK                 8U
#define PIFJ_PIFJ4_MASK                 16U
#define PIFJ_PIFJ5_MASK                 32U
#define PIFJ_PIFJ6_MASK                 64U
#define PIFJ_PIFJ7_MASK                 128U


/*** PT01AD0 - Port AD0 Data Register; 0x00000270 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PT0AD0 - Port AD0H Data Register; 0x00000270 ***/
    union {
      byte Byte;
      struct {
        byte PT0AD00     :1;                                       /* Port AD0 data bit 0 */
        byte PT0AD01     :1;                                       /* Port AD0 data bit 1 */
        byte PT0AD02     :1;                                       /* Port AD0 data bit 2 */
        byte PT0AD03     :1;                                       /* Port AD0 data bit 3 */
        byte PT0AD04     :1;                                       /* Port AD0 data bit 4 */
        byte PT0AD05     :1;                                       /* Port AD0 data bit 5 */
        byte PT0AD06     :1;                                       /* Port AD0 data bit 6 */
        byte PT0AD07     :1;                                       /* Port AD0 data bit 7 */
      } Bits;
    } PT0AD0STR;
    #define PT0AD0                      _PT01AD0.Overlap_STR.PT0AD0STR.Byte
    #define PT0AD0_PT0AD00              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD00
    #define PT0AD0_PT0AD01              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD01
    #define PT0AD0_PT0AD02              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD02
    #define PT0AD0_PT0AD03              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD03
    #define PT0AD0_PT0AD04              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD04
    #define PT0AD0_PT0AD05              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD05
    #define PT0AD0_PT0AD06              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD06
    #define PT0AD0_PT0AD07              _PT01AD0.Overlap_STR.PT0AD0STR.Bits.PT0AD07
    
    #define PT0AD0_PT0AD00_MASK         1U
    #define PT0AD0_PT0AD01_MASK         2U
    #define PT0AD0_PT0AD02_MASK         4U
    #define PT0AD0_PT0AD03_MASK         8U
    #define PT0AD0_PT0AD04_MASK         16U
    #define PT0AD0_PT0AD05_MASK         32U
    #define PT0AD0_PT0AD06_MASK         64U
    #define PT0AD0_PT0AD07_MASK         128U
    

    /*** PT1AD0 - Port AD0L Data Register; 0x00000271 ***/
    union {
      byte Byte;
      struct {
        byte PT1AD00     :1;                                       /* Port AD0 data bit 0 */
        byte PT1AD01     :1;                                       /* Port AD0 data bit 1 */
        byte PT1AD02     :1;                                       /* Port AD0 data bit 2 */
        byte PT1AD03     :1;                                       /* Port AD0 data bit 3 */
        byte PT1AD04     :1;                                       /* Port AD0 data bit 4 */
        byte PT1AD05     :1;                                       /* Port AD0 data bit 5 */
        byte PT1AD06     :1;                                       /* Port AD0 data bit 6 */
        byte PT1AD07     :1;                                       /* Port AD0 data bit 7 */
      } Bits;
    } PT1AD0STR;
    #define PT1AD0                      _PT01AD0.Overlap_STR.PT1AD0STR.Byte
    #define PT1AD0_PT1AD00              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD00
    #define PT1AD0_PT1AD01              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD01
    #define PT1AD0_PT1AD02              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD02
    #define PT1AD0_PT1AD03              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD03
    #define PT1AD0_PT1AD04              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD04
    #define PT1AD0_PT1AD05              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD05
    #define PT1AD0_PT1AD06              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD06
    #define PT1AD0_PT1AD07              _PT01AD0.Overlap_STR.PT1AD0STR.Bits.PT1AD07
    
    #define PT1AD0_PT1AD00_MASK         1U
    #define PT1AD0_PT1AD01_MASK         2U
    #define PT1AD0_PT1AD02_MASK         4U
    #define PT1AD0_PT1AD03_MASK         8U
    #define PT1AD0_PT1AD04_MASK         16U
    #define PT1AD0_PT1AD05_MASK         32U
    #define PT1AD0_PT1AD06_MASK         64U
    #define PT1AD0_PT1AD07_MASK         128U
    
  } Overlap_STR;

