frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
    /*** RDR1AD1 - Port AD1L Reduced Drive Register; 0x0000027D ***/
    union {
      byte Byte;
      struct {
        byte RDR1AD10    :1;                                       /* Port AD1L reduced drive bit 0 */
        byte RDR1AD11    :1;                                       /* Port AD1L reduced drive bit 1 */
        byte RDR1AD12    :1;                                       /* Port AD1L reduced drive bit 2 */
        byte RDR1AD13    :1;                                       /* Port AD1L reduced drive bit 3 */
        byte RDR1AD14    :1;                                       /* Port AD1L reduced drive bit 4 */
        byte RDR1AD15    :1;                                       /* Port AD1L reduced drive bit 5 */
        byte RDR1AD16    :1;                                       /* Port AD1L reduced drive bit 6 */
        byte RDR1AD17    :1;                                       /* Port AD1L reduced drive bit 7 */
      } Bits;
    } RDR1AD1STR;
    #define RDR1AD1                     _RDR01AD1.Overlap_STR.RDR1AD1STR.Byte
    #define RDR1AD1_RDR1AD10            _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD10
    #define RDR1AD1_RDR1AD11            _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD11
    #define RDR1AD1_RDR1AD12            _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD12
    #define RDR1AD1_RDR1AD13            _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD13
    #define RDR1AD1_RDR1AD14            _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD14
    #define RDR1AD1_RDR1AD15            _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD15
    #define RDR1AD1_RDR1AD16            _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD16
    #define RDR1AD1_RDR1AD17            _RDR01AD1.Overlap_STR.RDR1AD1STR.Bits.RDR1AD17
    
    #define RDR1AD1_RDR1AD10_MASK       1U
    #define RDR1AD1_RDR1AD11_MASK       2U
    #define RDR1AD1_RDR1AD12_MASK       4U
    #define RDR1AD1_RDR1AD13_MASK       8U
    #define RDR1AD1_RDR1AD14_MASK       16U
    #define RDR1AD1_RDR1AD15_MASK       32U
    #define RDR1AD1_RDR1AD16_MASK       64U
    #define RDR1AD1_RDR1AD17_MASK       128U
    
  } Overlap_STR;

  struct {
    word RDR1AD10    :1;                                       /* Port AD1 reduced drive bit 0 */
    word RDR1AD11    :1;                                       /* Port AD1 reduced drive bit 1 */
    word RDR1AD12    :1;                                       /* Port AD1 reduced drive bit 2 */
    word RDR1AD13    :1;                                       /* Port AD1 reduced drive bit 3 */
    word RDR1AD14    :1;                                       /* Port AD1 reduced drive bit 4 */
    word RDR1AD15    :1;                                       /* Port AD1 reduced drive bit 5 */
    word RDR1AD16    :1;                                       /* Port AD1 reduced drive bit 6 */
    word RDR1AD17    :1;                                       /* Port AD1 reduced drive bit 7 */
    word RDR0AD10    :1;                                       /* Port AD1 reduced drive bit 8 */
    word RDR0AD11    :1;                                       /* Port AD1 reduced drive bit 9 */
    word RDR0AD12    :1;                                       /* Port AD1 reduced drive bit 10 */
    word RDR0AD13    :1;                                       /* Port AD1 reduced drive bit 11 */
    word RDR0AD14    :1;                                       /* Port AD1 reduced drive bit 12 */
    word RDR0AD15    :1;                                       /* Port AD1 reduced drive bit 13 */
    word RDR0AD16    :1;                                       /* Port AD1 reduced drive bit 14 */
    word RDR0AD17    :1;                                       /* Port AD1 reduced drive bit 15 */
  } Bits;
  struct {
    word grpRDR1AD_10 :8;
    word grpRDR0AD_10 :8;
  } MergedBits;
} RDR01AD1STR;
extern volatile RDR01AD1STR _RDR01AD1 @(REG_BASE + 0x0000027CUL);
#define RDR01AD1                        _RDR01AD1.Word
#define RDR01AD1_RDR1AD10               _RDR01AD1.Bits.RDR1AD10
#define RDR01AD1_RDR1AD11               _RDR01AD1.Bits.RDR1AD11
#define RDR01AD1_RDR1AD12               _RDR01AD1.Bits.RDR1AD12
#define RDR01AD1_RDR1AD13               _RDR01AD1.Bits.RDR1AD13
#define RDR01AD1_RDR1AD14               _RDR01AD1.Bits.RDR1AD14
#define RDR01AD1_RDR1AD15               _RDR01AD1.Bits.RDR1AD15
#define RDR01AD1_RDR1AD16               _RDR01AD1.Bits.RDR1AD16
#define RDR01AD1_RDR1AD17               _RDR01AD1.Bits.RDR1AD17
#define RDR01AD1_RDR0AD10               _RDR01AD1.Bits.RDR0AD10
#define RDR01AD1_RDR0AD11               _RDR01AD1.Bits.RDR0AD11
#define RDR01AD1_RDR0AD12               _RDR01AD1.Bits.RDR0AD12
#define RDR01AD1_RDR0AD13               _RDR01AD1.Bits.RDR0AD13
#define RDR01AD1_RDR0AD14               _RDR01AD1.Bits.RDR0AD14
#define RDR01AD1_RDR0AD15               _RDR01AD1.Bits.RDR0AD15
#define RDR01AD1_RDR0AD16               _RDR01AD1.Bits.RDR0AD16
#define RDR01AD1_RDR0AD17               _RDR01AD1.Bits.RDR0AD17
#define RDR01AD1_RDR1AD_10              _RDR01AD1.MergedBits.grpRDR1AD_10
#define RDR01AD1_RDR0AD_10              _RDR01AD1.MergedBits.grpRDR0AD_10
#define RDR01AD1_RDR1AD                 RDR01AD1_RDR1AD_10
#define RDR01AD1_RDR0AD                 RDR01AD1_RDR0AD_10

#define RDR01AD1_RDR1AD10_MASK          1U
#define RDR01AD1_RDR1AD11_MASK          2U
#define RDR01AD1_RDR1AD12_MASK          4U
#define RDR01AD1_RDR1AD13_MASK          8U
#define RDR01AD1_RDR1AD14_MASK          16U
#define RDR01AD1_RDR1AD15_MASK          32U
#define RDR01AD1_RDR1AD16_MASK          64U
#define RDR01AD1_RDR1AD17_MASK          128U
#define RDR01AD1_RDR0AD10_MASK          256U
#define RDR01AD1_RDR0AD11_MASK          512U
#define RDR01AD1_RDR0AD12_MASK          1024U
#define RDR01AD1_RDR0AD13_MASK          2048U
#define RDR01AD1_RDR0AD14_MASK          4096U
#define RDR01AD1_RDR0AD15_MASK          8192U
#define RDR01AD1_RDR0AD16_MASK          16384U
#define RDR01AD1_RDR0AD17_MASK          32768U
#define RDR01AD1_RDR1AD_10_MASK         255U
#define RDR01AD1_RDR1AD_10_BITNUM       0U
#define RDR01AD1_RDR0AD_10_MASK         65280U
#define RDR01AD1_RDR0AD_10_BITNUM       8U


/*** PER01AD1 - Port AD1 Pull Up Enable Register; 0x0000027E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PER0AD1 - Port AD1H Pull Up Enable Register; 0x0000027E ***/
    union {
      byte Byte;
      struct {
        byte PER0AD10    :1;                                       /* Port AD1H pull up enable bit 0 */
        byte PER0AD11    :1;                                       /* Port AD1H pull up enable bit 1 */
        byte PER0AD12    :1;                                       /* Port AD1H pull up enable bit 2 */
        byte PER0AD13    :1;                                       /* Port AD1H pull up enable bit 3 */
        byte PER0AD14    :1;                                       /* Port AD1H pull up enable bit 4 */
        byte PER0AD15    :1;                                       /* Port AD1H pull up enable bit 5 */
        byte PER0AD16    :1;                                       /* Port AD1H pull up enable bit 6 */
        byte PER0AD17    :1;                                       /* Port AD1H pull up enable bit 7 */
      } Bits;
    } PER0AD1STR;
    #define PER0AD1                     _PER01AD1.Overlap_STR.PER0AD1STR.Byte
    #define PER0AD1_PER0AD10            _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD10
    #define PER0AD1_PER0AD11            _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD11
    #define PER0AD1_PER0AD12            _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD12
    #define PER0AD1_PER0AD13            _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD13
    #define PER0AD1_PER0AD14            _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD14
    #define PER0AD1_PER0AD15            _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD15
    #define PER0AD1_PER0AD16            _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD16
    #define PER0AD1_PER0AD17            _PER01AD1.Overlap_STR.PER0AD1STR.Bits.PER0AD17
    
    #define PER0AD1_PER0AD10_MASK       1U
    #define PER0AD1_PER0AD11_MASK       2U
    #define PER0AD1_PER0AD12_MASK       4U
    #define PER0AD1_PER0AD13_MASK       8U
    #define PER0AD1_PER0AD14_MASK       16U
    #define PER0AD1_PER0AD15_MASK       32U
    #define PER0AD1_PER0AD16_MASK       64U
    #define PER0AD1_PER0AD17_MASK       128U
    

