frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
extern volatile CAN4IDAR0STR _CAN4IDAR0 @(REG_BASE + 0x00000290UL);
#define CAN4IDAR0                       _CAN4IDAR0.Byte
#define CAN4IDAR0_AC0                   _CAN4IDAR0.Bits.AC0
#define CAN4IDAR0_AC1                   _CAN4IDAR0.Bits.AC1
#define CAN4IDAR0_AC2                   _CAN4IDAR0.Bits.AC2
#define CAN4IDAR0_AC3                   _CAN4IDAR0.Bits.AC3
#define CAN4IDAR0_AC4                   _CAN4IDAR0.Bits.AC4
#define CAN4IDAR0_AC5                   _CAN4IDAR0.Bits.AC5
#define CAN4IDAR0_AC6                   _CAN4IDAR0.Bits.AC6
#define CAN4IDAR0_AC7                   _CAN4IDAR0.Bits.AC7
/* CAN4IDAR_ARR: Access 4 CAN4IDARx registers in an array */
#define CAN4IDAR_ARR                    ((volatile byte *) &CAN4IDAR0)

#define CAN4IDAR0_AC0_MASK              1U
#define CAN4IDAR0_AC1_MASK              2U
#define CAN4IDAR0_AC2_MASK              4U
#define CAN4IDAR0_AC3_MASK              8U
#define CAN4IDAR0_AC4_MASK              16U
#define CAN4IDAR0_AC5_MASK              32U
#define CAN4IDAR0_AC6_MASK              64U
#define CAN4IDAR0_AC7_MASK              128U


/*** CAN4IDAR1 - MSCAN4 Identifier Acceptance Register 1; 0x00000291 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN4IDAR1STR;
extern volatile CAN4IDAR1STR _CAN4IDAR1 @(REG_BASE + 0x00000291UL);
#define CAN4IDAR1                       _CAN4IDAR1.Byte
#define CAN4IDAR1_AC0                   _CAN4IDAR1.Bits.AC0
#define CAN4IDAR1_AC1                   _CAN4IDAR1.Bits.AC1
#define CAN4IDAR1_AC2                   _CAN4IDAR1.Bits.AC2
#define CAN4IDAR1_AC3                   _CAN4IDAR1.Bits.AC3
#define CAN4IDAR1_AC4                   _CAN4IDAR1.Bits.AC4
#define CAN4IDAR1_AC5                   _CAN4IDAR1.Bits.AC5
#define CAN4IDAR1_AC6                   _CAN4IDAR1.Bits.AC6
#define CAN4IDAR1_AC7                   _CAN4IDAR1.Bits.AC7

#define CAN4IDAR1_AC0_MASK              1U
#define CAN4IDAR1_AC1_MASK              2U
#define CAN4IDAR1_AC2_MASK              4U
#define CAN4IDAR1_AC3_MASK              8U
#define CAN4IDAR1_AC4_MASK              16U
#define CAN4IDAR1_AC5_MASK              32U
#define CAN4IDAR1_AC6_MASK              64U
#define CAN4IDAR1_AC7_MASK              128U


/*** CAN4IDAR2 - MSCAN4 Identifier Acceptance Register 2; 0x00000292 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN4IDAR2STR;
extern volatile CAN4IDAR2STR _CAN4IDAR2 @(REG_BASE + 0x00000292UL);
#define CAN4IDAR2                       _CAN4IDAR2.Byte
#define CAN4IDAR2_AC0                   _CAN4IDAR2.Bits.AC0
#define CAN4IDAR2_AC1                   _CAN4IDAR2.Bits.AC1
#define CAN4IDAR2_AC2                   _CAN4IDAR2.Bits.AC2
#define CAN4IDAR2_AC3                   _CAN4IDAR2.Bits.AC3
#define CAN4IDAR2_AC4                   _CAN4IDAR2.Bits.AC4
#define CAN4IDAR2_AC5                   _CAN4IDAR2.Bits.AC5
#define CAN4IDAR2_AC6                   _CAN4IDAR2.Bits.AC6
#define CAN4IDAR2_AC7                   _CAN4IDAR2.Bits.AC7

#define CAN4IDAR2_AC0_MASK              1U
#define CAN4IDAR2_AC1_MASK              2U
#define CAN4IDAR2_AC2_MASK              4U
#define CAN4IDAR2_AC3_MASK              8U
#define CAN4IDAR2_AC4_MASK              16U
#define CAN4IDAR2_AC5_MASK              32U
#define CAN4IDAR2_AC6_MASK              64U
#define CAN4IDAR2_AC7_MASK              128U


/*** CAN4IDAR3 - MSCAN4 Identifier Acceptance Register 3; 0x00000293 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN4IDAR3STR;
extern volatile CAN4IDAR3STR _CAN4IDAR3 @(REG_BASE + 0x00000293UL);
#define CAN4IDAR3                       _CAN4IDAR3.Byte
#define CAN4IDAR3_AC0                   _CAN4IDAR3.Bits.AC0
#define CAN4IDAR3_AC1                   _CAN4IDAR3.Bits.AC1
#define CAN4IDAR3_AC2                   _CAN4IDAR3.Bits.AC2
#define CAN4IDAR3_AC3                   _CAN4IDAR3.Bits.AC3
#define CAN4IDAR3_AC4                   _CAN4IDAR3.Bits.AC4
#define CAN4IDAR3_AC5                   _CAN4IDAR3.Bits.AC5
#define CAN4IDAR3_AC6                   _CAN4IDAR3.Bits.AC6
#define CAN4IDAR3_AC7                   _CAN4IDAR3.Bits.AC7

