frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
#define CAN4IDAR3_AC0_MASK              1U
#define CAN4IDAR3_AC1_MASK              2U
#define CAN4IDAR3_AC2_MASK              4U
#define CAN4IDAR3_AC3_MASK              8U
#define CAN4IDAR3_AC4_MASK              16U
#define CAN4IDAR3_AC5_MASK              32U
#define CAN4IDAR3_AC6_MASK              64U
#define CAN4IDAR3_AC7_MASK              128U


/*** CAN4IDMR0 - MSCAN4 Identifier Mask Register 0; 0x00000294 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN4IDMR0STR;
extern volatile CAN4IDMR0STR _CAN4IDMR0 @(REG_BASE + 0x00000294UL);
#define CAN4IDMR0                       _CAN4IDMR0.Byte
#define CAN4IDMR0_AM0                   _CAN4IDMR0.Bits.AM0
#define CAN4IDMR0_AM1                   _CAN4IDMR0.Bits.AM1
#define CAN4IDMR0_AM2                   _CAN4IDMR0.Bits.AM2
#define CAN4IDMR0_AM3                   _CAN4IDMR0.Bits.AM3
#define CAN4IDMR0_AM4                   _CAN4IDMR0.Bits.AM4
#define CAN4IDMR0_AM5                   _CAN4IDMR0.Bits.AM5
#define CAN4IDMR0_AM6                   _CAN4IDMR0.Bits.AM6
#define CAN4IDMR0_AM7                   _CAN4IDMR0.Bits.AM7
/* CAN4IDMR_ARR: Access 4 CAN4IDMRx registers in an array */
#define CAN4IDMR_ARR                    ((volatile byte *) &CAN4IDMR0)

#define CAN4IDMR0_AM0_MASK              1U
#define CAN4IDMR0_AM1_MASK              2U
#define CAN4IDMR0_AM2_MASK              4U
#define CAN4IDMR0_AM3_MASK              8U
#define CAN4IDMR0_AM4_MASK              16U
#define CAN4IDMR0_AM5_MASK              32U
#define CAN4IDMR0_AM6_MASK              64U
#define CAN4IDMR0_AM7_MASK              128U


/*** CAN4IDMR1 - MSCAN4 Identifier Mask Register 1; 0x00000295 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN4IDMR1STR;
extern volatile CAN4IDMR1STR _CAN4IDMR1 @(REG_BASE + 0x00000295UL);
#define CAN4IDMR1                       _CAN4IDMR1.Byte
#define CAN4IDMR1_AM0                   _CAN4IDMR1.Bits.AM0
#define CAN4IDMR1_AM1                   _CAN4IDMR1.Bits.AM1
#define CAN4IDMR1_AM2                   _CAN4IDMR1.Bits.AM2
#define CAN4IDMR1_AM3                   _CAN4IDMR1.Bits.AM3
#define CAN4IDMR1_AM4                   _CAN4IDMR1.Bits.AM4
#define CAN4IDMR1_AM5                   _CAN4IDMR1.Bits.AM5
#define CAN4IDMR1_AM6                   _CAN4IDMR1.Bits.AM6
#define CAN4IDMR1_AM7                   _CAN4IDMR1.Bits.AM7

#define CAN4IDMR1_AM0_MASK              1U
#define CAN4IDMR1_AM1_MASK              2U
#define CAN4IDMR1_AM2_MASK              4U
#define CAN4IDMR1_AM3_MASK              8U
#define CAN4IDMR1_AM4_MASK              16U
#define CAN4IDMR1_AM5_MASK              32U
#define CAN4IDMR1_AM6_MASK              64U
#define CAN4IDMR1_AM7_MASK              128U


/*** CAN4IDMR2 - MSCAN4 Identifier Mask Register 2; 0x00000296 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN4IDMR2STR;
extern volatile CAN4IDMR2STR _CAN4IDMR2 @(REG_BASE + 0x00000296UL);
#define CAN4IDMR2                       _CAN4IDMR2.Byte
#define CAN4IDMR2_AM0                   _CAN4IDMR2.Bits.AM0
#define CAN4IDMR2_AM1                   _CAN4IDMR2.Bits.AM1
#define CAN4IDMR2_AM2                   _CAN4IDMR2.Bits.AM2
#define CAN4IDMR2_AM3                   _CAN4IDMR2.Bits.AM3
#define CAN4IDMR2_AM4                   _CAN4IDMR2.Bits.AM4
#define CAN4IDMR2_AM5                   _CAN4IDMR2.Bits.AM5
#define CAN4IDMR2_AM6                   _CAN4IDMR2.Bits.AM6
#define CAN4IDMR2_AM7                   _CAN4IDMR2.Bits.AM7

#define CAN4IDMR2_AM0_MASK              1U
#define CAN4IDMR2_AM1_MASK              2U
#define CAN4IDMR2_AM2_MASK              4U
#define CAN4IDMR2_AM3_MASK              8U
#define CAN4IDMR2_AM4_MASK              16U
#define CAN4IDMR2_AM5_MASK              32U
#define CAN4IDMR2_AM6_MASK              64U
#define CAN4IDMR2_AM7_MASK              128U


/*** CAN4IDMR3 - MSCAN4 Identifier Mask Register 3; 0x00000297 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN4IDMR3STR;
extern volatile CAN4IDMR3STR _CAN4IDMR3 @(REG_BASE + 0x00000297UL);
#define CAN4IDMR3                       _CAN4IDMR3.Byte
#define CAN4IDMR3_AM0                   _CAN4IDMR3.Bits.AM0
#define CAN4IDMR3_AM1                   _CAN4IDMR3.Bits.AM1
#define CAN4IDMR3_AM2                   _CAN4IDMR3.Bits.AM2
#define CAN4IDMR3_AM3                   _CAN4IDMR3.Bits.AM3
#define CAN4IDMR3_AM4                   _CAN4IDMR3.Bits.AM4
#define CAN4IDMR3_AM5                   _CAN4IDMR3.Bits.AM5
#define CAN4IDMR3_AM6                   _CAN4IDMR3.Bits.AM6
#define CAN4IDMR3_AM7                   _CAN4IDMR3.Bits.AM7

