frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
#define CAN4IDMR3_AM0_MASK              1U
#define CAN4IDMR3_AM1_MASK              2U
#define CAN4IDMR3_AM2_MASK              4U
#define CAN4IDMR3_AM3_MASK              8U
#define CAN4IDMR3_AM4_MASK              16U
#define CAN4IDMR3_AM5_MASK              32U
#define CAN4IDMR3_AM6_MASK              64U
#define CAN4IDMR3_AM7_MASK              128U


/*** CAN4IDAR4 - MSCAN4 Identifier Acceptance Register 4; 0x00000298 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN4IDAR4STR;
extern volatile CAN4IDAR4STR _CAN4IDAR4 @(REG_BASE + 0x00000298UL);
#define CAN4IDAR4                       _CAN4IDAR4.Byte
#define CAN4IDAR4_AC0                   _CAN4IDAR4.Bits.AC0
#define CAN4IDAR4_AC1                   _CAN4IDAR4.Bits.AC1
#define CAN4IDAR4_AC2                   _CAN4IDAR4.Bits.AC2
#define CAN4IDAR4_AC3                   _CAN4IDAR4.Bits.AC3
#define CAN4IDAR4_AC4                   _CAN4IDAR4.Bits.AC4
#define CAN4IDAR4_AC5                   _CAN4IDAR4.Bits.AC5
#define CAN4IDAR4_AC6                   _CAN4IDAR4.Bits.AC6
#define CAN4IDAR4_AC7                   _CAN4IDAR4.Bits.AC7

#define CAN4IDAR4_AC0_MASK              1U
#define CAN4IDAR4_AC1_MASK              2U
#define CAN4IDAR4_AC2_MASK              4U
#define CAN4IDAR4_AC3_MASK              8U
#define CAN4IDAR4_AC4_MASK              16U
#define CAN4IDAR4_AC5_MASK              32U
#define CAN4IDAR4_AC6_MASK              64U
#define CAN4IDAR4_AC7_MASK              128U


/*** CAN4IDAR5 - MSCAN4 Identifier Acceptance Register 5; 0x00000299 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN4IDAR5STR;
extern volatile CAN4IDAR5STR _CAN4IDAR5 @(REG_BASE + 0x00000299UL);
#define CAN4IDAR5                       _CAN4IDAR5.Byte
#define CAN4IDAR5_AC0                   _CAN4IDAR5.Bits.AC0
#define CAN4IDAR5_AC1                   _CAN4IDAR5.Bits.AC1
#define CAN4IDAR5_AC2                   _CAN4IDAR5.Bits.AC2
#define CAN4IDAR5_AC3                   _CAN4IDAR5.Bits.AC3
#define CAN4IDAR5_AC4                   _CAN4IDAR5.Bits.AC4
#define CAN4IDAR5_AC5                   _CAN4IDAR5.Bits.AC5
#define CAN4IDAR5_AC6                   _CAN4IDAR5.Bits.AC6
#define CAN4IDAR5_AC7                   _CAN4IDAR5.Bits.AC7

#define CAN4IDAR5_AC0_MASK              1U
#define CAN4IDAR5_AC1_MASK              2U
#define CAN4IDAR5_AC2_MASK              4U
#define CAN4IDAR5_AC3_MASK              8U
#define CAN4IDAR5_AC4_MASK              16U
#define CAN4IDAR5_AC5_MASK              32U
#define CAN4IDAR5_AC6_MASK              64U
#define CAN4IDAR5_AC7_MASK              128U


/*** CAN4IDAR6 - MSCAN4 Identifier Acceptance Register 6; 0x0000029A ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN4IDAR6STR;
extern volatile CAN4IDAR6STR _CAN4IDAR6 @(REG_BASE + 0x0000029AUL);
#define CAN4IDAR6                       _CAN4IDAR6.Byte
#define CAN4IDAR6_AC0                   _CAN4IDAR6.Bits.AC0
#define CAN4IDAR6_AC1                   _CAN4IDAR6.Bits.AC1
#define CAN4IDAR6_AC2                   _CAN4IDAR6.Bits.AC2
#define CAN4IDAR6_AC3                   _CAN4IDAR6.Bits.AC3
#define CAN4IDAR6_AC4                   _CAN4IDAR6.Bits.AC4
#define CAN4IDAR6_AC5                   _CAN4IDAR6.Bits.AC5
#define CAN4IDAR6_AC6                   _CAN4IDAR6.Bits.AC6
#define CAN4IDAR6_AC7                   _CAN4IDAR6.Bits.AC7

#define CAN4IDAR6_AC0_MASK              1U
#define CAN4IDAR6_AC1_MASK              2U
#define CAN4IDAR6_AC2_MASK              4U
#define CAN4IDAR6_AC3_MASK              8U
#define CAN4IDAR6_AC4_MASK              16U
#define CAN4IDAR6_AC5_MASK              32U
#define CAN4IDAR6_AC6_MASK              64U
#define CAN4IDAR6_AC7_MASK              128U


/*** CAN4IDAR7 - MSCAN4 Identifier Acceptance Register 7; 0x0000029B ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN4IDAR7STR;
extern volatile CAN4IDAR7STR _CAN4IDAR7 @(REG_BASE + 0x0000029BUL);
#define CAN4IDAR7                       _CAN4IDAR7.Byte
#define CAN4IDAR7_AC0                   _CAN4IDAR7.Bits.AC0
#define CAN4IDAR7_AC1                   _CAN4IDAR7.Bits.AC1
#define CAN4IDAR7_AC2                   _CAN4IDAR7.Bits.AC2
#define CAN4IDAR7_AC3                   _CAN4IDAR7.Bits.AC3
#define CAN4IDAR7_AC4                   _CAN4IDAR7.Bits.AC4
#define CAN4IDAR7_AC5                   _CAN4IDAR7.Bits.AC5
#define CAN4IDAR7_AC6                   _CAN4IDAR7.Bits.AC6
#define CAN4IDAR7_AC7                   _CAN4IDAR7.Bits.AC7

#define CAN4IDAR7_AC0_MASK              1U
#define CAN4IDAR7_AC1_MASK              2U
#define CAN4IDAR7_AC2_MASK              4U
#define CAN4IDAR7_AC3_MASK              8U
#define CAN4IDAR7_AC4_MASK              16U
#define CAN4IDAR7_AC5_MASK              32U
#define CAN4IDAR7_AC6_MASK              64U
#define CAN4IDAR7_AC7_MASK              128U


/*** CAN4IDMR4 - MSCAN4 Identifier Mask Register 4; 0x0000029C ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN4IDMR4STR;
extern volatile CAN4IDMR4STR _CAN4IDMR4 @(REG_BASE + 0x0000029CUL);
#define CAN4IDMR4                       _CAN4IDMR4.Byte
#define CAN4IDMR4_AM0                   _CAN4IDMR4.Bits.AM0
#define CAN4IDMR4_AM1                   _CAN4IDMR4.Bits.AM1
#define CAN4IDMR4_AM2                   _CAN4IDMR4.Bits.AM2
#define CAN4IDMR4_AM3                   _CAN4IDMR4.Bits.AM3
#define CAN4IDMR4_AM4                   _CAN4IDMR4.Bits.AM4
#define CAN4IDMR4_AM5                   _CAN4IDMR4.Bits.AM5
#define CAN4IDMR4_AM6                   _CAN4IDMR4.Bits.AM6
#define CAN4IDMR4_AM7                   _CAN4IDMR4.Bits.AM7

#define CAN4IDMR4_AM0_MASK              1U
#define CAN4IDMR4_AM1_MASK              2U
#define CAN4IDMR4_AM2_MASK              4U
#define CAN4IDMR4_AM3_MASK              8U
#define CAN4IDMR4_AM4_MASK              16U
#define CAN4IDMR4_AM5_MASK              32U
#define CAN4IDMR4_AM6_MASK              64U
#define CAN4IDMR4_AM7_MASK              128U


/*** CAN4IDMR5 - MSCAN4 Identifier Mask Register 5; 0x0000029D ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN4IDMR5STR;
