frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
  struct {
    word BIT0        :1;                                       /* Bit 0 */
    word BIT1        :1;                                       /* Bit 1 */
    word BIT2        :1;                                       /* Bit 2 */
    word BIT3        :1;                                       /* Bit 3 */
    word BIT4        :1;                                       /* Bit 4 */
    word BIT5        :1;                                       /* Bit 5 */
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
} ATD0DR12STR;
extern volatile ATD0DR12STR _ATD0DR12 @(REG_BASE + 0x000002E8UL);
#define ATD0DR12                        _ATD0DR12.Word
#define ATD0DR12_BIT0                   _ATD0DR12.Bits.BIT0
#define ATD0DR12_BIT1                   _ATD0DR12.Bits.BIT1
#define ATD0DR12_BIT2                   _ATD0DR12.Bits.BIT2
#define ATD0DR12_BIT3                   _ATD0DR12.Bits.BIT3
#define ATD0DR12_BIT4                   _ATD0DR12.Bits.BIT4
#define ATD0DR12_BIT5                   _ATD0DR12.Bits.BIT5
#define ATD0DR12_BIT6                   _ATD0DR12.Bits.BIT6
#define ATD0DR12_BIT7                   _ATD0DR12.Bits.BIT7
#define ATD0DR12_BIT8                   _ATD0DR12.Bits.BIT8
#define ATD0DR12_BIT9                   _ATD0DR12.Bits.BIT9
#define ATD0DR12_BIT10                  _ATD0DR12.Bits.BIT10
#define ATD0DR12_BIT11                  _ATD0DR12.Bits.BIT11
#define ATD0DR12_BIT12                  _ATD0DR12.Bits.BIT12
#define ATD0DR12_BIT13                  _ATD0DR12.Bits.BIT13
#define ATD0DR12_BIT14                  _ATD0DR12.Bits.BIT14
#define ATD0DR12_BIT15                  _ATD0DR12.Bits.BIT15

#define ATD0DR12_BIT0_MASK              1U
#define ATD0DR12_BIT1_MASK              2U
#define ATD0DR12_BIT2_MASK              4U
#define ATD0DR12_BIT3_MASK              8U
#define ATD0DR12_BIT4_MASK              16U
#define ATD0DR12_BIT5_MASK              32U
#define ATD0DR12_BIT6_MASK              64U
#define ATD0DR12_BIT7_MASK              128U
#define ATD0DR12_BIT8_MASK              256U
#define ATD0DR12_BIT9_MASK              512U
#define ATD0DR12_BIT10_MASK             1024U
#define ATD0DR12_BIT11_MASK             2048U
#define ATD0DR12_BIT12_MASK             4096U
#define ATD0DR12_BIT13_MASK             8192U
#define ATD0DR12_BIT14_MASK             16384U
#define ATD0DR12_BIT15_MASK             32768U


/*** ATD0DR13 - ATD 0 Conversion Result Register 13; 0x000002EA ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0DR13H - ATD 0 Conversion Result Register 13 High; 0x000002EA ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
    } ATD0DR13HSTR;
    #define ATD0DR13H                   _ATD0DR13.Overlap_STR.ATD0DR13HSTR.Byte
    #define ATD0DR13H_BIT8              _ATD0DR13.Overlap_STR.ATD0DR13HSTR.Bits.BIT8
    #define ATD0DR13H_BIT9              _ATD0DR13.Overlap_STR.ATD0DR13HSTR.Bits.BIT9
    #define ATD0DR13H_BIT10             _ATD0DR13.Overlap_STR.ATD0DR13HSTR.Bits.BIT10
    #define ATD0DR13H_BIT11             _ATD0DR13.Overlap_STR.ATD0DR13HSTR.Bits.BIT11
    #define ATD0DR13H_BIT12             _ATD0DR13.Overlap_STR.ATD0DR13HSTR.Bits.BIT12
    #define ATD0DR13H_BIT13             _ATD0DR13.Overlap_STR.ATD0DR13HSTR.Bits.BIT13
    #define ATD0DR13H_BIT14             _ATD0DR13.Overlap_STR.ATD0DR13HSTR.Bits.BIT14
    #define ATD0DR13H_BIT15             _ATD0DR13.Overlap_STR.ATD0DR13HSTR.Bits.BIT15
    
    #define ATD0DR13H_BIT8_MASK         1U
    #define ATD0DR13H_BIT9_MASK         2U
    #define ATD0DR13H_BIT10_MASK        4U
    #define ATD0DR13H_BIT11_MASK        8U
    #define ATD0DR13H_BIT12_MASK        16U
    #define ATD0DR13H_BIT13_MASK        32U
    #define ATD0DR13H_BIT14_MASK        64U
    #define ATD0DR13H_BIT15_MASK        128U
    

    /*** ATD0DR13L - ATD 0 Conversion Result Register 13 Low; 0x000002EB ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Bit 0 */
        byte BIT1        :1;                                       /* Bit 1 */
        byte BIT2        :1;                                       /* Bit 2 */
        byte BIT3        :1;                                       /* Bit 3 */
        byte BIT4        :1;                                       /* Bit 4 */
        byte BIT5        :1;                                       /* Bit 5 */
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
    } ATD0DR13LSTR;
    #define ATD0DR13L                   _ATD0DR13.Overlap_STR.ATD0DR13LSTR.Byte
    #define ATD0DR13L_BIT0              _ATD0DR13.Overlap_STR.ATD0DR13LSTR.Bits.BIT0
    #define ATD0DR13L_BIT1              _ATD0DR13.Overlap_STR.ATD0DR13LSTR.Bits.BIT1
    #define ATD0DR13L_BIT2              _ATD0DR13.Overlap_STR.ATD0DR13LSTR.Bits.BIT2
    #define ATD0DR13L_BIT3              _ATD0DR13.Overlap_STR.ATD0DR13LSTR.Bits.BIT3
    #define ATD0DR13L_BIT4              _ATD0DR13.Overlap_STR.ATD0DR13LSTR.Bits.BIT4
    #define ATD0DR13L_BIT5              _ATD0DR13.Overlap_STR.ATD0DR13LSTR.Bits.BIT5
    #define ATD0DR13L_BIT6              _ATD0DR13.Overlap_STR.ATD0DR13LSTR.Bits.BIT6
    #define ATD0DR13L_BIT7              _ATD0DR13.Overlap_STR.ATD0DR13LSTR.Bits.BIT7
    
    #define ATD0DR13L_BIT0_MASK         1U
    #define ATD0DR13L_BIT1_MASK         2U
    #define ATD0DR13L_BIT2_MASK         4U
    #define ATD0DR13L_BIT3_MASK         8U
    #define ATD0DR13L_BIT4_MASK         16U
    #define ATD0DR13L_BIT5_MASK         32U
    #define ATD0DR13L_BIT6_MASK         64U
    #define ATD0DR13L_BIT7_MASK         128U
    
  } Overlap_STR;

