frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
  struct {
    word BIT0        :1;                                       /* Bit 0 */
    word BIT1        :1;                                       /* Bit 1 */
    word BIT2        :1;                                       /* Bit 2 */
    word BIT3        :1;                                       /* Bit 3 */
    word BIT4        :1;                                       /* Bit 4 */
    word BIT5        :1;                                       /* Bit 5 */
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
} ATD0DR14STR;
extern volatile ATD0DR14STR _ATD0DR14 @(REG_BASE + 0x000002ECUL);
#define ATD0DR14                        _ATD0DR14.Word
#define ATD0DR14_BIT0                   _ATD0DR14.Bits.BIT0
#define ATD0DR14_BIT1                   _ATD0DR14.Bits.BIT1
#define ATD0DR14_BIT2                   _ATD0DR14.Bits.BIT2
#define ATD0DR14_BIT3                   _ATD0DR14.Bits.BIT3
#define ATD0DR14_BIT4                   _ATD0DR14.Bits.BIT4
#define ATD0DR14_BIT5                   _ATD0DR14.Bits.BIT5
#define ATD0DR14_BIT6                   _ATD0DR14.Bits.BIT6
#define ATD0DR14_BIT7                   _ATD0DR14.Bits.BIT7
#define ATD0DR14_BIT8                   _ATD0DR14.Bits.BIT8
#define ATD0DR14_BIT9                   _ATD0DR14.Bits.BIT9
#define ATD0DR14_BIT10                  _ATD0DR14.Bits.BIT10
#define ATD0DR14_BIT11                  _ATD0DR14.Bits.BIT11
#define ATD0DR14_BIT12                  _ATD0DR14.Bits.BIT12
#define ATD0DR14_BIT13                  _ATD0DR14.Bits.BIT13
#define ATD0DR14_BIT14                  _ATD0DR14.Bits.BIT14
#define ATD0DR14_BIT15                  _ATD0DR14.Bits.BIT15

#define ATD0DR14_BIT0_MASK              1U
#define ATD0DR14_BIT1_MASK              2U
#define ATD0DR14_BIT2_MASK              4U
#define ATD0DR14_BIT3_MASK              8U
#define ATD0DR14_BIT4_MASK              16U
#define ATD0DR14_BIT5_MASK              32U
#define ATD0DR14_BIT6_MASK              64U
#define ATD0DR14_BIT7_MASK              128U
#define ATD0DR14_BIT8_MASK              256U
#define ATD0DR14_BIT9_MASK              512U
#define ATD0DR14_BIT10_MASK             1024U
#define ATD0DR14_BIT11_MASK             2048U
#define ATD0DR14_BIT12_MASK             4096U
#define ATD0DR14_BIT13_MASK             8192U
#define ATD0DR14_BIT14_MASK             16384U
#define ATD0DR14_BIT15_MASK             32768U


/*** ATD0DR15 - ATD 0 Conversion Result Register 15; 0x000002EE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0DR15H - ATD 0 Conversion Result Register 15 High; 0x000002EE ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
    } ATD0DR15HSTR;
    #define ATD0DR15H                   _ATD0DR15.Overlap_STR.ATD0DR15HSTR.Byte
    #define ATD0DR15H_BIT8              _ATD0DR15.Overlap_STR.ATD0DR15HSTR.Bits.BIT8
    #define ATD0DR15H_BIT9              _ATD0DR15.Overlap_STR.ATD0DR15HSTR.Bits.BIT9
    #define ATD0DR15H_BIT10             _ATD0DR15.Overlap_STR.ATD0DR15HSTR.Bits.BIT10
    #define ATD0DR15H_BIT11             _ATD0DR15.Overlap_STR.ATD0DR15HSTR.Bits.BIT11
    #define ATD0DR15H_BIT12             _ATD0DR15.Overlap_STR.ATD0DR15HSTR.Bits.BIT12
    #define ATD0DR15H_BIT13             _ATD0DR15.Overlap_STR.ATD0DR15HSTR.Bits.BIT13
    #define ATD0DR15H_BIT14             _ATD0DR15.Overlap_STR.ATD0DR15HSTR.Bits.BIT14
    #define ATD0DR15H_BIT15             _ATD0DR15.Overlap_STR.ATD0DR15HSTR.Bits.BIT15
    
    #define ATD0DR15H_BIT8_MASK         1U
    #define ATD0DR15H_BIT9_MASK         2U
    #define ATD0DR15H_BIT10_MASK        4U
    #define ATD0DR15H_BIT11_MASK        8U
    #define ATD0DR15H_BIT12_MASK        16U
    #define ATD0DR15H_BIT13_MASK        32U
    #define ATD0DR15H_BIT14_MASK        64U
    #define ATD0DR15H_BIT15_MASK        128U
    

    /*** ATD0DR15L - ATD 0 Conversion Result Register 15 Low; 0x000002EF ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Bit 0 */
        byte BIT1        :1;                                       /* Bit 1 */
        byte BIT2        :1;                                       /* Bit 2 */
        byte BIT3        :1;                                       /* Bit 3 */
        byte BIT4        :1;                                       /* Bit 4 */
        byte BIT5        :1;                                       /* Bit 5 */
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
    } ATD0DR15LSTR;
    #define ATD0DR15L                   _ATD0DR15.Overlap_STR.ATD0DR15LSTR.Byte
    #define ATD0DR15L_BIT0              _ATD0DR15.Overlap_STR.ATD0DR15LSTR.Bits.BIT0
    #define ATD0DR15L_BIT1              _ATD0DR15.Overlap_STR.ATD0DR15LSTR.Bits.BIT1
    #define ATD0DR15L_BIT2              _ATD0DR15.Overlap_STR.ATD0DR15LSTR.Bits.BIT2
    #define ATD0DR15L_BIT3              _ATD0DR15.Overlap_STR.ATD0DR15LSTR.Bits.BIT3
    #define ATD0DR15L_BIT4              _ATD0DR15.Overlap_STR.ATD0DR15LSTR.Bits.BIT4
    #define ATD0DR15L_BIT5              _ATD0DR15.Overlap_STR.ATD0DR15LSTR.Bits.BIT5
    #define ATD0DR15L_BIT6              _ATD0DR15.Overlap_STR.ATD0DR15LSTR.Bits.BIT6
    #define ATD0DR15L_BIT7              _ATD0DR15.Overlap_STR.ATD0DR15LSTR.Bits.BIT7
    
    #define ATD0DR15L_BIT0_MASK         1U
    #define ATD0DR15L_BIT1_MASK         2U
    #define ATD0DR15L_BIT2_MASK         4U
    #define ATD0DR15L_BIT3_MASK         8U
    #define ATD0DR15L_BIT4_MASK         16U
    #define ATD0DR15L_BIT5_MASK         32U
    #define ATD0DR15L_BIT6_MASK         64U
    #define ATD0DR15L_BIT7_MASK         128U
    
  } Overlap_STR;

