frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
extern volatile PTRRRSTR _PTRRR @(REG_BASE + 0x0000036FUL);
#define PTRRR                           _PTRRR.Byte
#define PTRRR_PTRRR0                    _PTRRR.Bits.PTRRR0
#define PTRRR_PTRRR1                    _PTRRR.Bits.PTRRR1
#define PTRRR_PTRRR2                    _PTRRR.Bits.PTRRR2
#define PTRRR_PTRRR3                    _PTRRR.Bits.PTRRR3
#define PTRRR_PTRRR4                    _PTRRR.Bits.PTRRR4
#define PTRRR_PTRRR5                    _PTRRR.Bits.PTRRR5
#define PTRRR_PTRRR6                    _PTRRR.Bits.PTRRR6
#define PTRRR_PTRRR7                    _PTRRR.Bits.PTRRR7

#define PTRRR_PTRRR0_MASK               1U
#define PTRRR_PTRRR1_MASK               2U
#define PTRRR_PTRRR2_MASK               4U
#define PTRRR_PTRRR3_MASK               8U
#define PTRRR_PTRRR4_MASK               16U
#define PTRRR_PTRRR5_MASK               32U
#define PTRRR_PTRRR6_MASK               64U
#define PTRRR_PTRRR7_MASK               128U


/*** PTL - Port L Data Register; 0x00000370 ***/
typedef union {
  byte Byte;
  struct {
    byte PTL0        :1;                                       /* Port L general purpose input/output data bit 0 */
    byte PTL1        :1;                                       /* Port L general purpose input/output data bit 1 */
    byte PTL2        :1;                                       /* Port L general purpose input/output data bit 2 */
    byte PTL3        :1;                                       /* Port L general purpose input/output data bit 3 */
    byte PTL4        :1;                                       /* Port L general purpose input/output data bit 4 */
    byte PTL5        :1;                                       /* Port L general purpose input/output data bit 5 */
    byte PTL6        :1;                                       /* Port L general purpose input/output data bit 6 */
    byte PTL7        :1;                                       /* Port L general purpose input/output data bit 7 */
  } Bits;
} PTLSTR;
extern volatile PTLSTR _PTL @(REG_BASE + 0x00000370UL);
#define PTL                             _PTL.Byte
#define PTL_PTL0                        _PTL.Bits.PTL0
#define PTL_PTL1                        _PTL.Bits.PTL1
#define PTL_PTL2                        _PTL.Bits.PTL2
#define PTL_PTL3                        _PTL.Bits.PTL3
#define PTL_PTL4                        _PTL.Bits.PTL4
#define PTL_PTL5                        _PTL.Bits.PTL5
#define PTL_PTL6                        _PTL.Bits.PTL6
#define PTL_PTL7                        _PTL.Bits.PTL7

#define PTL_PTL0_MASK                   1U
#define PTL_PTL1_MASK                   2U
#define PTL_PTL2_MASK                   4U
#define PTL_PTL3_MASK                   8U
#define PTL_PTL4_MASK                   16U
#define PTL_PTL5_MASK                   32U
#define PTL_PTL6_MASK                   64U
#define PTL_PTL7_MASK                   128U


/*** PTIL - Port L Input Register; 0x00000371 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIL0       :1;                                       /* Port L input data bit 0 */
    byte PTIL1       :1;                                       /* Port L input data bit 1 */
    byte PTIL2       :1;                                       /* Port L input data bit 2 */
    byte PTIL3       :1;                                       /* Port L input data bit 3 */
    byte PTIL4       :1;                                       /* Port L input data bit 4 */
    byte PTIL5       :1;                                       /* Port L input data bit 5 */
    byte PTIL6       :1;                                       /* Port L input data bit 6 */
    byte PTIL7       :1;                                       /* Port L input data bit 7 */
  } Bits;
} PTILSTR;
extern volatile PTILSTR _PTIL @(REG_BASE + 0x00000371UL);
#define PTIL                            _PTIL.Byte
#define PTIL_PTIL0                      _PTIL.Bits.PTIL0
#define PTIL_PTIL1                      _PTIL.Bits.PTIL1
#define PTIL_PTIL2                      _PTIL.Bits.PTIL2
#define PTIL_PTIL3                      _PTIL.Bits.PTIL3
#define PTIL_PTIL4                      _PTIL.Bits.PTIL4
#define PTIL_PTIL5                      _PTIL.Bits.PTIL5
#define PTIL_PTIL6                      _PTIL.Bits.PTIL6
#define PTIL_PTIL7                      _PTIL.Bits.PTIL7

#define PTIL_PTIL0_MASK                 1U
#define PTIL_PTIL1_MASK                 2U
#define PTIL_PTIL2_MASK                 4U
#define PTIL_PTIL3_MASK                 8U
#define PTIL_PTIL4_MASK                 16U
#define PTIL_PTIL5_MASK                 32U
#define PTIL_PTIL6_MASK                 64U
#define PTIL_PTIL7_MASK                 128U


/*** DDRL - Port L Data Direction Register; 0x00000372 ***/
typedef union {
  byte Byte;
  struct {
    byte DDRL0       :1;                                       /* Port L data direction bit 0 */
    byte DDRL1       :1;                                       /* Port L data direction bit 1 */
    byte DDRL2       :1;                                       /* Port L data direction bit 2 */
    byte DDRL3       :1;                                       /* Port L data direction bit 3 */
    byte DDRL4       :1;                                       /* Port L data direction bit 4 */
    byte DDRL5       :1;                                       /* Port L data direction bit 5 */
    byte DDRL6       :1;                                       /* Port L data direction bit 6 */
    byte DDRL7       :1;                                       /* Port L data direction bit 7 */
  } Bits;
} DDRLSTR;
extern volatile DDRLSTR _DDRL @(REG_BASE + 0x00000372UL);
#define DDRL                            _DDRL.Byte
#define DDRL_DDRL0                      _DDRL.Bits.DDRL0
#define DDRL_DDRL1                      _DDRL.Bits.DDRL1
#define DDRL_DDRL2                      _DDRL.Bits.DDRL2
#define DDRL_DDRL3                      _DDRL.Bits.DDRL3
#define DDRL_DDRL4                      _DDRL.Bits.DDRL4
#define DDRL_DDRL5                      _DDRL.Bits.DDRL5
#define DDRL_DDRL6                      _DDRL.Bits.DDRL6
#define DDRL_DDRL7                      _DDRL.Bits.DDRL7

