frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
/*** PTIF - Port F Input Register; 0x00000379 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIF0       :1;                                       /* Port F input data bit 0 */
    byte PTIF1       :1;                                       /* Port F input data bit 1 */
    byte PTIF2       :1;                                       /* Port F input data bit 2 */
    byte PTIF3       :1;                                       /* Port F input data bit 3 */
    byte PTIF4       :1;                                       /* Port F input data bit 4 */
    byte PTIF5       :1;                                       /* Port F input data bit 5 */
    byte PTIF6       :1;                                       /* Port F input data bit 6 */
    byte PTIF7       :1;                                       /* Port F input data bit 7 */
  } Bits;
} PTIFSTR;
extern volatile PTIFSTR _PTIF @(REG_BASE + 0x00000379UL);
#define PTIF                            _PTIF.Byte
#define PTIF_PTIF0                      _PTIF.Bits.PTIF0
#define PTIF_PTIF1                      _PTIF.Bits.PTIF1
#define PTIF_PTIF2                      _PTIF.Bits.PTIF2
#define PTIF_PTIF3                      _PTIF.Bits.PTIF3
#define PTIF_PTIF4                      _PTIF.Bits.PTIF4
#define PTIF_PTIF5                      _PTIF.Bits.PTIF5
#define PTIF_PTIF6                      _PTIF.Bits.PTIF6
#define PTIF_PTIF7                      _PTIF.Bits.PTIF7

#define PTIF_PTIF0_MASK                 1U
#define PTIF_PTIF1_MASK                 2U
#define PTIF_PTIF2_MASK                 4U
#define PTIF_PTIF3_MASK                 8U
#define PTIF_PTIF4_MASK                 16U
#define PTIF_PTIF5_MASK                 32U
#define PTIF_PTIF6_MASK                 64U
#define PTIF_PTIF7_MASK                 128U


/*** DDRF - Port F Data Direction Register; 0x0000037A ***/
typedef union {
  byte Byte;
  struct {
    byte DDRF0       :1;                                       /* Port F data direction bit 0 */
    byte DDRF1       :1;                                       /* Port F data direction bit 1 */
    byte DDRF2       :1;                                       /* Port F data direction bit 2 */
    byte DDRF3       :1;                                       /* Port F data direction bit 3 */
    byte DDRF4       :1;                                       /* Port F data direction bit 4 */
    byte DDRF5       :1;                                       /* Port F data direction bit 5 */
    byte DDRF6       :1;                                       /* Port F data direction bit 6 */
    byte DDRF7       :1;                                       /* Port F data direction bit 7 */
  } Bits;
} DDRFSTR;
extern volatile DDRFSTR _DDRF @(REG_BASE + 0x0000037AUL);
#define DDRF                            _DDRF.Byte
#define DDRF_DDRF0                      _DDRF.Bits.DDRF0
#define DDRF_DDRF1                      _DDRF.Bits.DDRF1
#define DDRF_DDRF2                      _DDRF.Bits.DDRF2
#define DDRF_DDRF3                      _DDRF.Bits.DDRF3
#define DDRF_DDRF4                      _DDRF.Bits.DDRF4
#define DDRF_DDRF5                      _DDRF.Bits.DDRF5
#define DDRF_DDRF6                      _DDRF.Bits.DDRF6
#define DDRF_DDRF7                      _DDRF.Bits.DDRF7

#define DDRF_DDRF0_MASK                 1U
#define DDRF_DDRF1_MASK                 2U
#define DDRF_DDRF2_MASK                 4U
#define DDRF_DDRF3_MASK                 8U
#define DDRF_DDRF4_MASK                 16U
#define DDRF_DDRF5_MASK                 32U
#define DDRF_DDRF6_MASK                 64U
#define DDRF_DDRF7_MASK                 128U


/*** RDRF - Port F Reduced Drive Register; 0x0000037B ***/
typedef union {
  byte Byte;
  struct {
    byte RDRF0       :1;                                       /* Port F reduced drive bit 0 */
    byte RDRF1       :1;                                       /* Port F reduced drive bit 1 */
    byte RDRF2       :1;                                       /* Port F reduced drive bit 2 */
    byte RDRF3       :1;                                       /* Port F reduced drive bit 3 */
    byte RDRF4       :1;                                       /* Port F reduced drive bit 4 */
    byte RDRF5       :1;                                       /* Port F reduced drive bit 5 */
    byte RDRF6       :1;                                       /* Port F reduced drive bit 6 */
    byte RDRF7       :1;                                       /* Port F reduced drive bit 7 */
  } Bits;
} RDRFSTR;
extern volatile RDRFSTR _RDRF @(REG_BASE + 0x0000037BUL);
#define RDRF                            _RDRF.Byte
#define RDRF_RDRF0                      _RDRF.Bits.RDRF0
#define RDRF_RDRF1                      _RDRF.Bits.RDRF1
#define RDRF_RDRF2                      _RDRF.Bits.RDRF2
#define RDRF_RDRF3                      _RDRF.Bits.RDRF3
#define RDRF_RDRF4                      _RDRF.Bits.RDRF4
#define RDRF_RDRF5                      _RDRF.Bits.RDRF5
#define RDRF_RDRF6                      _RDRF.Bits.RDRF6
#define RDRF_RDRF7                      _RDRF.Bits.RDRF7

#define RDRF_RDRF0_MASK                 1U
#define RDRF_RDRF1_MASK                 2U
#define RDRF_RDRF2_MASK                 4U
#define RDRF_RDRF3_MASK                 8U
#define RDRF_RDRF4_MASK                 16U
#define RDRF_RDRF5_MASK                 32U
#define RDRF_RDRF6_MASK                 64U
#define RDRF_RDRF7_MASK                 128U


/*** PERF - Port F Pull Device Enable Register; 0x0000037C ***/
typedef union {
  byte Byte;
  struct {
    byte PERF0       :1;                                       /* Port F pull device enable bit 0 */
    byte PERF1       :1;                                       /* Port F pull device enable bit 1 */
    byte PERF2       :1;                                       /* Port F pull device enable bit 2 */
    byte PERF3       :1;                                       /* Port F pull device enable bit 3 */
    byte PERF4       :1;                                       /* Port F pull device enable bit 4 */
    byte PERF5       :1;                                       /* Port F pull device enable bit 5 */
    byte PERF6       :1;                                       /* Port F pull device enable bit 6 */
    byte PERF7       :1;                                       /* Port F pull device enable bit 7 */
  } Bits;
} PERFSTR;
extern volatile PERFSTR _PERF @(REG_BASE + 0x0000037CUL);
#define PERF                            _PERF.Byte
#define PERF_PERF0                      _PERF.Bits.PERF0
#define PERF_PERF1                      _PERF.Bits.PERF1
#define PERF_PERF2                      _PERF.Bits.PERF2
#define PERF_PERF3                      _PERF.Bits.PERF3
#define PERF_PERF4                      _PERF.Bits.PERF4
#define PERF_PERF5                      _PERF.Bits.PERF5
#define PERF_PERF6                      _PERF.Bits.PERF6
#define PERF_PERF7                      _PERF.Bits.PERF7

