frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
#define PERF_PERF0_MASK                 1U
#define PERF_PERF1_MASK                 2U
#define PERF_PERF2_MASK                 4U
#define PERF_PERF3_MASK                 8U
#define PERF_PERF4_MASK                 16U
#define PERF_PERF5_MASK                 32U
#define PERF_PERF6_MASK                 64U
#define PERF_PERF7_MASK                 128U


/*** PPSF - Port F Polarity Select Register; 0x0000037D ***/
typedef union {
  byte Byte;
  struct {
    byte PPSF0       :1;                                       /* Port F pull device select bit 0 */
    byte PPSF1       :1;                                       /* Port F pull device select bit 1 */
    byte PPSF2       :1;                                       /* Port F pull device select bit 2 */
    byte PPSF3       :1;                                       /* Port F pull device select bit 3 */
    byte PPSF4       :1;                                       /* Port F pull device select bit 4 */
    byte PPSF5       :1;                                       /* Port F pull device select bit 5 */
    byte PPSF6       :1;                                       /* Port F pull device select bit 6 */
    byte PPSF7       :1;                                       /* Port F pull device select bit 7 */
  } Bits;
} PPSFSTR;
extern volatile PPSFSTR _PPSF @(REG_BASE + 0x0000037DUL);
#define PPSF                            _PPSF.Byte
#define PPSF_PPSF0                      _PPSF.Bits.PPSF0
#define PPSF_PPSF1                      _PPSF.Bits.PPSF1
#define PPSF_PPSF2                      _PPSF.Bits.PPSF2
#define PPSF_PPSF3                      _PPSF.Bits.PPSF3
#define PPSF_PPSF4                      _PPSF.Bits.PPSF4
#define PPSF_PPSF5                      _PPSF.Bits.PPSF5
#define PPSF_PPSF6                      _PPSF.Bits.PPSF6
#define PPSF_PPSF7                      _PPSF.Bits.PPSF7

#define PPSF_PPSF0_MASK                 1U
#define PPSF_PPSF1_MASK                 2U
#define PPSF_PPSF2_MASK                 4U
#define PPSF_PPSF3_MASK                 8U
#define PPSF_PPSF4_MASK                 16U
#define PPSF_PPSF5_MASK                 32U
#define PPSF_PPSF6_MASK                 64U
#define PPSF_PPSF7_MASK                 128U


/*** PTFRR - Port F Routing Register; 0x0000037F ***/
typedef union {
  byte Byte;
  struct {
    byte PTFRR0      :1;                                       /* Port F  routing */
    byte PTFRR1      :1;                                       /* Port F  routing */
    byte PTFRR2      :1;                                       /* Port F  routing */
    byte PTFRR3      :1;                                       /* Port F  routing */
    byte PTFRR4      :1;                                       /* Port F  routing */
    byte PTFRR5      :1;                                       /* Port F  routing */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTFRR :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTFRRSTR;
extern volatile PTFRRSTR _PTFRR @(REG_BASE + 0x0000037FUL);
#define PTFRR                           _PTFRR.Byte
#define PTFRR_PTFRR0                    _PTFRR.Bits.PTFRR0
#define PTFRR_PTFRR1                    _PTFRR.Bits.PTFRR1
#define PTFRR_PTFRR2                    _PTFRR.Bits.PTFRR2
#define PTFRR_PTFRR3                    _PTFRR.Bits.PTFRR3
#define PTFRR_PTFRR4                    _PTFRR.Bits.PTFRR4
#define PTFRR_PTFRR5                    _PTFRR.Bits.PTFRR5
#define PTFRR_PTFRR                     _PTFRR.MergedBits.grpPTFRR

#define PTFRR_PTFRR0_MASK               1U
#define PTFRR_PTFRR1_MASK               2U
#define PTFRR_PTFRR2_MASK               4U
#define PTFRR_PTFRR3_MASK               8U
#define PTFRR_PTFRR4_MASK               16U
#define PTFRR_PTFRR5_MASK               32U
#define PTFRR_PTFRR_MASK                63U
#define PTFRR_PTFRR_BITNUM              0U


/*** XGMCTL - XGATE Control Register; 0x00000380 ***/
typedef union {
  word Word;
  struct {
    word XGIE        :1;                                       /* XGATE Interrupt Enable */
    word XGSWEF      :1;                                       /* XGATE Software Error Flag */
    word             :1; 
    word XGFACT      :1;                                       /* Fake XGATE Activity */
    word XGSS        :1;                                       /* XGATE Single Step */
    word XGDBG       :1;                                       /* XGATE Debug Mode */
    word XGFRZ       :1;                                       /* Halt XGATE in Freeze Mode */
    word XGE         :1;                                       /* XGATE Module Enable */
    word XGIEM       :1;                                       /* XGIE Mask */
    word XGSWEFM     :1;                                       /* XGSWEF Mask */
    word             :1; 
    word XGFACTM     :1;                                       /* XGFACT Mask */
    word XGSSM       :1;                                       /* XGSS Mask */
    word XGDBGM      :1;                                       /* XGDBG Mask */
    word XGFRZM      :1;                                       /* XGFRZ Mask */
    word XGEM        :1;                                       /* XGE Mask */
  } Bits;
} XGMCTLSTR;
extern volatile XGMCTLSTR _XGMCTL @(REG_BASE + 0x00000380UL);
#define XGMCTL                          _XGMCTL.Word
#define XGMCTL_XGIE                     _XGMCTL.Bits.XGIE
#define XGMCTL_XGSWEF                   _XGMCTL.Bits.XGSWEF
#define XGMCTL_XGFACT                   _XGMCTL.Bits.XGFACT
#define XGMCTL_XGSS                     _XGMCTL.Bits.XGSS
#define XGMCTL_XGDBG                    _XGMCTL.Bits.XGDBG
#define XGMCTL_XGFRZ                    _XGMCTL.Bits.XGFRZ
#define XGMCTL_XGE                      _XGMCTL.Bits.XGE
#define XGMCTL_XGIEM                    _XGMCTL.Bits.XGIEM
#define XGMCTL_XGSWEFM                  _XGMCTL.Bits.XGSWEFM
#define XGMCTL_XGFACTM                  _XGMCTL.Bits.XGFACTM
#define XGMCTL_XGSSM                    _XGMCTL.Bits.XGSSM
#define XGMCTL_XGDBGM                   _XGMCTL.Bits.XGDBGM
#define XGMCTL_XGFRZM                   _XGMCTL.Bits.XGFRZM
#define XGMCTL_XGEM                     _XGMCTL.Bits.XGEM

#define XGMCTL_XGIE_MASK                1U
#define XGMCTL_XGSWEF_MASK              2U
#define XGMCTL_XGFACT_MASK              8U
#define XGMCTL_XGSS_MASK                16U
#define XGMCTL_XGDBG_MASK               32U
#define XGMCTL_XGFRZ_MASK               64U
#define XGMCTL_XGE_MASK                 128U
#define XGMCTL_XGIEM_MASK               256U
#define XGMCTL_XGSWEFM_MASK             512U
#define XGMCTL_XGFACTM_MASK             2048U
#define XGMCTL_XGSSM_MASK               4096U
#define XGMCTL_XGDBGM_MASK              8192U
#define XGMCTL_XGFRZM_MASK              16384U
#define XGMCTL_XGEM_MASK                32768U


