frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
/*** XGCHID - XGATE Channel ID Register; 0x00000382 ***/
typedef union {
  byte Byte;
  struct {
    byte XGCHID_grp  :7;                                       /* Request Identifier */ /*Warning: group name is duplicated with register name*/
    byte             :1; 
  } Bits;
} XGCHIDSTR;
extern volatile XGCHIDSTR _XGCHID @(REG_BASE + 0x00000382UL);
#define XGCHID                          _XGCHID.Byte
#define XGCHID_XGCHID                   _XGCHID.Bits.XGCHID_grp

#define XGCHID_XGCHID_MASK              127U
#define XGCHID_XGCHID_BITNUM            0U


/*** XGCHPL - XGATE Channel Priority Level; 0x00000383 ***/
typedef union {
  byte Byte;
  struct {
    byte XGCHPL_grp  :3;                                       /* Priority Level Bits */ /*Warning: group name is duplicated with register name*/
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} XGCHPLSTR;
extern volatile XGCHPLSTR _XGCHPL @(REG_BASE + 0x00000383UL);
#define XGCHPL                          _XGCHPL.Byte
#define XGCHPL_XGCHPL                   _XGCHPL.Bits.XGCHPL_grp

#define XGCHPL_XGCHPL_MASK              7U
#define XGCHPL_XGCHPL_BITNUM            0U


/*** XGISPSEL - XGATE Initial Stack Pointer Select Register; 0x00000385 ***/
typedef union {
  byte Byte;
  struct {
    byte XGISPSEL_grp :2;                                      /* Register select bits */ /*Warning: group name is duplicated with register name*/
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} XGISPSELSTR;
extern volatile XGISPSELSTR _XGISPSEL @(REG_BASE + 0x00000385UL);
#define XGISPSEL                        _XGISPSEL.Byte
#define XGISPSEL_XGISPSEL               _XGISPSEL.Bits.XGISPSEL_grp

#define XGISPSEL_XGISPSEL_MASK          3U
#define XGISPSEL_XGISPSEL_BITNUM        0U


/*** XGISP31 - XGATE Initial Stack Pointer for Interrupt Priorities 3 to 1; 0x00000386 ***/
typedef union {
  word Word;
  union { /* Several registers at the same address */
    /*** XGISP31 - XGATE Initial Stack Pointer for Interrupt Priorities 3 to 1; Several registers at the same address ***/
    union {
      struct {
        word             :1; 
        word XGISP31_grp :15;                                      /* Initial Stack Pointer */ /*Warning: group name is duplicated with register name*/
      } Bits;
    } XGISP31STR;
    #define XGISP31                     _XGISP31.Word
    #define XGISP31_XGISP31             _XGISP31.SameAddr_STR.XGISP31STR.Bits.XGISP31_grp
    
    #define XGISP31_XGISP31_MASK        65534U
    #define XGISP31_XGISP31_BITNUM      1U
    
    /*** XGISP74 - XGATE Initial Stack Pointer for Interrupt Priorities 7 to 4; Several registers at the same address ***/
    union {
      struct {
        word             :1; 
        word XGISP74_grp :15;                                      /* Initial Stack Pointer */ /*Warning: group name is duplicated with register name*/
      } Bits;
    } XGISP74STR;
    #define XGISP74                     _XGISP31.Word
    #define XGISP74_XGISP74             _XGISP31.SameAddr_STR.XGISP74STR.Bits.XGISP74_grp
    
    #define XGISP74_XGISP74_MASK        65534U
    #define XGISP74_XGISP74_BITNUM      1U
    
    /*** XGVBR - XGATE Control Register; Several registers at the same address ***/
    union {
      struct {
        word             :1; 
        word XGVBR_grp   :15;                                      /* Vector Base Address */ /*Warning: group name is duplicated with register name*/
      } Bits;
    } XGVBRSTR;
    #define XGVBR                       _XGISP31.Word
    #define XGVBR_XGVBR                 _XGISP31.SameAddr_STR.XGVBRSTR.Bits.XGVBR_grp
    
    #define XGVBR_XGVBR_MASK            65534U
    #define XGVBR_XGVBR_BITNUM          1U
    
  } SameAddr_STR; /*Several registers at the same address */

} XGISP31STR;
extern volatile XGISP31STR _XGISP31 @(REG_BASE + 0x00000386UL);


/*** XGIF_7F_70 - XGATE Channel Interrupt Flag Vector; 0x00000388 ***/
typedef union {
  word Word;
  struct {
    word XGIF_70     :1;                                       /* Channel Interrupt Flags, bit 112 */
    word XGIF_71     :1;                                       /* Channel Interrupt Flags, bit 113 */
    word XGIF_72     :1;                                       /* Channel Interrupt Flags, bit 114 */
    word XGIF_73     :1;                                       /* Channel Interrupt Flags, bit 115 */
    word XGIF_74     :1;                                       /* Channel Interrupt Flags, bit 116 */
    word XGIF_75     :1;                                       /* Channel Interrupt Flags, bit 117 */
    word XGIF_76     :1;                                       /* Channel Interrupt Flags, bit 118 */
    word XGIF_77     :1;                                       /* Channel Interrupt Flags, bit 119 */
    word XGIF_78     :1;                                       /* Channel Interrupt Flags, bit 120 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpXGIF__70 :9;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF_7F_70STR;
extern volatile XGIF_7F_70STR _XGIF_7F_70 @(REG_BASE + 0x00000388UL);
#define XGIF_7F_70                      _XGIF_7F_70.Word
#define XGIF_7F_70_XGIF_70              _XGIF_7F_70.Bits.XGIF_70
#define XGIF_7F_70_XGIF_71              _XGIF_7F_70.Bits.XGIF_71
#define XGIF_7F_70_XGIF_72              _XGIF_7F_70.Bits.XGIF_72
#define XGIF_7F_70_XGIF_73              _XGIF_7F_70.Bits.XGIF_73
#define XGIF_7F_70_XGIF_74              _XGIF_7F_70.Bits.XGIF_74
#define XGIF_7F_70_XGIF_75              _XGIF_7F_70.Bits.XGIF_75
#define XGIF_7F_70_XGIF_76              _XGIF_7F_70.Bits.XGIF_76
#define XGIF_7F_70_XGIF_77              _XGIF_7F_70.Bits.XGIF_77
#define XGIF_7F_70_XGIF_78              _XGIF_7F_70.Bits.XGIF_78
#define XGIF_7F_70_XGIF__70             _XGIF_7F_70.MergedBits.grpXGIF__70
#define XGIF_7F_70_XGIF_                XGIF_7F_70_XGIF__70

#define XGIF_7F_70_XGIF_70_MASK         1U
#define XGIF_7F_70_XGIF_71_MASK         2U
#define XGIF_7F_70_XGIF_72_MASK         4U
#define XGIF_7F_70_XGIF_73_MASK         8U
#define XGIF_7F_70_XGIF_74_MASK         16U
#define XGIF_7F_70_XGIF_75_MASK         32U
#define XGIF_7F_70_XGIF_76_MASK         64U
#define XGIF_7F_70_XGIF_77_MASK         128U
#define XGIF_7F_70_XGIF_78_MASK         256U
#define XGIF_7F_70_XGIF__70_MASK        511U
#define XGIF_7F_70_XGIF__70_BITNUM      0U


