frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
/*** XGIF_1F_10 - XGATE Channel Interrupt Flag Vector; 0x00000394 ***/
typedef union {
  word Word;
  struct {
    word XGIF_10     :1;                                       /* Channel Interrupt Flags, bit 16 */
    word XGIF_11     :1;                                       /* Channel Interrupt Flags, bit 17 */
    word XGIF_12     :1;                                       /* Channel Interrupt Flags, bit 18 */
    word XGIF_13     :1;                                       /* Channel Interrupt Flags, bit 19 */
    word XGIF_14     :1;                                       /* Channel Interrupt Flags, bit 20 */
    word XGIF_15     :1;                                       /* Channel Interrupt Flags, bit 21 */
    word XGIF_16     :1;                                       /* Channel Interrupt Flags, bit 22 */
    word XGIF_17     :1;                                       /* Channel Interrupt Flags, bit 23 */
    word XGIF_18     :1;                                       /* Channel Interrupt Flags, bit 24 */
    word XGIF_19     :1;                                       /* Channel Interrupt Flags, bit 25 */
    word XGIF_1A     :1;                                       /* Channel Interrupt Flags, bit 26 */
    word XGIF_1B     :1;                                       /* Channel Interrupt Flags, bit 27 */
    word XGIF_1C     :1;                                       /* Channel Interrupt Flags, bit 28 */
    word XGIF_1D     :1;                                       /* Channel Interrupt Flags, bit 29 */
    word XGIF_1E     :1;                                       /* Channel Interrupt Flags, bit 30 */
    word XGIF_1F     :1;                                       /* Channel Interrupt Flags, bit 31 */
  } Bits;
  struct {
    word grpXGIF__10 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF_1F_10STR;
extern volatile XGIF_1F_10STR _XGIF_1F_10 @(REG_BASE + 0x00000394UL);
#define XGIF_1F_10                      _XGIF_1F_10.Word
#define XGIF_1F_10_XGIF_10              _XGIF_1F_10.Bits.XGIF_10
#define XGIF_1F_10_XGIF_11              _XGIF_1F_10.Bits.XGIF_11
#define XGIF_1F_10_XGIF_12              _XGIF_1F_10.Bits.XGIF_12
#define XGIF_1F_10_XGIF_13              _XGIF_1F_10.Bits.XGIF_13
#define XGIF_1F_10_XGIF_14              _XGIF_1F_10.Bits.XGIF_14
#define XGIF_1F_10_XGIF_15              _XGIF_1F_10.Bits.XGIF_15
#define XGIF_1F_10_XGIF_16              _XGIF_1F_10.Bits.XGIF_16
#define XGIF_1F_10_XGIF_17              _XGIF_1F_10.Bits.XGIF_17
#define XGIF_1F_10_XGIF_18              _XGIF_1F_10.Bits.XGIF_18
#define XGIF_1F_10_XGIF_19              _XGIF_1F_10.Bits.XGIF_19
#define XGIF_1F_10_XGIF_1A              _XGIF_1F_10.Bits.XGIF_1A
#define XGIF_1F_10_XGIF_1B              _XGIF_1F_10.Bits.XGIF_1B
#define XGIF_1F_10_XGIF_1C              _XGIF_1F_10.Bits.XGIF_1C
#define XGIF_1F_10_XGIF_1D              _XGIF_1F_10.Bits.XGIF_1D
#define XGIF_1F_10_XGIF_1E              _XGIF_1F_10.Bits.XGIF_1E
#define XGIF_1F_10_XGIF_1F              _XGIF_1F_10.Bits.XGIF_1F
#define XGIF_1F_10_XGIF__10             _XGIF_1F_10.MergedBits.grpXGIF__10
#define XGIF_1F_10_XGIF_                XGIF_1F_10_XGIF__10

#define XGIF_1F_10_XGIF_10_MASK         1U
#define XGIF_1F_10_XGIF_11_MASK         2U
#define XGIF_1F_10_XGIF_12_MASK         4U
#define XGIF_1F_10_XGIF_13_MASK         8U
#define XGIF_1F_10_XGIF_14_MASK         16U
#define XGIF_1F_10_XGIF_15_MASK         32U
#define XGIF_1F_10_XGIF_16_MASK         64U
#define XGIF_1F_10_XGIF_17_MASK         128U
#define XGIF_1F_10_XGIF_18_MASK         256U
#define XGIF_1F_10_XGIF_19_MASK         512U
#define XGIF_1F_10_XGIF_1A_MASK         1024U
#define XGIF_1F_10_XGIF_1B_MASK         2048U
#define XGIF_1F_10_XGIF_1C_MASK         4096U
#define XGIF_1F_10_XGIF_1D_MASK         8192U
#define XGIF_1F_10_XGIF_1E_MASK         16384U
#define XGIF_1F_10_XGIF_1F_MASK         32768U
#define XGIF_1F_10_XGIF__10_MASK        1023U
#define XGIF_1F_10_XGIF__10_BITNUM      0U


/*** XGIF_0F_00 - XGATE Channel Interrupt Flag Vector; 0x00000396 ***/
typedef union {
  word Word;
  struct {
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word XGIF_09     :1;                                       /* Channel Interrupt Flags, bit 9 */
    word XGIF_0A     :1;                                       /* Channel Interrupt Flags, bit 10 */
    word XGIF_0B     :1;                                       /* Channel Interrupt Flags, bit 11 */
    word XGIF_0C     :1;                                       /* Channel Interrupt Flags, bit 12 */
    word XGIF_0D     :1;                                       /* Channel Interrupt Flags, bit 13 */
    word XGIF_0E     :1;                                       /* Channel Interrupt Flags, bit 14 */
    word XGIF_0F     :1;                                       /* Channel Interrupt Flags, bit 15 */
  } Bits;
} XGIF_0F_00STR;
extern volatile XGIF_0F_00STR _XGIF_0F_00 @(REG_BASE + 0x00000396UL);
#define XGIF_0F_00                      _XGIF_0F_00.Word
#define XGIF_0F_00_XGIF_09              _XGIF_0F_00.Bits.XGIF_09
#define XGIF_0F_00_XGIF_0A              _XGIF_0F_00.Bits.XGIF_0A
#define XGIF_0F_00_XGIF_0B              _XGIF_0F_00.Bits.XGIF_0B
#define XGIF_0F_00_XGIF_0C              _XGIF_0F_00.Bits.XGIF_0C
#define XGIF_0F_00_XGIF_0D              _XGIF_0F_00.Bits.XGIF_0D
#define XGIF_0F_00_XGIF_0E              _XGIF_0F_00.Bits.XGIF_0E
#define XGIF_0F_00_XGIF_0F              _XGIF_0F_00.Bits.XGIF_0F

#define XGIF_0F_00_XGIF_09_MASK         512U
#define XGIF_0F_00_XGIF_0A_MASK         1024U
#define XGIF_0F_00_XGIF_0B_MASK         2048U
#define XGIF_0F_00_XGIF_0C_MASK         4096U
#define XGIF_0F_00_XGIF_0D_MASK         8192U
#define XGIF_0F_00_XGIF_0E_MASK         16384U
#define XGIF_0F_00_XGIF_0F_MASK         32768U


