frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
/* Tip for register initialization in the user code:  const byte NVFPROT_INIT @0x0000FF0C = <NVFPROT_INITVAL>; */
#define _NVFPROT (*(const NVFPROTSTR *)0x0000FF0C)
#define NVFPROT                         _NVFPROT.Byte
#define NVFPROT_FPLS0                   _NVFPROT.Bits.FPLS0
#define NVFPROT_FPLS1                   _NVFPROT.Bits.FPLS1
#define NVFPROT_FPLDIS                  _NVFPROT.Bits.FPLDIS
#define NVFPROT_FPHS0                   _NVFPROT.Bits.FPHS0
#define NVFPROT_FPHS1                   _NVFPROT.Bits.FPHS1
#define NVFPROT_FPHDIS                  _NVFPROT.Bits.FPHDIS
#define NVFPROT_RNV6                    _NVFPROT.Bits.RNV6
#define NVFPROT_FPOPEN                  _NVFPROT.Bits.FPOPEN
#define NVFPROT_FPLS                    _NVFPROT.MergedBits.grpFPLS
#define NVFPROT_FPHS                    _NVFPROT.MergedBits.grpFPHS

#define NVFPROT_FPLS0_MASK              1U
#define NVFPROT_FPLS1_MASK              2U
#define NVFPROT_FPLDIS_MASK             4U
#define NVFPROT_FPHS0_MASK              8U
#define NVFPROT_FPHS1_MASK              16U
#define NVFPROT_FPHDIS_MASK             32U
#define NVFPROT_RNV6_MASK               64U
#define NVFPROT_FPOPEN_MASK             128U
#define NVFPROT_FPLS_MASK               3U
#define NVFPROT_FPLS_BITNUM             0U
#define NVFPROT_FPHS_MASK               24U
#define NVFPROT_FPHS_BITNUM             3U


/*** NVEPROT - Non Volatile EEE Protection Register; 0x0000FF0D ***/
typedef union {
  byte Byte;
  struct {
    byte EPS0        :1;                                       /* Buffer RAM Protection Size 0 */
    byte EPS1        :1;                                       /* Buffer RAM Protection Size 1 */
    byte EPS2        :1;                                       /* Buffer RAM Protection Size 2 */
    byte EPDIS       :1;                                       /* Buffer RAM Protection Address Range Disable */
    byte RNV4        :1;                                       /* Reserved Non-volatile Bits */
    byte RNV5        :1;                                       /* Reserved Non-volatile Bit 1 */
    byte RNV6        :1;                                       /* Reserved Non-volatile Bit 2 */
    byte EPOPEN      :1;                                       /* Enables writes to Buffer RAM partitioned for EEE */
  } Bits;
  struct {
    byte grpEPS  :3;
    byte         :1;
    byte grpRNV_4 :3;
    byte         :1;
  } MergedBits;
} NVEPROTSTR;
/* Tip for register initialization in the user code:  const byte NVEPROT_INIT @0x0000FF0D = <NVEPROT_INITVAL>; */
#define _NVEPROT (*(const NVEPROTSTR *)0x0000FF0D)
#define NVEPROT                         _NVEPROT.Byte
#define NVEPROT_EPS0                    _NVEPROT.Bits.EPS0
#define NVEPROT_EPS1                    _NVEPROT.Bits.EPS1
#define NVEPROT_EPS2                    _NVEPROT.Bits.EPS2
#define NVEPROT_EPDIS                   _NVEPROT.Bits.EPDIS
#define NVEPROT_RNV4                    _NVEPROT.Bits.RNV4
#define NVEPROT_RNV5                    _NVEPROT.Bits.RNV5
#define NVEPROT_RNV6                    _NVEPROT.Bits.RNV6
#define NVEPROT_EPOPEN                  _NVEPROT.Bits.EPOPEN
#define NVEPROT_EPS                     _NVEPROT.MergedBits.grpEPS
#define NVEPROT_RNV_4                   _NVEPROT.MergedBits.grpRNV_4
#define NVEPROT_RNV                     NVEPROT_RNV_4

#define NVEPROT_EPS0_MASK               1U
#define NVEPROT_EPS1_MASK               2U
#define NVEPROT_EPS2_MASK               4U
#define NVEPROT_EPDIS_MASK              8U
#define NVEPROT_RNV4_MASK               16U
#define NVEPROT_RNV5_MASK               32U
#define NVEPROT_RNV6_MASK               64U
#define NVEPROT_EPOPEN_MASK             128U
#define NVEPROT_EPS_MASK                7U
#define NVEPROT_EPS_BITNUM              0U
#define NVEPROT_RNV_4_MASK              112U
#define NVEPROT_RNV_4_BITNUM            4U


/*** NVFOPT - Non Volatile Flash Option Register; 0x0000FF0E ***/
typedef union {
  byte Byte;
  struct {
    byte NV0         :1;                                       /* Nonvolatile Bit 0 */
    byte NV1         :1;                                       /* Nonvolatile Bit 1 */
    byte NV2         :1;                                       /* Nonvolatile Bit 2 */
    byte NV3         :1;                                       /* Nonvolatile Bit 3 */
    byte NV4         :1;                                       /* Nonvolatile Bit 4 */
    byte NV5         :1;                                       /* Nonvolatile Bit 5 */
    byte NV6         :1;                                       /* Nonvolatile Bit 6 */
    byte NV7         :1;                                       /* Nonvolatile Bit 7 */
  } Bits;
} NVFOPTSTR;
/* Tip for register initialization in the user code:  const byte NVFOPT_INIT @0x0000FF0E = <NVFOPT_INITVAL>; */
#define _NVFOPT (*(const NVFOPTSTR *)0x0000FF0E)
#define NVFOPT                          _NVFOPT.Byte
#define NVFOPT_NV0                      _NVFOPT.Bits.NV0
#define NVFOPT_NV1                      _NVFOPT.Bits.NV1
#define NVFOPT_NV2                      _NVFOPT.Bits.NV2
#define NVFOPT_NV3                      _NVFOPT.Bits.NV3
#define NVFOPT_NV4                      _NVFOPT.Bits.NV4
#define NVFOPT_NV5                      _NVFOPT.Bits.NV5
#define NVFOPT_NV6                      _NVFOPT.Bits.NV6
#define NVFOPT_NV7                      _NVFOPT.Bits.NV7

#define NVFOPT_NV0_MASK                 1U
#define NVFOPT_NV1_MASK                 2U
#define NVFOPT_NV2_MASK                 4U
#define NVFOPT_NV3_MASK                 8U
#define NVFOPT_NV4_MASK                 16U
#define NVFOPT_NV5_MASK                 32U
#define NVFOPT_NV6_MASK                 64U
#define NVFOPT_NV7_MASK                 128U


/*** NVFSEC - Non Volatile Flash Security Register; 0x0000FF0F ***/
typedef union {
  byte Byte;
  struct {
    byte SEC0        :1;                                       /* Flash Security Bit 0 */
    byte SEC1        :1;                                       /* Flash Security Bit 1 */
    byte RNV2        :1;                                       /* Reserved Nonvolatile Bit 2 */
    byte RNV3        :1;                                       /* Reserved Nonvolatile Bit 3 */
    byte RNV4        :1;                                       /* Reserved Nonvolatile Bit 4 */
    byte RNV5        :1;                                       /* Reserved Nonvolatile Bit 5 */
    byte KEYEN0      :1;                                       /* Backdoor Key Security Enable Bit 0 */
    byte KEYEN1      :1;                                       /* Backdoor Key Security Enable Bit 1 */
  } Bits;
  struct {
    byte grpSEC  :2;
    byte grpRNV_2 :4;
    byte grpKEYEN :2;
  } MergedBits;
} NVFSECSTR;
