frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
/* Tip for register initialization in the user code:  const byte NVFSEC_INIT @0x0000FF0F = <NVFSEC_INITVAL>; */
#define _NVFSEC (*(const NVFSECSTR *)0x0000FF0F)
#define NVFSEC                          _NVFSEC.Byte
#define NVFSEC_SEC0                     _NVFSEC.Bits.SEC0
#define NVFSEC_SEC1                     _NVFSEC.Bits.SEC1
#define NVFSEC_RNV2                     _NVFSEC.Bits.RNV2
#define NVFSEC_RNV3                     _NVFSEC.Bits.RNV3
#define NVFSEC_RNV4                     _NVFSEC.Bits.RNV4
#define NVFSEC_RNV5                     _NVFSEC.Bits.RNV5
#define NVFSEC_KEYEN0                   _NVFSEC.Bits.KEYEN0
#define NVFSEC_KEYEN1                   _NVFSEC.Bits.KEYEN1
#define NVFSEC_SEC                      _NVFSEC.MergedBits.grpSEC
#define NVFSEC_RNV_2                    _NVFSEC.MergedBits.grpRNV_2
#define NVFSEC_KEYEN                    _NVFSEC.MergedBits.grpKEYEN
#define NVFSEC_RNV                      NVFSEC_RNV_2

#define NVFSEC_SEC0_MASK                1U
#define NVFSEC_SEC1_MASK                2U
#define NVFSEC_RNV2_MASK                4U
#define NVFSEC_RNV3_MASK                8U
#define NVFSEC_RNV4_MASK                16U
#define NVFSEC_RNV5_MASK                32U
#define NVFSEC_KEYEN0_MASK              64U
#define NVFSEC_KEYEN1_MASK              128U
#define NVFSEC_SEC_MASK                 3U
#define NVFSEC_SEC_BITNUM               0U
#define NVFSEC_RNV_2_MASK               60U
#define NVFSEC_RNV_2_BITNUM             2U
#define NVFSEC_KEYEN_MASK               192U
#define NVFSEC_KEYEN_BITNUM             6U


  /* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (void)(ARMCOP = 0x55U, ARMCOP = 0xAAU)
#endif
#endif /* __RESET_WATCHDOG */


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */



/* **** 18.04.2007 12:33:05 */

#define DBGXDH_BIT0                      DBGXDH_BIT8
#define DBGXDH_BIT1                      DBGXDH_BIT9
#define DBGXDH_BIT2                      DBGXDH_BIT10
#define DBGXDH_BIT3                      DBGXDH_BIT11
#define DBGXDH_BIT4                      DBGXDH_BIT12
#define DBGXDH_BIT5                      DBGXDH_BIT13
#define DBGXDH_BIT6                      DBGXDH_BIT14
#define DBGXDH_BIT7                      DBGXDH_BIT15
#define DBGXDH_BIT0_MASK                 DBGXDH_BIT8_MASK
#define DBGXDH_BIT1_MASK                 DBGXDH_BIT9_MASK
#define DBGXDH_BIT2_MASK                 DBGXDH_BIT10_MASK
#define DBGXDH_BIT3_MASK                 DBGXDH_BIT11_MASK
#define DBGXDH_BIT4_MASK                 DBGXDH_BIT12_MASK
#define DBGXDH_BIT5_MASK                 DBGXDH_BIT13_MASK
#define DBGXDH_BIT6_MASK                 DBGXDH_BIT14_MASK
#define DBGXDH_BIT7_MASK                 DBGXDH_BIT15_MASK
#define SYNR_SYN0                        SYNR_SYNDIV0
#define SYNR_SYN1                        SYNR_SYNDIV1
#define SYNR_SYN2                        SYNR_SYNDIV2
#define SYNR_SYN3                        SYNR_SYNDIV3
#define SYNR_SYN4                        SYNR_SYNDIV4
#define SYNR_SYN5                        SYNR_SYNDIV5
#define SYNR_SYN                         SYNR_SYNDIV
#define SYNR_SYN0_MASK                   SYNR_SYNDIV0_MASK
#define SYNR_SYN1_MASK                   SYNR_SYNDIV1_MASK
#define SYNR_SYN2_MASK                   SYNR_SYNDIV2_MASK
#define SYNR_SYN3_MASK                   SYNR_SYNDIV3_MASK
#define SYNR_SYN4_MASK                   SYNR_SYNDIV4_MASK
#define SYNR_SYN5_MASK                   SYNR_SYNDIV5_MASK
#define SYNR_SYN_MASK                    SYNR_SYNDIV_MASK
#define SYNR_SYN_BITNUM                  SYNR_SYNDIV_BITNUM
#define REFDV_REFDV0                     REFDV_REFDIV0
#define REFDV_REFDV1                     REFDV_REFDIV1
#define REFDV_REFDV2                     REFDV_REFDIV2
#define REFDV_REFDV3                     REFDV_REFDIV3
#define REFDV_REFDV4                     REFDV_REFDIV4
#define REFDV_REFDV5                     REFDV_REFDIV5
#define REFDV_REFDV                      REFDV_REFDIV
#define REFDV_REFDV0_MASK                REFDV_REFDIV0_MASK
#define REFDV_REFDV1_MASK                REFDV_REFDIV1_MASK
#define REFDV_REFDV2_MASK                REFDV_REFDIV2_MASK
#define REFDV_REFDV3_MASK                REFDV_REFDIV3_MASK
#define REFDV_REFDV4_MASK                REFDV_REFDIV4_MASK
#define REFDV_REFDV5_MASK                REFDV_REFDIV5_MASK
#define REFDV_REFDV_MASK                 REFDV_REFDIV_MASK
#define REFDV_REFDV_BITNUM               REFDV_REFDIV_BITNUM
#define ECT_TCNTLo_BIT0                  This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT1                  This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT2                  This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT3                  This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT4                  This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT5                  This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT6                  This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT7                  This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT0_MASK             This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT1_MASK             This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT2_MASK             This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT3_MASK             This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT4_MASK             This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT5_MASK             This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT6_MASK             This_symb_has_been_depreciated
#define ECT_TCNTLo_BIT7_MASK             This_symb_has_been_depreciated
#define ECT_TCNT_BIT0                    This_symb_has_been_depreciated
#define ECT_TCNT_BIT1                    This_symb_has_been_depreciated
#define ECT_TCNT_BIT2                    This_symb_has_been_depreciated
#define ECT_TCNT_BIT3                    This_symb_has_been_depreciated
#define ECT_TCNT_BIT4                    This_symb_has_been_depreciated
#define ECT_TCNT_BIT5                    This_symb_has_been_depreciated
#define ECT_TCNT_BIT6                    This_symb_has_been_depreciated
#define ECT_TCNT_BIT7                    This_symb_has_been_depreciated
#define ECT_TCNT_BIT8                    This_symb_has_been_depreciated
#define ECT_TCNT_BIT9                    This_symb_has_been_depreciated
#define ECT_TCNT_BIT10                   This_symb_has_been_depreciated
#define ECT_TCNT_BIT11                   This_symb_has_been_depreciated
#define ECT_TCNT_BIT12                   This_symb_has_been_depreciated
#define ECT_TCNT_BIT13                   This_symb_has_been_depreciated
#define ECT_TCNT_BIT14                   This_symb_has_been_depreciated
#define ECT_TCNT_BIT15                   This_symb_has_been_depreciated
#define ECT_TCNT_BIT0_MASK               This_symb_has_been_depreciated
#define ECT_TCNT_BIT1_MASK               This_symb_has_been_depreciated
#define ECT_TCNT_BIT2_MASK               This_symb_has_been_depreciated
#define ECT_TCNT_BIT3_MASK               This_symb_has_been_depreciated
#define ECT_TCNT_BIT4_MASK               This_symb_has_been_depreciated
#define ECT_TCNT_BIT5_MASK               This_symb_has_been_depreciated
#define ECT_TCNT_BIT6_MASK               This_symb_has_been_depreciated
#define ECT_TCNT_BIT7_MASK               This_symb_has_been_depreciated
#define ECT_TCNT_BIT8_MASK               This_symb_has_been_depreciated
#define ECT_TCNT_BIT9_MASK               This_symb_has_been_depreciated
#define ECT_TCNT_BIT10_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_BIT11_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_BIT12_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_BIT13_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_BIT14_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_BIT15_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_BIT0                    ECT_PA3H_PA3H0
#define ECT_PA3H_BIT1                    ECT_PA3H_PA3H1
#define ECT_PA3H_BIT2                    ECT_PA3H_PA3H2
#define ECT_PA3H_BIT3                    ECT_PA3H_PA3H3
#define ECT_PA3H_BIT4                    ECT_PA3H_PA3H4
#define ECT_PA3H_BIT5                    ECT_PA3H_PA3H5
#define ECT_PA3H_BIT6                    ECT_PA3H_PA3H6
#define ECT_PA3H_BIT7                    ECT_PA3H_PA3H7
#define ECT_PA3H_BIT0_MASK               ECT_PA3H_PA3H0_MASK
#define ECT_PA3H_BIT1_MASK               ECT_PA3H_PA3H1_MASK
#define ECT_PA3H_BIT2_MASK               ECT_PA3H_PA3H2_MASK
#define ECT_PA3H_BIT3_MASK               ECT_PA3H_PA3H3_MASK
#define ECT_PA3H_BIT4_MASK               ECT_PA3H_PA3H4_MASK
#define ECT_PA3H_BIT5_MASK               ECT_PA3H_PA3H5_MASK
#define ECT_PA3H_BIT6_MASK               ECT_PA3H_PA3H6_MASK
#define ECT_PA3H_BIT7_MASK               ECT_PA3H_PA3H7_MASK
#define ECT_PA2H_BIT0                    ECT_PA2H_PA2H0
#define ECT_PA2H_BIT1                    ECT_PA2H_PA2H1
#define ECT_PA2H_BIT2                    ECT_PA2H_PA2H2
#define ECT_PA2H_BIT3                    ECT_PA2H_PA2H3
#define ECT_PA2H_BIT4                    ECT_PA2H_PA2H4
#define ECT_PA2H_BIT5                    ECT_PA2H_PA2H5
#define ECT_PA2H_BIT6                    ECT_PA2H_PA2H6
#define ECT_PA2H_BIT7                    ECT_PA2H_PA2H7
#define ECT_PA2H_BIT0_MASK               ECT_PA2H_PA2H0_MASK
#define ECT_PA2H_BIT1_MASK               ECT_PA2H_PA2H1_MASK
#define ECT_PA2H_BIT2_MASK               ECT_PA2H_PA2H2_MASK
#define ECT_PA2H_BIT3_MASK               ECT_PA2H_PA2H3_MASK
#define ECT_PA2H_BIT4_MASK               ECT_PA2H_PA2H4_MASK
#define ECT_PA2H_BIT5_MASK               ECT_PA2H_PA2H5_MASK
#define ECT_PA2H_BIT6_MASK               ECT_PA2H_PA2H6_MASK
#define ECT_PA2H_BIT7_MASK               ECT_PA2H_PA2H7_MASK
#define ECT_PA32H_BIT0                   ECT_PA32H_PA2H0
#define ECT_PA32H_BIT1                   ECT_PA32H_PA2H1
#define ECT_PA32H_BIT2                   ECT_PA32H_PA2H2
#define ECT_PA32H_BIT3                   ECT_PA32H_PA2H3
#define ECT_PA32H_BIT4                   ECT_PA32H_PA2H4
#define ECT_PA32H_BIT5                   ECT_PA32H_PA2H5
#define ECT_PA32H_BIT6                   ECT_PA32H_PA2H6
#define ECT_PA32H_BIT7                   ECT_PA32H_PA2H7
#define ECT_PA32H_BIT8                   ECT_PA32H_PA3H0
#define ECT_PA32H_BIT9                   ECT_PA32H_PA3H1
#define ECT_PA32H_BIT10                  ECT_PA32H_PA3H2
#define ECT_PA32H_BIT11                  ECT_PA32H_PA3H3
#define ECT_PA32H_BIT12                  ECT_PA32H_PA3H4
#define ECT_PA32H_BIT13                  ECT_PA32H_PA3H5
#define ECT_PA32H_BIT14                  ECT_PA32H_PA3H6
#define ECT_PA32H_BIT15                  ECT_PA32H_PA3H7
#define ECT_PA32H_BIT0_MASK              ECT_PA32H_PA2H0_MASK
#define ECT_PA32H_BIT1_MASK              ECT_PA32H_PA2H1_MASK
#define ECT_PA32H_BIT2_MASK              ECT_PA32H_PA2H2_MASK
#define ECT_PA32H_BIT3_MASK              ECT_PA32H_PA2H3_MASK
#define ECT_PA32H_BIT4_MASK              ECT_PA32H_PA2H4_MASK
#define ECT_PA32H_BIT5_MASK              ECT_PA32H_PA2H5_MASK
#define ECT_PA32H_BIT6_MASK              ECT_PA32H_PA2H6_MASK
#define ECT_PA32H_BIT7_MASK              ECT_PA32H_PA2H7_MASK
#define ECT_PA32H_BIT8_MASK              ECT_PA32H_PA3H0_MASK
#define ECT_PA32H_BIT9_MASK              ECT_PA32H_PA3H1_MASK
#define ECT_PA32H_BIT10_MASK             ECT_PA32H_PA3H2_MASK
#define ECT_PA32H_BIT11_MASK             ECT_PA32H_PA3H3_MASK
#define ECT_PA32H_BIT12_MASK             ECT_PA32H_PA3H4_MASK
#define ECT_PA32H_BIT13_MASK             ECT_PA32H_PA3H5_MASK
#define ECT_PA32H_BIT14_MASK             ECT_PA32H_PA3H6_MASK
#define ECT_PA32H_BIT15_MASK             ECT_PA32H_PA3H7_MASK
#define ECT_PA1H_BIT0                    ECT_PA1H_PA1H0
#define ECT_PA1H_BIT1                    ECT_PA1H_PA1H1
#define ECT_PA1H_BIT2                    ECT_PA1H_PA1H2
#define ECT_PA1H_BIT3                    ECT_PA1H_PA1H3
#define ECT_PA1H_BIT4                    ECT_PA1H_PA1H4
#define ECT_PA1H_BIT5                    ECT_PA1H_PA1H5
#define ECT_PA1H_BIT6                    ECT_PA1H_PA1H6
#define ECT_PA1H_BIT7                    ECT_PA1H_PA1H7
#define ECT_PA1H_BIT0_MASK               ECT_PA1H_PA1H0_MASK
#define ECT_PA1H_BIT1_MASK               ECT_PA1H_PA1H1_MASK
#define ECT_PA1H_BIT2_MASK               ECT_PA1H_PA1H2_MASK
#define ECT_PA1H_BIT3_MASK               ECT_PA1H_PA1H3_MASK
#define ECT_PA1H_BIT4_MASK               ECT_PA1H_PA1H4_MASK
#define ECT_PA1H_BIT5_MASK               ECT_PA1H_PA1H5_MASK
#define ECT_PA1H_BIT6_MASK               ECT_PA1H_PA1H6_MASK
#define ECT_PA1H_BIT7_MASK               ECT_PA1H_PA1H7_MASK
#define ECT_PA0H_BIT0                    ECT_PA0H_PA0H0
#define ECT_PA0H_BIT1                    ECT_PA0H_PA0H1
#define ECT_PA0H_BIT2                    ECT_PA0H_PA0H2
#define ECT_PA0H_BIT3                    ECT_PA0H_PA0H3
#define ECT_PA0H_BIT4                    ECT_PA0H_PA0H4
#define ECT_PA0H_BIT5                    ECT_PA0H_PA0H5
#define ECT_PA0H_BIT6                    ECT_PA0H_PA0H6
#define ECT_PA0H_BIT7                    ECT_PA0H_PA0H7
#define ECT_PA0H_BIT0_MASK               ECT_PA0H_PA0H0_MASK
#define ECT_PA0H_BIT1_MASK               ECT_PA0H_PA0H1_MASK
#define ECT_PA0H_BIT2_MASK               ECT_PA0H_PA0H2_MASK
#define ECT_PA0H_BIT3_MASK               ECT_PA0H_PA0H3_MASK
#define ECT_PA0H_BIT4_MASK               ECT_PA0H_PA0H4_MASK
#define ECT_PA0H_BIT5_MASK               ECT_PA0H_PA0H5_MASK
#define ECT_PA0H_BIT6_MASK               ECT_PA0H_PA0H6_MASK
#define ECT_PA0H_BIT7_MASK               ECT_PA0H_PA0H7_MASK
#define ECT_PA10H_BIT0                   ECT_PA10H_PA0H0
#define ECT_PA10H_BIT1                   ECT_PA10H_PA0H1
#define ECT_PA10H_BIT2                   ECT_PA10H_PA0H2
#define ECT_PA10H_BIT3                   ECT_PA10H_PA0H3
#define ECT_PA10H_BIT4                   ECT_PA10H_PA0H4
#define ECT_PA10H_BIT5                   ECT_PA10H_PA0H5
#define ECT_PA10H_BIT6                   ECT_PA10H_PA0H6
#define ECT_PA10H_BIT7                   ECT_PA10H_PA0H7
#define ECT_PA10H_BIT8                   ECT_PA10H_PA1H0
#define ECT_PA10H_BIT9                   ECT_PA10H_PA1H1
#define ECT_PA10H_BIT10                  ECT_PA10H_PA1H2
#define ECT_PA10H_BIT11                  ECT_PA10H_PA1H3
#define ECT_PA10H_BIT12                  ECT_PA10H_PA1H4
#define ECT_PA10H_BIT13                  ECT_PA10H_PA1H5
#define ECT_PA10H_BIT14                  ECT_PA10H_PA1H6
#define ECT_PA10H_BIT15                  ECT_PA10H_PA1H7
#define ECT_PA10H_BIT0_MASK              ECT_PA10H_PA0H0_MASK
#define ECT_PA10H_BIT1_MASK              ECT_PA10H_PA0H1_MASK
#define ECT_PA10H_BIT2_MASK              ECT_PA10H_PA0H2_MASK
#define ECT_PA10H_BIT3_MASK              ECT_PA10H_PA0H3_MASK
#define ECT_PA10H_BIT4_MASK              ECT_PA10H_PA0H4_MASK
#define ECT_PA10H_BIT5_MASK              ECT_PA10H_PA0H5_MASK
#define ECT_PA10H_BIT6_MASK              ECT_PA10H_PA0H6_MASK
#define ECT_PA10H_BIT7_MASK              ECT_PA10H_PA0H7_MASK
#define ECT_PA10H_BIT8_MASK              ECT_PA10H_PA1H0_MASK
#define ECT_PA10H_BIT9_MASK              ECT_PA10H_PA1H1_MASK
#define ECT_PA10H_BIT10_MASK             ECT_PA10H_PA1H2_MASK
#define ECT_PA10H_BIT11_MASK             ECT_PA10H_PA1H3_MASK
#define ECT_PA10H_BIT12_MASK             ECT_PA10H_PA1H4_MASK
#define ECT_PA10H_BIT13_MASK             ECT_PA10H_PA1H5_MASK
#define ECT_PA10H_BIT14_MASK             ECT_PA10H_PA1H6_MASK
#define ECT_PA10H_BIT15_MASK             ECT_PA10H_PA1H7_MASK
#define ECT_TC0Hhi_BIT8                  ECT_TC0Hhi_TC8
#define ECT_TC0Hhi_BIT9                  ECT_TC0Hhi_TC9
#define ECT_TC0Hhi_BIT10                 ECT_TC0Hhi_TC10
#define ECT_TC0Hhi_BIT11                 ECT_TC0Hhi_TC11
#define ECT_TC0Hhi_BIT12                 ECT_TC0Hhi_TC12
#define ECT_TC0Hhi_BIT13                 ECT_TC0Hhi_TC13
#define ECT_TC0Hhi_BIT14                 ECT_TC0Hhi_TC14
#define ECT_TC0Hhi_BIT15                 ECT_TC0Hhi_TC15
#define ECT_TC0Hhi_BIT8_MASK             ECT_TC0Hhi_TC8_MASK
#define ECT_TC0Hhi_BIT9_MASK             ECT_TC0Hhi_TC9_MASK
#define ECT_TC0Hhi_BIT10_MASK            ECT_TC0Hhi_TC10_MASK
#define ECT_TC0Hhi_BIT11_MASK            ECT_TC0Hhi_TC11_MASK
#define ECT_TC0Hhi_BIT12_MASK            ECT_TC0Hhi_TC12_MASK
#define ECT_TC0Hhi_BIT13_MASK            ECT_TC0Hhi_TC13_MASK
#define ECT_TC0Hhi_BIT14_MASK            ECT_TC0Hhi_TC14_MASK
#define ECT_TC0Hhi_BIT15_MASK            ECT_TC0Hhi_TC15_MASK
#define ECT_TC0Hlo_BIT0                  ECT_TC0Hlo_TC0
#define ECT_TC0Hlo_BIT1                  ECT_TC0Hlo_TC1
#define ECT_TC0Hlo_BIT2                  ECT_TC0Hlo_TC2
#define ECT_TC0Hlo_BIT3                  ECT_TC0Hlo_TC3
#define ECT_TC0Hlo_BIT4                  ECT_TC0Hlo_TC4
#define ECT_TC0Hlo_BIT5                  ECT_TC0Hlo_TC5
#define ECT_TC0Hlo_BIT6                  ECT_TC0Hlo_TC6
#define ECT_TC0Hlo_BIT7                  ECT_TC0Hlo_TC7
#define ECT_TC0Hlo_BIT0_MASK             ECT_TC0Hlo_TC0_MASK
#define ECT_TC0Hlo_BIT1_MASK             ECT_TC0Hlo_TC1_MASK
#define ECT_TC0Hlo_BIT2_MASK             ECT_TC0Hlo_TC2_MASK
#define ECT_TC0Hlo_BIT3_MASK             ECT_TC0Hlo_TC3_MASK
#define ECT_TC0Hlo_BIT4_MASK             ECT_TC0Hlo_TC4_MASK
#define ECT_TC0Hlo_BIT5_MASK             ECT_TC0Hlo_TC5_MASK
#define ECT_TC0Hlo_BIT6_MASK             ECT_TC0Hlo_TC6_MASK
#define ECT_TC0Hlo_BIT7_MASK             ECT_TC0Hlo_TC7_MASK
#define ECT_TC0H_BIT0                    ECT_TC0H_TC0
#define ECT_TC0H_BIT1                    ECT_TC0H_TC1
#define ECT_TC0H_BIT2                    ECT_TC0H_TC2
#define ECT_TC0H_BIT3                    ECT_TC0H_TC3
#define ECT_TC0H_BIT4                    ECT_TC0H_TC4
#define ECT_TC0H_BIT5                    ECT_TC0H_TC5
#define ECT_TC0H_BIT6                    ECT_TC0H_TC6
#define ECT_TC0H_BIT7                    ECT_TC0H_TC7
#define ECT_TC0H_BIT8                    ECT_TC0H_TC8
#define ECT_TC0H_BIT9                    ECT_TC0H_TC9
#define ECT_TC0H_BIT10                   ECT_TC0H_TC10
#define ECT_TC0H_BIT11                   ECT_TC0H_TC11
#define ECT_TC0H_BIT12                   ECT_TC0H_TC12
#define ECT_TC0H_BIT13                   ECT_TC0H_TC13
#define ECT_TC0H_BIT14                   ECT_TC0H_TC14
#define ECT_TC0H_BIT15                   ECT_TC0H_TC15
#define ECT_TC0H_BIT0_MASK               ECT_TC0H_TC0_MASK
#define ECT_TC0H_BIT1_MASK               ECT_TC0H_TC1_MASK
#define ECT_TC0H_BIT2_MASK               ECT_TC0H_TC2_MASK
#define ECT_TC0H_BIT3_MASK               ECT_TC0H_TC3_MASK
#define ECT_TC0H_BIT4_MASK               ECT_TC0H_TC4_MASK
#define ECT_TC0H_BIT5_MASK               ECT_TC0H_TC5_MASK
#define ECT_TC0H_BIT6_MASK               ECT_TC0H_TC6_MASK
#define ECT_TC0H_BIT7_MASK               ECT_TC0H_TC7_MASK
#define ECT_TC0H_BIT8_MASK               ECT_TC0H_TC8_MASK
#define ECT_TC0H_BIT9_MASK               ECT_TC0H_TC9_MASK
#define ECT_TC0H_BIT10_MASK              ECT_TC0H_TC10_MASK
#define ECT_TC0H_BIT11_MASK              ECT_TC0H_TC11_MASK
#define ECT_TC0H_BIT12_MASK              ECT_TC0H_TC12_MASK
#define ECT_TC0H_BIT13_MASK              ECT_TC0H_TC13_MASK
#define ECT_TC0H_BIT14_MASK              ECT_TC0H_TC14_MASK
#define ECT_TC0H_BIT15_MASK              ECT_TC0H_TC15_MASK
#define ECT_TC1Hhi_BIT8                  ECT_TC1Hhi_TC8
#define ECT_TC1Hhi_BIT9                  ECT_TC1Hhi_TC9
#define ECT_TC1Hhi_BIT10                 ECT_TC1Hhi_TC10
#define ECT_TC1Hhi_BIT11                 ECT_TC1Hhi_TC11
#define ECT_TC1Hhi_BIT12                 ECT_TC1Hhi_TC12
#define ECT_TC1Hhi_BIT13                 ECT_TC1Hhi_TC13
#define ECT_TC1Hhi_BIT14                 ECT_TC1Hhi_TC14
#define ECT_TC1Hhi_BIT15                 ECT_TC1Hhi_TC15
#define ECT_TC1Hhi_BIT8_MASK             ECT_TC1Hhi_TC8_MASK
#define ECT_TC1Hhi_BIT9_MASK             ECT_TC1Hhi_TC9_MASK
#define ECT_TC1Hhi_BIT10_MASK            ECT_TC1Hhi_TC10_MASK
#define ECT_TC1Hhi_BIT11_MASK            ECT_TC1Hhi_TC11_MASK
#define ECT_TC1Hhi_BIT12_MASK            ECT_TC1Hhi_TC12_MASK
#define ECT_TC1Hhi_BIT13_MASK            ECT_TC1Hhi_TC13_MASK
#define ECT_TC1Hhi_BIT14_MASK            ECT_TC1Hhi_TC14_MASK
#define ECT_TC1Hhi_BIT15_MASK            ECT_TC1Hhi_TC15_MASK
#define ECT_TC1Hlo_BIT0                  ECT_TC1Hlo_TC0
#define ECT_TC1Hlo_BIT1                  ECT_TC1Hlo_TC1
#define ECT_TC1Hlo_BIT2                  ECT_TC1Hlo_TC2
#define ECT_TC1Hlo_BIT3                  ECT_TC1Hlo_TC3
#define ECT_TC1Hlo_BIT4                  ECT_TC1Hlo_TC4
#define ECT_TC1Hlo_BIT5                  ECT_TC1Hlo_TC5
#define ECT_TC1Hlo_BIT6                  ECT_TC1Hlo_TC6
#define ECT_TC1Hlo_BIT7                  ECT_TC1Hlo_TC7
#define ECT_TC1Hlo_BIT0_MASK             ECT_TC1Hlo_TC0_MASK
#define ECT_TC1Hlo_BIT1_MASK             ECT_TC1Hlo_TC1_MASK
#define ECT_TC1Hlo_BIT2_MASK             ECT_TC1Hlo_TC2_MASK
#define ECT_TC1Hlo_BIT3_MASK             ECT_TC1Hlo_TC3_MASK
#define ECT_TC1Hlo_BIT4_MASK             ECT_TC1Hlo_TC4_MASK
#define ECT_TC1Hlo_BIT5_MASK             ECT_TC1Hlo_TC5_MASK
#define ECT_TC1Hlo_BIT6_MASK             ECT_TC1Hlo_TC6_MASK
#define ECT_TC1Hlo_BIT7_MASK             ECT_TC1Hlo_TC7_MASK
#define ECT_TC1H_BIT0                    ECT_TC1H_TC0
#define ECT_TC1H_BIT1                    ECT_TC1H_TC1
#define ECT_TC1H_BIT2                    ECT_TC1H_TC2
#define ECT_TC1H_BIT3                    ECT_TC1H_TC3
#define ECT_TC1H_BIT4                    ECT_TC1H_TC4
#define ECT_TC1H_BIT5                    ECT_TC1H_TC5
#define ECT_TC1H_BIT6                    ECT_TC1H_TC6
#define ECT_TC1H_BIT7                    ECT_TC1H_TC7
#define ECT_TC1H_BIT8                    ECT_TC1H_TC8
#define ECT_TC1H_BIT9                    ECT_TC1H_TC9
#define ECT_TC1H_BIT10                   ECT_TC1H_TC10
#define ECT_TC1H_BIT11                   ECT_TC1H_TC11
#define ECT_TC1H_BIT12                   ECT_TC1H_TC12
#define ECT_TC1H_BIT13                   ECT_TC1H_TC13
#define ECT_TC1H_BIT14                   ECT_TC1H_TC14
#define ECT_TC1H_BIT15                   ECT_TC1H_TC15
#define ECT_TC1H_BIT0_MASK               ECT_TC1H_TC0_MASK
#define ECT_TC1H_BIT1_MASK               ECT_TC1H_TC1_MASK
#define ECT_TC1H_BIT2_MASK               ECT_TC1H_TC2_MASK
#define ECT_TC1H_BIT3_MASK               ECT_TC1H_TC3_MASK
#define ECT_TC1H_BIT4_MASK               ECT_TC1H_TC4_MASK
#define ECT_TC1H_BIT5_MASK               ECT_TC1H_TC5_MASK
#define ECT_TC1H_BIT6_MASK               ECT_TC1H_TC6_MASK
#define ECT_TC1H_BIT7_MASK               ECT_TC1H_TC7_MASK
#define ECT_TC1H_BIT8_MASK               ECT_TC1H_TC8_MASK
#define ECT_TC1H_BIT9_MASK               ECT_TC1H_TC9_MASK
#define ECT_TC1H_BIT10_MASK              ECT_TC1H_TC10_MASK
#define ECT_TC1H_BIT11_MASK              ECT_TC1H_TC11_MASK
#define ECT_TC1H_BIT12_MASK              ECT_TC1H_TC12_MASK
#define ECT_TC1H_BIT13_MASK              ECT_TC1H_TC13_MASK
#define ECT_TC1H_BIT14_MASK              ECT_TC1H_TC14_MASK
#define ECT_TC1H_BIT15_MASK              ECT_TC1H_TC15_MASK
#define ECT_TC2Hhi_BIT8                  ECT_TC2Hhi_TC8
#define ECT_TC2Hhi_BIT9                  ECT_TC2Hhi_TC9
#define ECT_TC2Hhi_BIT10                 ECT_TC2Hhi_TC10
#define ECT_TC2Hhi_BIT11                 ECT_TC2Hhi_TC11
#define ECT_TC2Hhi_BIT12                 ECT_TC2Hhi_TC12
#define ECT_TC2Hhi_BIT13                 ECT_TC2Hhi_TC13
#define ECT_TC2Hhi_BIT14                 ECT_TC2Hhi_TC14
#define ECT_TC2Hhi_BIT15                 ECT_TC2Hhi_TC15
#define ECT_TC2Hhi_BIT8_MASK             ECT_TC2Hhi_TC8_MASK
#define ECT_TC2Hhi_BIT9_MASK             ECT_TC2Hhi_TC9_MASK
#define ECT_TC2Hhi_BIT10_MASK            ECT_TC2Hhi_TC10_MASK
#define ECT_TC2Hhi_BIT11_MASK            ECT_TC2Hhi_TC11_MASK
#define ECT_TC2Hhi_BIT12_MASK            ECT_TC2Hhi_TC12_MASK
