frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
#define VectorNumber_Vtimpaie            VectorNumber_VReserved95
#define VectorNumber_Vtimpaaovf          VectorNumber_VReserved94
#define VectorNumber_Vtimovf             VectorNumber_VReserved93
#define VectorNumber_Vtimch7             VectorNumber_VReserved92
#define VectorNumber_Vtimch6             VectorNumber_VReserved91
#define VectorNumber_Vtimch5             VectorNumber_VReserved90
#define VectorNumber_Vtimch4             VectorNumber_VReserved89
#define VectorNumber_Vtimch3             VectorNumber_VReserved88
#define VectorNumber_Vtimch2             VectorNumber_VReserved87
#define VectorNumber_Vtimch1             VectorNumber_VReserved86
#define VectorNumber_Vtimch0             VectorNumber_VReserved85
#define VectorNumber_VReserved65         VectorNumber_Vhti


#define VectorNumber_Vflashfault         VectorNumber_Vflashfd
#define Vtimpaie                         VReserved95
#define Vtimpaaovf                       VReserved94
#define Vtimovf                          VReserved93
#define Vtimch7                          VReserved92
#define Vtimch6                          VReserved91
#define Vtimch5                          VReserved90
#define Vtimch4                          VReserved89
#define Vtimch3                          VReserved88
#define Vtimch2                          VReserved87
#define Vtimch1                          VReserved86
#define Vtimch0                          VReserved85
#define VReserved65                      Vhti


#define Vflashfault                      Vflashfd
#define ECT_TCNTLo_TCNT0                 This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT1                 This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT2                 This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT3                 This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT4                 This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT5                 This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT6                 This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT7                 This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT0_MASK            This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT1_MASK            This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT2_MASK            This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT3_MASK            This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT4_MASK            This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT5_MASK            This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT6_MASK            This_symb_has_been_depreciated
#define ECT_TCNTLo_TCNT7_MASK            This_symb_has_been_depreciated
#define ECT_TCNT_TCNT0                   This_symb_has_been_depreciated
#define ECT_TCNT_TCNT1                   This_symb_has_been_depreciated
#define ECT_TCNT_TCNT2                   This_symb_has_been_depreciated
#define ECT_TCNT_TCNT3                   This_symb_has_been_depreciated
#define ECT_TCNT_TCNT4                   This_symb_has_been_depreciated
#define ECT_TCNT_TCNT5                   This_symb_has_been_depreciated
#define ECT_TCNT_TCNT6                   This_symb_has_been_depreciated
#define ECT_TCNT_TCNT7                   This_symb_has_been_depreciated
#define ECT_TCNT_TCNT8                   This_symb_has_been_depreciated
#define ECT_TCNT_TCNT9                   This_symb_has_been_depreciated
#define ECT_TCNT_TCNT10                  This_symb_has_been_depreciated
#define ECT_TCNT_TCNT11                  This_symb_has_been_depreciated
#define ECT_TCNT_TCNT12                  This_symb_has_been_depreciated
#define ECT_TCNT_TCNT13                  This_symb_has_been_depreciated
#define ECT_TCNT_TCNT14                  This_symb_has_been_depreciated
#define ECT_TCNT_TCNT15                  This_symb_has_been_depreciated
#define ECT_TCNT_TCNT0_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_TCNT1_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_TCNT2_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_TCNT3_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_TCNT4_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_TCNT5_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_TCNT6_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_TCNT7_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_TCNT8_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_TCNT9_MASK              This_symb_has_been_depreciated
#define ECT_TCNT_TCNT10_MASK             This_symb_has_been_depreciated
#define ECT_TCNT_TCNT11_MASK             This_symb_has_been_depreciated
#define ECT_TCNT_TCNT12_MASK             This_symb_has_been_depreciated
#define ECT_TCNT_TCNT13_MASK             This_symb_has_been_depreciated
#define ECT_TCNT_TCNT14_MASK             This_symb_has_been_depreciated
#define ECT_TCNT_TCNT15_MASK             This_symb_has_been_depreciated
#define ECT_PA3H_PA3H0                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H1                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H2                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H3                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H4                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H5                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H6                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H7                   This_symb_has_been_depreciated
#define ECT_PA3H_PA3H0_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H1_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H2_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H3_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H4_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H5_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H6_MASK              This_symb_has_been_depreciated
#define ECT_PA3H_PA3H7_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H0                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H1                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H2                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H3                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H4                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H5                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H6                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H7                   This_symb_has_been_depreciated
#define ECT_PA2H_PA2H0_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H1_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H2_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H3_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H4_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H5_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H6_MASK              This_symb_has_been_depreciated
#define ECT_PA2H_PA2H7_MASK              This_symb_has_been_depreciated
#define ECT_PA32H_PA2H0                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H1                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H2                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H3                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H4                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H5                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H6                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H7                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H0                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H1                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H2                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H3                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H4                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H5                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H6                  This_symb_has_been_depreciated
#define ECT_PA32H_PA3H7                  This_symb_has_been_depreciated
#define ECT_PA32H_PA2H                   This_symb_has_been_depreciated
#define ECT_PA32H_PA3H                   This_symb_has_been_depreciated
#define ECT_PA32H_PA2H0_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H1_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H2_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H3_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H4_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H5_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H6_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H7_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H0_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H1_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H2_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H3_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H4_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H5_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H6_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA3H7_MASK             This_symb_has_been_depreciated
#define ECT_PA32H_PA2H_MASK              This_symb_has_been_depreciated
#define ECT_PA32H_PA2H_BITNUM            This_symb_has_been_depreciated
#define ECT_PA32H_PA3H_MASK              This_symb_has_been_depreciated
#define ECT_PA32H_PA3H_BITNUM            This_symb_has_been_depreciated
#define ECT_PA1H_PA1H0                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H1                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H2                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H3                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H4                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H5                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H6                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H7                   This_symb_has_been_depreciated
#define ECT_PA1H_PA1H0_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H1_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H2_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H3_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H4_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H5_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H6_MASK              This_symb_has_been_depreciated
#define ECT_PA1H_PA1H7_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H0                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H1                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H2                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H3                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H4                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H5                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H6                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H7                   This_symb_has_been_depreciated
#define ECT_PA0H_PA0H0_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H1_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H2_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H3_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H4_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H5_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H6_MASK              This_symb_has_been_depreciated
#define ECT_PA0H_PA0H7_MASK              This_symb_has_been_depreciated
#define ECT_PA10H_PA0H0                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H1                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H2                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H3                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H4                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H5                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H6                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H7                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H0                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H1                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H2                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H3                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H4                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H5                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H6                  This_symb_has_been_depreciated
#define ECT_PA10H_PA1H7                  This_symb_has_been_depreciated
#define ECT_PA10H_PA0H                   This_symb_has_been_depreciated
#define ECT_PA10H_PA1H                   This_symb_has_been_depreciated
#define ECT_PA10H_PA0H0_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H1_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H2_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H3_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H4_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H5_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H6_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H7_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H0_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H1_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H2_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H3_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H4_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H5_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H6_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA1H7_MASK             This_symb_has_been_depreciated
#define ECT_PA10H_PA0H_MASK              This_symb_has_been_depreciated
#define ECT_PA10H_PA0H_BITNUM            This_symb_has_been_depreciated
#define ECT_PA10H_PA1H_MASK              This_symb_has_been_depreciated
#define ECT_PA10H_PA1H_BITNUM            This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC8                   This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC9                   This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC10                  This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC11                  This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC12                  This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC13                  This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC14                  This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC15                  This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC8_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC9_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC10_MASK             This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC11_MASK             This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC12_MASK             This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC13_MASK             This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC14_MASK             This_symb_has_been_depreciated
#define ECT_TC0Hhi_TC15_MASK             This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC0                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC1                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC2                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC3                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC4                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC5                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC6                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC7                   This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC0_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC1_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC2_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC3_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC4_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC5_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC6_MASK              This_symb_has_been_depreciated
#define ECT_TC0Hlo_TC7_MASK              This_symb_has_been_depreciated
#define ECT_TC0H_TC0                     This_symb_has_been_depreciated
#define ECT_TC0H_TC1                     This_symb_has_been_depreciated
#define ECT_TC0H_TC2                     This_symb_has_been_depreciated
#define ECT_TC0H_TC3                     This_symb_has_been_depreciated
#define ECT_TC0H_TC4                     This_symb_has_been_depreciated
#define ECT_TC0H_TC5                     This_symb_has_been_depreciated
#define ECT_TC0H_TC6                     This_symb_has_been_depreciated
#define ECT_TC0H_TC7                     This_symb_has_been_depreciated
#define ECT_TC0H_TC8                     This_symb_has_been_depreciated
#define ECT_TC0H_TC9                     This_symb_has_been_depreciated
#define ECT_TC0H_TC10                    This_symb_has_been_depreciated
#define ECT_TC0H_TC11                    This_symb_has_been_depreciated
#define ECT_TC0H_TC12                    This_symb_has_been_depreciated
#define ECT_TC0H_TC13                    This_symb_has_been_depreciated
#define ECT_TC0H_TC14                    This_symb_has_been_depreciated
#define ECT_TC0H_TC15                    This_symb_has_been_depreciated
#define ECT_TC0H_TC0_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC1_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC2_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC3_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC4_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC5_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC6_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC7_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC8_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC9_MASK                This_symb_has_been_depreciated
#define ECT_TC0H_TC10_MASK               This_symb_has_been_depreciated
#define ECT_TC0H_TC11_MASK               This_symb_has_been_depreciated
#define ECT_TC0H_TC12_MASK               This_symb_has_been_depreciated
#define ECT_TC0H_TC13_MASK               This_symb_has_been_depreciated
#define ECT_TC0H_TC14_MASK               This_symb_has_been_depreciated
#define ECT_TC0H_TC15_MASK               This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC8                   This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC9                   This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC10                  This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC11                  This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC12                  This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC13                  This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC14                  This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC15                  This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC8_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC9_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC10_MASK             This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC11_MASK             This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC12_MASK             This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC13_MASK             This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC14_MASK             This_symb_has_been_depreciated
#define ECT_TC1Hhi_TC15_MASK             This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC0                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC1                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC2                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC3                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC4                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC5                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC6                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC7                   This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC0_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC1_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC2_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC3_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC4_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC5_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC6_MASK              This_symb_has_been_depreciated
#define ECT_TC1Hlo_TC7_MASK              This_symb_has_been_depreciated
#define ECT_TC1H_TC0                     This_symb_has_been_depreciated
#define ECT_TC1H_TC1                     This_symb_has_been_depreciated
#define ECT_TC1H_TC2                     This_symb_has_been_depreciated
#define ECT_TC1H_TC3                     This_symb_has_been_depreciated
#define ECT_TC1H_TC4                     This_symb_has_been_depreciated
#define ECT_TC1H_TC5                     This_symb_has_been_depreciated
#define ECT_TC1H_TC6                     This_symb_has_been_depreciated
#define ECT_TC1H_TC7                     This_symb_has_been_depreciated
#define ECT_TC1H_TC8                     This_symb_has_been_depreciated
#define ECT_TC1H_TC9                     This_symb_has_been_depreciated
#define ECT_TC1H_TC10                    This_symb_has_been_depreciated
#define ECT_TC1H_TC11                    This_symb_has_been_depreciated
#define ECT_TC1H_TC12                    This_symb_has_been_depreciated
#define ECT_TC1H_TC13                    This_symb_has_been_depreciated
#define ECT_TC1H_TC14                    This_symb_has_been_depreciated
#define ECT_TC1H_TC15                    This_symb_has_been_depreciated
#define ECT_TC1H_TC0_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC1_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC2_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC3_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC4_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC5_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC6_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC7_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC8_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC9_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC10_MASK               This_symb_has_been_depreciated
#define ECT_TC1H_TC11_MASK               This_symb_has_been_depreciated
