frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq512.h
#define CAN4TDSR4_DB6_MASK               CAN4TXDSR4_DB6_MASK
#define CAN4TDSR4_DB7_MASK               CAN4TXDSR4_DB7_MASK
#define CAN4TDSR5                        CAN4TXDSR5
#define CAN4TDSR5_DB0                    CAN4TXDSR5_DB0
#define CAN4TDSR5_DB1                    CAN4TXDSR5_DB1
#define CAN4TDSR5_DB2                    CAN4TXDSR5_DB2
#define CAN4TDSR5_DB3                    CAN4TXDSR5_DB3
#define CAN4TDSR5_DB4                    CAN4TXDSR5_DB4
#define CAN4TDSR5_DB5                    CAN4TXDSR5_DB5
#define CAN4TDSR5_DB6                    CAN4TXDSR5_DB6
#define CAN4TDSR5_DB7                    CAN4TXDSR5_DB7
#define CAN4TDSR5_DB0_MASK               CAN4TXDSR5_DB0_MASK
#define CAN4TDSR5_DB1_MASK               CAN4TXDSR5_DB1_MASK
#define CAN4TDSR5_DB2_MASK               CAN4TXDSR5_DB2_MASK
#define CAN4TDSR5_DB3_MASK               CAN4TXDSR5_DB3_MASK
#define CAN4TDSR5_DB4_MASK               CAN4TXDSR5_DB4_MASK
#define CAN4TDSR5_DB5_MASK               CAN4TXDSR5_DB5_MASK
#define CAN4TDSR5_DB6_MASK               CAN4TXDSR5_DB6_MASK
#define CAN4TDSR5_DB7_MASK               CAN4TXDSR5_DB7_MASK
#define CAN4TDSR6                        CAN4TXDSR6
#define CAN4TDSR6_DB0                    CAN4TXDSR6_DB0
#define CAN4TDSR6_DB1                    CAN4TXDSR6_DB1
#define CAN4TDSR6_DB2                    CAN4TXDSR6_DB2
#define CAN4TDSR6_DB3                    CAN4TXDSR6_DB3
#define CAN4TDSR6_DB4                    CAN4TXDSR6_DB4
#define CAN4TDSR6_DB5                    CAN4TXDSR6_DB5
#define CAN4TDSR6_DB6                    CAN4TXDSR6_DB6
#define CAN4TDSR6_DB7                    CAN4TXDSR6_DB7
#define CAN4TDSR6_DB0_MASK               CAN4TXDSR6_DB0_MASK
#define CAN4TDSR6_DB1_MASK               CAN4TXDSR6_DB1_MASK
#define CAN4TDSR6_DB2_MASK               CAN4TXDSR6_DB2_MASK
#define CAN4TDSR6_DB3_MASK               CAN4TXDSR6_DB3_MASK
#define CAN4TDSR6_DB4_MASK               CAN4TXDSR6_DB4_MASK
#define CAN4TDSR6_DB5_MASK               CAN4TXDSR6_DB5_MASK
#define CAN4TDSR6_DB6_MASK               CAN4TXDSR6_DB6_MASK
#define CAN4TDSR6_DB7_MASK               CAN4TXDSR6_DB7_MASK
#define CAN4TDSR7                        CAN4TXDSR7
#define CAN4TDSR7_DB0                    CAN4TXDSR7_DB0
#define CAN4TDSR7_DB1                    CAN4TXDSR7_DB1
#define CAN4TDSR7_DB2                    CAN4TXDSR7_DB2
#define CAN4TDSR7_DB3                    CAN4TXDSR7_DB3
#define CAN4TDSR7_DB4                    CAN4TXDSR7_DB4
#define CAN4TDSR7_DB5                    CAN4TXDSR7_DB5
#define CAN4TDSR7_DB6                    CAN4TXDSR7_DB6
#define CAN4TDSR7_DB7                    CAN4TXDSR7_DB7
#define CAN4TDSR7_DB0_MASK               CAN4TXDSR7_DB0_MASK
#define CAN4TDSR7_DB1_MASK               CAN4TXDSR7_DB1_MASK
#define CAN4TDSR7_DB2_MASK               CAN4TXDSR7_DB2_MASK
#define CAN4TDSR7_DB3_MASK               CAN4TXDSR7_DB3_MASK
#define CAN4TDSR7_DB4_MASK               CAN4TXDSR7_DB4_MASK
#define CAN4TDSR7_DB5_MASK               CAN4TXDSR7_DB5_MASK
#define CAN4TDSR7_DB6_MASK               CAN4TXDSR7_DB6_MASK
#define CAN4TDSR7_DB7_MASK               CAN4TXDSR7_DB7_MASK
#define CAN4TDLR                         CAN4TXDLR
#define CAN4TDLR_DLC0                    CAN4TXDLR_DLC0
#define CAN4TDLR_DLC1                    CAN4TXDLR_DLC1
#define CAN4TDLR_DLC2                    CAN4TXDLR_DLC2
#define CAN4TDLR_DLC3                    CAN4TXDLR_DLC3
#define CAN4TDLR_DLC                     CAN4TXDLR_DLC
#define CAN4TDLR_DLC0_MASK               CAN4TXDLR_DLC0_MASK
#define CAN4TDLR_DLC1_MASK               CAN4TXDLR_DLC1_MASK
#define CAN4TDLR_DLC2_MASK               CAN4TXDLR_DLC2_MASK
#define CAN4TDLR_DLC3_MASK               CAN4TXDLR_DLC3_MASK
#define CAN4TDLR_DLC_MASK                CAN4TXDLR_DLC_MASK
#define CAN4TDLR_DLC_BITNUM              CAN4TXDLR_DLC_BITNUM
#define CAN4TTBPR                        CAN4TXTBPR
#define CAN4TTBPR_PRIO0                  CAN4TXTBPR_PRIO0
#define CAN4TTBPR_PRIO1                  CAN4TXTBPR_PRIO1
#define CAN4TTBPR_PRIO2                  CAN4TXTBPR_PRIO2
#define CAN4TTBPR_PRIO3                  CAN4TXTBPR_PRIO3
#define CAN4TTBPR_PRIO4                  CAN4TXTBPR_PRIO4
#define CAN4TTBPR_PRIO5                  CAN4TXTBPR_PRIO5
#define CAN4TTBPR_PRIO6                  CAN4TXTBPR_PRIO6
#define CAN4TTBPR_PRIO7                  CAN4TXTBPR_PRIO7
#define CAN4TTBPR_PRIO0_MASK             CAN4TXTBPR_PRIO0_MASK
#define CAN4TTBPR_PRIO1_MASK             CAN4TXTBPR_PRIO1_MASK
#define CAN4TTBPR_PRIO2_MASK             CAN4TXTBPR_PRIO2_MASK
#define CAN4TTBPR_PRIO3_MASK             CAN4TXTBPR_PRIO3_MASK
#define CAN4TTBPR_PRIO4_MASK             CAN4TXTBPR_PRIO4_MASK
#define CAN4TTBPR_PRIO5_MASK             CAN4TXTBPR_PRIO5_MASK
#define CAN4TTBPR_PRIO6_MASK             CAN4TXTBPR_PRIO6_MASK
#define CAN4TTBPR_PRIO7_MASK             CAN4TXTBPR_PRIO7_MASK
#define CAN4TTSRH                        CAN4TXTSRH
#define CAN4TTSRH_TSR8                   CAN4TXTSRH_TSR8
#define CAN4TTSRH_TSR9                   CAN4TXTSRH_TSR9
#define CAN4TTSRH_TSR10                  CAN4TXTSRH_TSR10
#define CAN4TTSRH_TSR11                  CAN4TXTSRH_TSR11
#define CAN4TTSRH_TSR12                  CAN4TXTSRH_TSR12
#define CAN4TTSRH_TSR13                  CAN4TXTSRH_TSR13
#define CAN4TTSRH_TSR14                  CAN4TXTSRH_TSR14
#define CAN4TTSRH_TSR15                  CAN4TXTSRH_TSR15
#define CAN4TTSRH_TSR8_MASK              CAN4TXTSRH_TSR8_MASK
#define CAN4TTSRH_TSR9_MASK              CAN4TXTSRH_TSR9_MASK
#define CAN4TTSRH_TSR10_MASK             CAN4TXTSRH_TSR10_MASK
#define CAN4TTSRH_TSR11_MASK             CAN4TXTSRH_TSR11_MASK
#define CAN4TTSRH_TSR12_MASK             CAN4TXTSRH_TSR12_MASK
#define CAN4TTSRH_TSR13_MASK             CAN4TXTSRH_TSR13_MASK
#define CAN4TTSRH_TSR14_MASK             CAN4TXTSRH_TSR14_MASK
#define CAN4TTSRH_TSR15_MASK             CAN4TXTSRH_TSR15_MASK
#define CAN4TTSRL                        CAN4TXTSRL
#define CAN4TTSRL_TSR0                   CAN4TXTSRL_TSR0
#define CAN4TTSRL_TSR1                   CAN4TXTSRL_TSR1
#define CAN4TTSRL_TSR2                   CAN4TXTSRL_TSR2
#define CAN4TTSRL_TSR3                   CAN4TXTSRL_TSR3
#define CAN4TTSRL_TSR4                   CAN4TXTSRL_TSR4
#define CAN4TTSRL_TSR5                   CAN4TXTSRL_TSR5
#define CAN4TTSRL_TSR6                   CAN4TXTSRL_TSR6
#define CAN4TTSRL_TSR7                   CAN4TXTSRL_TSR7
#define CAN4TTSRL_TSR0_MASK              CAN4TXTSRL_TSR0_MASK
#define CAN4TTSRL_TSR1_MASK              CAN4TXTSRL_TSR1_MASK
#define CAN4TTSRL_TSR2_MASK              CAN4TXTSRL_TSR2_MASK
#define CAN4TTSRL_TSR3_MASK              CAN4TXTSRL_TSR3_MASK
#define CAN4TTSRL_TSR4_MASK              CAN4TXTSRL_TSR4_MASK
#define CAN4TTSRL_TSR5_MASK              CAN4TXTSRL_TSR5_MASK
#define CAN4TTSRL_TSR6_MASK              CAN4TXTSRL_TSR6_MASK
#define CAN4TTSRL_TSR7_MASK              CAN4TXTSRL_TSR7_MASK
#define CAN4TTSR                         CAN4TXTSR
#define CAN4TTSR_TSR0                    CAN4TXTSR_TSR0
#define CAN4TTSR_TSR1                    CAN4TXTSR_TSR1
#define CAN4TTSR_TSR2                    CAN4TXTSR_TSR2
#define CAN4TTSR_TSR3                    CAN4TXTSR_TSR3
#define CAN4TTSR_TSR4                    CAN4TXTSR_TSR4
#define CAN4TTSR_TSR5                    CAN4TXTSR_TSR5
#define CAN4TTSR_TSR6                    CAN4TXTSR_TSR6
#define CAN4TTSR_TSR7                    CAN4TXTSR_TSR7
#define CAN4TTSR_TSR8                    CAN4TXTSR_TSR8
#define CAN4TTSR_TSR9                    CAN4TXTSR_TSR9
#define CAN4TTSR_TSR10                   CAN4TXTSR_TSR10
#define CAN4TTSR_TSR11                   CAN4TXTSR_TSR11
#define CAN4TTSR_TSR12                   CAN4TXTSR_TSR12
#define CAN4TTSR_TSR13                   CAN4TXTSR_TSR13
#define CAN4TTSR_TSR14                   CAN4TXTSR_TSR14
#define CAN4TTSR_TSR15                   CAN4TXTSR_TSR15
#define CAN4TTSR_TSR0_MASK               CAN4TXTSR_TSR0_MASK
#define CAN4TTSR_TSR1_MASK               CAN4TXTSR_TSR1_MASK
#define CAN4TTSR_TSR2_MASK               CAN4TXTSR_TSR2_MASK
#define CAN4TTSR_TSR3_MASK               CAN4TXTSR_TSR3_MASK
#define CAN4TTSR_TSR4_MASK               CAN4TXTSR_TSR4_MASK
#define CAN4TTSR_TSR5_MASK               CAN4TXTSR_TSR5_MASK
#define CAN4TTSR_TSR6_MASK               CAN4TXTSR_TSR6_MASK
#define CAN4TTSR_TSR7_MASK               CAN4TXTSR_TSR7_MASK
#define CAN4TTSR_TSR8_MASK               CAN4TXTSR_TSR8_MASK
#define CAN4TTSR_TSR9_MASK               CAN4TXTSR_TSR9_MASK
#define CAN4TTSR_TSR10_MASK              CAN4TXTSR_TSR10_MASK
#define CAN4TTSR_TSR11_MASK              CAN4TXTSR_TSR11_MASK
#define CAN4TTSR_TSR12_MASK              CAN4TXTSR_TSR12_MASK
#define CAN4TTSR_TSR13_MASK              CAN4TXTSR_TSR13_MASK
#define CAN4TTSR_TSR14_MASK              CAN4TXTSR_TSR14_MASK
#define CAN4TTSR_TSR15_MASK              CAN4TXTSR_TSR15_MASK
#define ATD0CTL2_AWAI                    ATD0CTL2_ICLKSTP
#define ATD0CTL2_AWAI_MASK               ATD0CTL2_ICLKSTP_MASK
#define ATD0CTL23_AWAI                   ATD0CTL23_ICLKSTP
#define ATD0CTL23_AWAI_MASK              ATD0CTL23_ICLKSTP_MASK
#define XGMCTL_XGSWEIFM                  XGMCTL_XGSWEFM
#define XGMCTL_XGSWEIFM_MASK             XGMCTL_XGSWEFM_MASK
#define NVFSEC_RNV6                      NVFSEC_KEYEN0
#define NVFSEC_RNV6_MASK                 NVFSEC_KEYEN0_MASK


/* **** 2.10.2007 15:15:29 */

